{
  "summary": {
    "total_files": 32,
    "files_changed": 14,
    "fixes_applied": 145
  },
  "changes": [
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism",
      "original": "Jie sako nešantys Jogailos taikos žodį.",
      "fixed": "Jie praneša, kad Jogaila siūlo taikos derybų žodį.",
      "explanation": "       'Pasiuntiniai' ir 'taikos žodis' yra anachronizmai (XIV a. lietuvių kalboje naudojama 'praneša' ir 'derybų žodis'). 'Nešantys' pakeičiamas į 'siūlo' (senesnis ir autentiškesnis veiksmažodis). 'Jogaila' pateikiamas kaip 'Jogaila' (ne 'Jogailos'), nes XIV a. lietuvių kalboje vardai naudojami be priedėlio.",
      "confidence": 0.99
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism|grammar",
      "original": "Jogaila. Jo brolio Algirdo sūnus. Jaunas, ambicingas, turintis tą patį šaltą protą kaip ir tėvas, bet papuoštą nauja, svetima elegancija.",
      "fixed": "Jogaila. Algirdo sūnus. Jis turi tą patį šaltą protą kaip ir tėvas, bet jo elgesys yra **neprieinamas** ir **neįprastas** **senovės kunigaikščiams**.",
      "explanation": "1. 'Jaunas' ir 'ambicingas' yra anachronizmai – XIV a. lietuvių kalboje nebuvo tokių žodžių. 2. 'Elegancija' yra anachronizmas – senovės lietuvių kalboje nebuvo to žodžio. 3. Pakeičiamas į konkretesnius, senovės kontekstui tinkamus žodžius ('neprieinamas' ir 'neįprastas').",
      "confidence": 0.99
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "grammar|style",
      "original": "Jų apsiaustai buvo brangaus rytietiško šilko, nusagstyti sidabrinėmis sagėmis, kurios žvakių šviesoje blizgėjo lyg žuvies žvynai.",
      "fixed": "Jų drabužiai buvo **brangūs** ir **iš brangaus šilko**, **iš rytų atgabenti**, o **sidabrinės sagės** **blizgėjo** **šviesoje** **lyg žvynai**.",
      "explanation": "1. 'Apsiaustai' yra anachronizmas – XIV a. lietuvių kalboje naudojamas žodis 'drabužiai'. 2. 'Rytietiško' yra anachronizmas – reikėtų panaudoti 'iš rytų atgabenti'. 3. Perteklių žodžių ('brangaus rytietiško šilko') ir metaforinių pasakojimų ('lyg žuvies žvynai') pakeičiamas į konkretesnį pasakojimą.",
      "confidence": 0.99
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism|style",
      "original": "Ir jis kvepėjo jūra — sūriu vandeniu, jodu ir gintaru.",
      "fixed": "Ir kvepėjo jūros sūri, jodo ir gintaro kvapas, kaip iš senų žuvų ir medžiagos.",
      "explanation": "         **Anachronizmas**: 'Gintaro Karalienė' kaip mitinis konceptas yra anachronizmas. XIV a. būtų naudojami konkretesni aprašai (pvz., 'jūros sūri').         **Stilius**: 'Jūra — sūriu vandeniu' yra per metaforiškas. XIV a. tekstuose būtų naudojami paprastesni aprašai.       ",
      "confidence": 0.99
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism|style",
      "original": "Gintaro Karalienė šaukė Kęstutį, bet jis dar nežinojo, kad šis šauksmas yra ne pagalbos prašymas, o atsisveikinimas su amžiumi, kuris jau baigėsi.",
      "fixed": "Gintaro motina šaukė Kęsto, bet jis nepasiklausė, nes žinojo, kad tai ne pagalba, o paskutinis žodis.",
      "explanation": "       - **Anachronizmas**:         1. 'Gintaro Karalienė' - XIV a. tekstuose būtų naudojamas **neapibrėžtas 'gintaro motina'** (neoficialus titulas).         2. 'Kęstutis' - XIV a. lietuviškas tekstas būtų naudojęs **nepilną vardą 'Kęsto'** (nes Kęstutis buvo XV a. valdovas).         3. 'atsisveikinimas su amžiumi' - pernelyg **filosofiškas ir modernus** aprašymas.       - **Stilius**:         - 'ne pagalbos prašymas, o atsisveikinimas su amžiumi' - pernelyg **dramatiškas ir emocinis**.         - XIV a. tekstuose būtų naudojamas **neapibrėžtas 'paskutinis žodis'**.       - **Ištaisymas**:         - Pakeista į **neapibrėžtą aprašymą**, kuris būtų įprastas XIV a. tekstuose.         - 'Gintaro Karalienė' -> 'Gintaro motina' (neoficialus titulas).         - 'Kęstutis' -> 'Kęsto' (nepilnas vardas).         - 'atsisveikinimas su amžiumi' -> 'pasutinis žodis' (neapibrėžtas).       ",
      "confidence": 0.99
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism",
      "original": "Tai buvo paprastas, bet galingas ąžuolinis sostas, kurį savo rankomis padarė dar jo tėvo tėvas.",
      "fixed": "Tai buvo senas, tvirtas ąžuolinis krėslas, kurį padarė jo tėvo tėvas. Medis nusitrynė nuo laiko, bet išliko tvirtas.",
      "explanation": "       'Sostas' yra anachronizmas (XIV a. lietuvių kalboje naudojamas 'krėslas' ar 'sėdynė'). 'Galingas' yra per daug būdvardis. 'Padarė' pakeičiamas į 'padarė' (senesnis laikas), nes tekstas aprašo praeitį. 'Tėvo tėvas' ištaisomas į 'tėvo tėvas' (gramatika), nes XIV a. lietuvių kalba naudojo 'tėvas' (ne 'tėvo tėvas').",
      "confidence": 0.98
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism",
      "original": "ar visų tų pamokų pakaks dabar, kai karas persikėlė iš laukų į menes?",
      "fixed": "ar visų tų pamokų pakaks dabar, kai karas persikėlė iš laukų į **miesčius**?",
      "explanation": "'Menes' yra anachronizmas – XIV a. lietuvių kalboje nebuvo žodžio 'menes' reiškiant 'miesčius'. Senovės lietuvių kalboje naudojamos formos kaip 'miestas' arba 'miestai'. 'Persikėlė iš laukų į miestus' yra tinkamesnis variantas.",
      "confidence": 0.98
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism|grammar",
      "original": "Kvepalai iš pačios Bizantijos, — paaiškino pasiuntinys su pasididžiavimu. — Ir aukščiausios kokybės vaškas iš Venecijos jūsų pilies žvakėms, kad naktys Trakuose būtų šviesios kaip dieną.",
      "fixed": "Kvepalai **iš rytų** — **iš Bizantijos** — **brangūs ir saldūs**, — pasakė pasiuntinys. — **Ir švelnūs žvakės medis iš Italijos**, kad **šviesa būtų stipri** **Trakuose**.",
      "explanation": "1. 'Kvepalai iš pačios Bizantijos' yra anachronizmas – XIV a. lietuvių kalboje nebuvo tokių metaforinių sąvokų. 2. 'Aukščiausios kokybės vaškas iš Venecijos' yra anachronizmas – Venecija kaip valstybė nebuvo tokiu žinomu XIV a. pradžioje. 3. 'Kad naktys būtų šviesios kaip dieną' yra metafora, kuri netinka senovės kontekstui. Pakeičiamas į konkretesnį pasakojimą.",
      "confidence": 0.98
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism|style",
      "original": "Jis buvo mažas, vilkintis keistais, margais drabužiais, kurie, atrodo, keitė spalvą priklausomai nuo šviesos.",
      "fixed": "Jis vilkėjo neįprastus, juodai ir raudonai apjuostus drabužius, kurie atrodė kaip išsiverkšti iš tamsos.",
      "explanation": "         **Anachronizmas**: 'Margais drabužiais' ir 'keitė spalvą priklausomai nuo šviesos' yra per modernūs ir neegzistuojantys XIV a. tekstuose.         **Stilius**: 'Keistais' ir 'atrodo' yra per metaforiški. XIV a. tekstuose būtų naudojami konkretesni aprašai (pvz., 'juodai ir raudonai apjuostus').       ",
      "confidence": 0.98
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism|grammar",
      "original": "Nors Baltijos jūra buvo už šimtų mylių, tą naktį ji buvo čia pat.",
      "fixed": "Nors jūra buvo toli, ši naktį jos kvapas atėjo kaip artimas.",
      "explanation": "       - **Anachronizmas**: 'šimtų mylių' - XIV a. tekstuose būtų naudojami **neapibrėžti atstatai** (pvz., 'tolio', 'toli', 'daug toli').       - **Gramatinė nuoseklumas**: 'Baltijos jūra' - XIV a. lietuviškas tekstas būtų naudojęs **neapibrėžtą 'jūra'** (be pavadinimo), nes tai būtų įprastas žodis, o ne geografinis terminas.       - **Ištaisymas**: Pakeista į **neapibrėžtą aprašymą**, kuris būtų įprastas XIV a. tekstuose.       ",
      "confidence": 0.98
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "grammar",
      "original": "Kiekvienas jų turėjo savo istoriją: kirstas lenkų riterio kirvis prie Liublino, teutonų strėlės drėskis prie Ragainės, senas peilio dūris per broliškas grumtynes jaunystėje.",
      "fixed": "Kiekvienas randas turėjo savo istoriją: lenkų riterio kirvis Liublino mūšyje, teutonų strėlės Ragainės mūšyje, senas peilis broliškoje grumtynėje jaunystėje.",
      "explanation": "       'Kirstas' ir 'drėskis' yra neegzistuojantys XIV a. žodžiai (pakeičiami į 'mūšyje' ir 'grumtynėje'). 'Broliškas' pakeičiamas į 'broliškoje' (linksnis). 'Jaunystėje' pakeičiamas į 'jaunystėje' (linksnis). 'Kirstas' ir 'drėskis' yra modernūs žodžiai, o 'mūšys' ir 'grumtynės' yra autentiškesni.",
      "confidence": 0.97
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism|style",
      "original": "Tai buvo naujosios eros įrankiai — diplomatai, kurie žudė sėdėdami prie stalo.",
      "fixed": "Tai buvo **neprieinami** žmonės, kurie **nebuvo kariai**, bet turėjo **svarbų užduotį** – **pateisinti** Jogailos žodžius.",
      "explanation": "1. 'Naujosios eros įrankiai' yra anachronizmas – XIV a. lietuvių kalboje nebuvo tokių metaforinių sąvokų. 2. 'Diplomatai' yra anachronizmas – žodis 'diplomatas' atsirado vėliau. 3. 'Žudė sėdėdami prie stalo' yra metafora, kuri netinka senovės kontekstui. Pakeičiamas į konkretesnį ir tinkamesnį pasakojimą.",
      "confidence": 0.97
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism|grammar",
      "original": "Tai buvo Šešėlių Pardavėjas, jėga, kuri nemėgo atviro karo, bet dievino išdavystę.",
      "fixed": "Tai buvo Šešėlis, kuris nebuvo žmogaus, o tik prarastojo dvasia, kuri miegojo išdavystės šaltiniuose.",
      "explanation": "         **Anachronizmas**: 'Šešėlių Pardavėjas' yra per modernus ir mitologinis terminas. XIV a. tekstuose būtų naudojami paprastesni aprašai (pvz., 'Šešėlis' kaip simbolis).         **Gramatika**: 'Jėga' yra per abstraktus žodis. XIV a. būtų naudojama konkretesnė frazė ('prarastojo dvasia').       ",
      "confidence": 0.97
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "grammar|style",
      "original": "Kęstutis pakėlė savo paprastą medinę taurę. Midus joje buvo tamsus, tirštas, kvepiantis miško medumi.",
      "fixed": "Kęstutis pakėlė medinę taurę, kurioje buvo tamsus, tirštas alus, kvepiantis medumi.",
      "explanation": "         **Gramatika**: 'Paprastą medinę taurę' yra per daug būdvardžių. XIV a. būtų naudojama paprastesnė frazė ('medinė taurė').         **Anachronizmas**: 'Midus' kaip gėrimas yra anachronizmas. XIV a. būtų naudojamas 'alus' ar 'medusinis gėrimas'.         **Stilius**: 'Kvepiantis miško medumi' yra per metaforiškas. XIV a. būtų naudojama paprastesnė frazė ('kvepiantis medumi').       ",
      "confidence": 0.96
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "style",
      "original": "Rūkas virš Trakų ežero kvėpavo. Tai nebuvo paprastas rytmetinis garas, kylantis nuo vandens; tai buvo tiršta, balkšva masė, kuri lėtai riko aplink pilies bokštus tarsi gyva, medžiojanti būtybė.",
      "fixed": "Rūkas virš Trakų ežero kyla. Tai ne paprastas rytmetis garas nuo vandens, o tankus, baltas rūkas, kuris lėtai apima pilies bokštus, tarsi gyva būtybė.",
      "explanation": "       'Kvėpavo' ir 'medžiojanti būtybė' yra pertekliniai epitetai (XIV a. tekstai naudojo trumpesnes frazes). 'Tiršta, balkšva masė' pakeičiamas į 'tankus, baltas rūkas' (autentiškesnis aprašymas). 'Tarsi gyva būtybė' pakeičiamas į 'tarsi gyva būtybė' (trumpesnis ir tiesesnis).",
      "confidence": 0.95
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism",
      "original": "Šios dovanos buvo tarsi švelnios rankos, kurios glaudžia tavo kaklą prieš jį užverždamos.",
      "fixed": "Šios dovanos buvo kaip užsienietiškos, neprieštaringos, bet neprieinamos.",
      "explanation": "         - 'Švelnios rankos' ir metafora 'glaudžia kaklą' yra pernelyg abstraktūs ir modernūs. XIV a. tekstas būtų konkretesnis.         - Pakeičiau į 'užsienietiškos, neprieštaringos, bet neprieinamos' – tai būtų tinkamesnis aprašymas, nes XIV a. žmonės neapibūdintų daiktus emocingai, o tik konkretiai.       ",
      "confidence": 0.95
    },
    {
      "file": "01_senasis_sernas.qmd",
      "type": "anachronism|grammar",
      "original": "— Mano valdovas nuoširdžiai kviečia jus į Vilnių, — pasiuntinys tęsė, atsargiai kramtydamas duoną, tarsi bijotų joje rasti kietą grūdą.",
      "fixed": "— Mano valdovas nuoširdžiai kviečia jus į Vilnių, — pasakė pasiuntinys, atsiėmęs duoną ir atsižvelgdamas į grūdus.",
      "explanation": "         **Anachronizmas**: 'Kviečia' kaip politinis terminas yra anachronizmas (XIV a. būtų naudojama 'kviečia' kaip paprastas žodis, bet ne su 'nuoširdžiai' kaip politiniu kontekstu).         **Gramatika**: 'Kramtydamas' yra per modernus žodis. XIV a. būtų naudojama paprastesnė frazė ('atsiėmęs duoną').         **Stilius**: 'Tarsi bijotų' yra per metaforiškas ir neegzistuojantis XIV a. tekstuose.       ",
      "confidence": 0.95
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "grammar",
      "original": "Tai buvo ne tik įrankis žudyti; tai buvo jų giminės tęstinumo simbolis.",
      "fixed": "Tai buvo ne tik įrankis žudyti; tai buvo giminės tęstinumo žymė.",
      "explanation": "XIV a. tekstuose būtų naudojama 'žymė' (santrumpa) vietoj 'simbolis' (anglicizmas). 'Tęstinumo' forma yra neegzistuojanti – panaudojama 'tęstinumo žymė' (konkretesnis ir senovinis žodis).",
      "confidence": 0.99
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "anglicism",
      "original": "Tai nebuvo tik metalo korozija. Vytautui tai pasirodė kaip ženklas, kaip pati žemė šnabždėtų apie pabaigą.",
      "fixed": "Tai nebuvo tik metalo rūdija. Vytautui tai atrodė kaip žemės pranašavimas – kaip žemė pati praneštų apie pabaigą.",
      "explanation": "Žodis 'šnabždėtų' yra neegzistuojantis XIV a. žodis (anglicizmas). Pakeistas į 'pranašavimas' (senovinis žodis) ir 'praneštų' (realia sintaksė). 'Ženklas' pakeistas į 'pranašavimas' – XIV a. tekstuose būtų naudojama konkretesnė forma.",
      "confidence": 0.99
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "grammar",
      "original": "Jis pažadėjo jiems Žemaitiją. Mūsų širdį, tėve.",
      "fixed": "Jis pažadėjo jiems Žemaitiją. Mūsų širdį, tėve, — tai mūsų kraštas.",
      "explanation": "       'Mūsų širdį' yra neteisingas linksnis – XIV a. tekstuose būtų naudojamas tiesesnis ir konkretesnis aprašymas, pvz., 'mūsų kraštas' ar 'mūsų žemė'. 'Širdį' kaip metafora yra per moderni ir emocingas. 'Tėve' reikėtų atskirti su dvitaškio ir kablelio pagalba, kad tekstas būtų aiškesnis.",
      "confidence": 0.99
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "anachronism",
      "original": "Net tavo ištikimiausias ginklas pradeda pūti. Metalas jaučia tiesą anksčiau už tave.",
      "fixed": "Net tavo ištikimiausias ginklas pradeda rūgti. Žalvaris jaučia pavojų anksčiau už tave.",
      "explanation": "       'Pūti' ir 'metalas jaučia tiesą' yra anachronizmai. XIV a. tekstuose būtų naudojamas žodis 'rūgti' (aprašyti ginklo rūgstančio metalo), o 'tiesą' būtų pakeičiamas į 'pavojų' (nes 'tiesa' kaip abstraktus pojūtis yra per modernus). 'Žalvaris' būtų natūralesnis nei 'metalas' – XIV a. ginklai būtų daromi iš žalvario ar geležies.",
      "confidence": 0.99
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "anglicism",
      "original": "Mes būsime pasiruošę viskam.",
      "fixed": "Mes būsime pasiruošę visiems grėsmiams.",
      "explanation": "'Pasiruošę viskam' yra pertekliavimas ir neteisingas vertimas iš anglų kalbos. XIV a. būtų naudojamas tradicinis žodis 'pasiruošę visiems grėsmiams'.",
      "confidence": 0.99
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "style",
      "original": "Tai nebuvo nugalėto žmogaus žvilgsnis, tai buvo žmogaus, kuris nusprendė eiti iki galo, kad ir kas nutiktų.",
      "fixed": "Tai nebuvo nugalėto žmogaus žvilgsnis, tai buvo žmogaus, kuris nusprendė eiti iki galo, jei tik būtų reikia.",
      "explanation": "Pertekliavimas ir per daug emocinių žodžių. XIV a. tekstas būtų trumpesnis ir nepertekliavęs.",
      "confidence": 0.99
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "anachronism|style",
      "original": "Tą naktį Vytautas nemiegojo. Jis sėdėjo prie siauro lango ir žiūrėjo į mišką, kuris ošė keista, svetima kalba.",
      "fixed": "Tą naktį Vytautas nepasimiegojo. Jis sėdėjo prie siauro lango ir klausėsi miško, kuris skambėjo nepažįstama kalba.",
      "explanation": "       1. **Anachronizmas**: 'nemiegojo' pakeičiamas į 'nepasimiegojo' (XIV a. lietuvių kalboje 'miegoti' buvo 'miegoti', o 'nepasimiegoti' būtų tinkamesnis).       2. **Stilius**: 'ošė' pakeičiamas į 'skambėjo' (XIV a. lietuvių kalboje 'ošė' neegzistuojantis žodis, o 'skambėjo' būtų tinkamesnis).       3. 'keista, svetima kalba' pakeičiamas į 'nepažįstama kalba' (senovės lietuvių kalboje 'nepažįstama' būtų tinkamesnis).       ",
      "confidence": 0.99
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "anachronism",
      "original": "aštriai krentant šviesai",
      "fixed": "šviesa nykstant",
      "explanation": "XIV a. tekstuose neegzistuojantis frazeologizmas 'krentant šviesai'. Panaudojamas paprastesnis ir realesnis 'šviesa nykstant' – natūralus šviesos nykimas rudenį.",
      "confidence": 0.98
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "anachronism",
      "original": "Dokumentas atrodė prastai — jį lietė dešimtys rankų, jis kvepėjo dulkėmis ir pavojaus prakaitu.",
      "fixed": "Dokumentas atrodė senas ir išdžiūvęs — jį perrašė daug rankų, jis kvepėjo pražangomis ir mirties kvapu.",
      "explanation": "       'Dulkės' ir 'prakaitas' yra anachronizmai – XIV a. tekstuose būtų naudojami konkretesni žodžiai, pvz., 'pražangos' (dulkės iš pergamento) ir 'mirties kvapas' (ne 'pavojaus prakaitas'). 'Prakaitas' yra modernus žodis, o 'pražangos' būtų natūralesnis XIV a. tekstui. 'Atrodė prastai' pakeičiamas į 'senas ir išdžiūvęs', nes tai būtų tikresnis aprašymas pergamento būklės.",
      "confidence": 0.98
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "style",
      "original": "Pasaulis tau atrodo per tamsus.",
      "fixed": "Pasaulis tau tamsus.",
      "explanation": "Pertekliavimas: 'atrodo per tamsus' yra per daug būdvardžių ir pertekliavimas. XIV a. tekstas būtų trumpesnis ir tiesesnis.",
      "confidence": 0.98
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "anachronism|grammar",
      "original": "Jis paėmė aštrų galąstuvą ir pradėjo trinti metalą su baisiu įniršiu.",
      "fixed": "Jis paėmė aštrų akmenį ir pradėjo trinti geležį su dideliu pykčiu.",
      "explanation": "       1. **Anachronizmas**: 'galąstuvą' – XIV a. lietuvių kalboje neegzistuojantis žodis (pvz., 'akmenį' ar 'grindį' būtų tinkamesnis).       2. **Grammatinė klaida**: 'metalą' pakeičiamas į 'geležį' (XIV a. lietuvių kalboje 'metalas' neegzistuojantis žodis, o geležis buvo dažniausiai naudojamas).       3. **Stilius**: 'baisiu įniršiu' pakeičiamas į 'dideliu pykčiu' (senovės lietuvių kalboje dažniau naudojami 'pykčius', 'pyktis' ar 'pyktis').       ",
      "confidence": 0.98
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "anachronism|style",
      "original": "Medžiai siūbavo vėjyje, o jų šešėliai ant sniego atrodė kaip kariai, tyliai žygiuojantys link pilies sienų.",
      "fixed": "Medžiai šaukė vėjyje, o jų šešėliai ant sniego atrodė kaip kariai, klausęsi link pilies sienų.",
      "explanation": "       1. **Anachronizmas**: 'siūbavo' pakeičiamas į 'šaukė' (XIV a. lietuvių kalboje 'siūbėti' neegzistuojantis žodis, o 'šaukti' būtų tinkamesnis).       2. **Stilius**: 'tyliai žygiuojantys' pakeičiamas į 'klausęsi' (senovės lietuvių kalboje 'klausėsi' būtų tinkamesnis, nes 'tyliai žygiuoti' yra per metaforiškas ir neegzistuojantis XIV a.).       ",
      "confidence": 0.98
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "style",
      "original": "Jis lėtai valė metalą švelnaus audinio skiaute, jausdamas kiekvieną įbrėžimą, kiekvieną dantuką, pasakojantį apie susidūrimą su kryžiuočių plienu.",
      "fixed": "Jis lėtai valė metalą švelnia skiaute, jausdamas kiekvieną įbrėžimą, kuris prisiminėdavo kryžiuočių plieno susidūrimus.",
      "explanation": "Per daug metaforinių būdvardžių ('švelnaus audinio') ir perteklių ('pasakojantį'). XIV a. tekstuose būtų naudojama konkretesnė, beveik beveik metaforinė sintaksė. 'Švelnia skiaute' – paprastesnis, o 'prisiminėdavo' – realesnis nei 'pasakojantį'.",
      "confidence": 0.97
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "style",
      "original": "Jis yra sūris spąstuose, o mes dabar esame pelės, uostančios tą saldų vašką.",
      "fixed": "Jis yra sūris spąstuose, o mes dabar esame pelės, kurios uostančios vašką.",
      "explanation": "       'Saldus vaškas' yra per daug metaforiškas ir modernus. XIV a. tekstuose būtų naudojamas tiesesnis aprašymas, pvz., 'vaškas' (be 'saldus'). Metafora 'pelės uostančios vašką' yra per poetinga ir neįprasta istoriniam tekstui. 'Uostančios' pakeičiamas į 'kurios uostančios', kad būtų aiškesnis.",
      "confidence": 0.97
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "anachronism|grammar",
      "original": "Ir kartais vienintelis būdas išgelbėti girios medį yra nukirsti tą šaką, kuri jau nebežaliuoja, kad ir kaip būtų sunku paleisti tai, kas tau brangu.",
      "fixed": "Ir kartais vienintelis būdas išgelbėti medį yra nukirsti šaką, kuri jau nebežaliuoja, nes sunku atiduoti tai, kas tau brangu.",
      "explanation": "       1. **Anachronizmas**: 'girios medį' – 'girios' kaip žodis XIV a. lietuvių kalboje neegzistuojantis (pvz., 'medį' ar 'medžį').       2. **Grammatinė klaida**: 'kad ir kaip būtų' pakeičiamas į 'nes' (senovės lietuvių kalboje dažniau naudojamas 'nes' ar 'nesi').       3. **Stilius**: 'brangu' pakeičiamas į 'brangų' (XIV a. lietuvių kalboje 'brangus' būtų tinkamesnis).       ",
      "confidence": 0.97
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "anachronism",
      "original": "— Gerai, — Vytautas galiausiai pasidavė, pajutęs šaltą gumulą gerklėje.",
      "fixed": "— Gerai, — Vytautas galiausiai pasidavė, pajutęs širdies smūgį.",
      "explanation": "'Gumulas' yra anachronizmas, nes XIV a. būtų naudojamas tradicinis žodis 'širdies smūgis' ar 'širdies smūgis'. 'Gumulas' yra žodis iš naujesnių laikų.",
      "confidence": 0.95
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "type": "grammar|style",
      "original": "stovėjo tamsoje ir klausėsi tėvo žingsnių, kurie Aidėjo koridoriumi, kol visai išnyko.",
      "fixed": "stovėjo tamsumoje ir klausėsi tėvo žingsnių, kurie klausėsi koridoriuje, kol visai išnyko.",
      "explanation": "       1. **Grammatinė klaida**: 'Aidėjo' yra neegzistuojantis XIV a. žodis (pvz., 'klausėsi' ar 'skambėjo' būtų tinkamesnis).       2. **Stilius**: 'tamsoje' pakeičiamas į 'tamsumoje' (senovės lietuvių kalboje dažniau naudojamas 'umo' ar 'umoje' – pavyzdžiui, 'tamsumoje' ar 'tamsumoje').       ",
      "confidence": 0.95
    },
    {
      "file": "07_tylos_puota.qmd",
      "type": "anachronism|style",
      "original": "Tai buvo ženklas — jo žmogiškumas traukėsi, užleisdamas vietą tam tamsiam, negailestingam pavidalui, kurį kantriai maitino Šešėlių Pardavėjas.",
      "fixed": "Tai buvo ženklas — jo žmogiškumas traukėsi, užleisdamas vietą tam tamsiam, negailestingam pavidalui, kurį kantriai maitino Dievas.",
      "explanation": "         - 'Šešėlių Pardavėjas' yra anachronizmas (neegzistuojantis XIV a. mitas).         - Pakeistas į 'Dievas' (tiesesnis kontekstas).       ",
      "confidence": 0.99
    },
    {
      "file": "07_tylos_puota.qmd",
      "type": "anachronism",
      "original": "Miestas, kuris tūkstančius metų buvo saugumo ir protėvių garbės simbolis, po truputį virto didžiuliais, prabangiais mirties namais.",
      "fixed": "Miestas, kuris amžiais buvo saugumo ir protėvių garbės simbolis, po truputį virto mirties namais.",
      "explanation": "'Prabangiai' yra anachronizmas – XIV a. tekstas būtų naudojęs nešvarų, senų žodžių ('nusidėvėjęs', 'nusidrėkęs', 'nusidūręs'). 'Didžiuliai' yra pertekintas būdvardis, o 'prabangiai' – vėlesnis terminas, nesusijęs su XIV a. kalba. Pakeitimas į 'mirties namai' palieka metaforą, bet atitinka senovės kalbos stilių.",
      "confidence": 0.99
    },
    {
      "file": "07_tylos_puota.qmd",
      "type": "anachronism",
      "original": "Vilnius nebebuvo žmonių miestas; jis tapo idėjų, pasirašytų krauju, lauku.",
      "fixed": "Vilnius nebebuvo žmonių miestas; jis tapo kraujo ir sielų lauku.",
      "explanation": "'Idėjų, pasirašytų krauju' yra anachronizmas – XIV a. būtų naudojama metafora kaip 'kraujo ir sielų laukas' (pvz., 'kraujo žemė', 'sielų žemė'). 'Idėjų' terminas yra vėlesnis, susijęs su renesansu ir humanizmu. 'Lauku' yra teisinga, bet 'pasirašytų krauju' yra neegzistuojantis XIV a. žodžių junginys.",
      "confidence": 0.99
    },
    {
      "file": "07_tylos_puota.qmd",
      "type": "anachronism|grammar",
      "original": "Skirgaila stebėjo tai be jokios emocijos, savo užrašų knygelėje žymėdamas kiekvieną sėkmingą susitvarkymą kaip paprastą administracinę užduotį.",
      "fixed": "Skirgaila stebėjo tai be jokių jausmų, užrašydamas savo knygelėje kiekvieną sėkmingą veiklą kaip paprastą darbą.",
      "explanation": "         - 'Administracinė užduotis' pakeista į 'darbą' (XIV a. tekstuose neegzistuojantis terminas 'administracinė').         - 'Užrašų knygelė' pakeista į 'knygelė' (tiesesnis žodis).         - 'Susitvarkymas' pakeistas į 'veiklą' (tiesesnis kontekstas).       ",
      "confidence": 0.98
    },
    {
      "file": "07_tylos_puota.qmd",
      "type": "anachronism",
      "original": "kiekviena pralieta kraujo auka buvo tarsi „sumokėta moneta“ į Auksinio Smauglio skrynią.",
      "fixed": "kiekviena pralieta kraujo auka buvo tarsi įdėta į Auksinio Smauglio skrynią.",
      "explanation": "'Auksinio Smauglio' yra anachronizmas – tai yra žinomas iš vėlesnių legendų (pvz., 'Hobbit' bei Tolkieno mitologijos), o XIV a. lietuvių tekstuose būtų naudojami tradiciniai žodžiai kaip 'Auksinis Amulelis' arba 'Auksinė Skrynia' (jei reikėtų pabrėžti vertybę). 'Sumokėta moneta' yra tiesioginis anglų kalbos vertimas ('paid in blood'), o XIV a. būtų naudojama metafora kaip 'kraujo atlygis' ar 'kraujo mokestis'.",
      "confidence": 0.98
    },
    {
      "file": "07_tylos_puota.qmd",
      "type": "grammar|style",
      "original": "Jis nesiųsdavo karių į atvirą, garbingą mūšį. Ne, jis siuntė specialiai paruoštus žudikus į kareivines, kur poilsio po ilgos kelionės atgulė Kęstučio lojalistai.",
      "fixed": "Jis neleido kariams eiti į atvirą mūšį. Ne, jis siuntė žudikus į kareivines, kur poilsio po ilgos kelionės atgulę Kęstučio sekėtojai.",
      "explanation": "         - 'Nesiųsdavo' pakeista į 'neleido' (tiesesnis XIV a. stilus).         - 'Garbingą mūšį' pakeista į 'atvirą mūšį' (tiesesnis kontekstas).         - 'Lojalistai' pakeista į 'sekėtojai' (tiesesnis XIV a. terminas).         - 'Žudikus' išlaikomas, bet sintaksė pakeista, kad būtų tiksliau.       ",
      "confidence": 0.97
    },
    {
      "file": "07_tylos_puota.qmd",
      "type": "style",
      "original": "Jogaila galiausiai pradėjo kalbėtis su neegzistuojančiais svečiais, kilnodamas taurę už „naująją, didingą Lietuvą“, kol jo balsas galutinai nuskendo vienuolio giesmėje.",
      "fixed": "Jogaila galiausiai pakilo ir kilnodamas taurę už 'Lietuvą', kol jo balsas nuskendo vienuolio giesmėje.",
      "explanation": "'Naująją, didingą Lietuvą' yra pertekintas ir anachronizmas – XIV a. tekstas būtų naudojęs trumpesnį, nešvaresnį pavadinimą ('Lietuvą' ar 'Lietuvos žemę'). 'Neegzistuojančiais svečiais' yra pertekintas epitetas, nes XIV a. būtų naudojama metafora kaip 'fantasmagorinės figūros' arba 'sielos vaizdai'. 'Kilnodamas taurę' yra teisinga, bet 'naująją, didingą' yra pertekintas.",
      "confidence": 0.97
    },
    {
      "file": "07_tylos_puota.qmd",
      "type": "anachronism|grammar|style",
      "original": "Jogaila sėdėjo didžiojoje menėje prie stalo, kuris buvo nuklotas geriausiais įmanomais patiekalais. Kepti šernai, įdaryti miško uogomis, marinuoti lydekos iš giliausių ežerų, brangiausias vynas, atvežtas iš tolimų vakarų kraštų — viskas buvo čia, spindėjo po šimtų vaškinių žvakių šviesa.",
      "fixed": "Jogaila sėdėjo didžiojoje menėje prie stalo, kuris buvo nuklotas geriausiais patiekalais. Kepti šernai, įdaryti miško uogomis, lydekos iš giliausių ežerų, vynas iš tolimų kraštų — viskas buvo čia, šviesą leido šimtų vaškinių žvakių šviesa.",
      "explanation": "         - Ištrintas 'įmanomais' (per modernus būdvardis).         - 'Marinuoti' pakeistas į 'lydekos' (XIV a. tekstuose naudojamas tiesesnis 'lydekos' – neegzistuojantis terminas 'marinuoti').         - 'Brangiausias vynas' pakeistas į 'vynas' (per daug būdvardžių).         - 'Šviesa' išlaikoma, bet pakeistas sintaksė, kad būtų tiksliau XIV a. stiliumi (ne 'spindėjo po').       ",
      "confidence": 0.95
    },
    {
      "file": "08_krevos_pozemiai.qmd",
      "type": "grammar",
      "original": "Kęstutis sėdėjo savo kameroje, kuri jam, pratusiam prie begalinių horizontų, atrodė mažesnė už vilko guolį.",
      "fixed": "Kęstutis sėdėjo savo patalpoje, kuri jam, pratusiam laukinėms žemėms, atrodė mažesnė už vilko guolį.",
      "explanation": "       **Grammatika/Anachronizmas**:       - 'Kamero' XIV a. lietuviškas tekstas neįvardintų (neegzistuojantis žodis). Pakeičiamas į 'patalpa' (paprastesnis ir tinkamesnis).       - 'Begalinių horizontų' – neegzistuojantis žodis. Pakeičiamas į 'laukinės žemės' (paprastesnis ir tinkamesnis XIV a. kontekstui).       ",
      "confidence": 0.99
    },
    {
      "file": "08_krevos_pozemiai.qmd",
      "type": "anachronism",
      "original": "Vytautas buvo užrakintas kitoje sienos pusėje, visiškai atskirtas nuo tėvo. Jie negalėjo vienas kito matyti, bet jų balsai — prislopinti, iškraipyti akmens aido ir drėgmės — karts nuo karto pasiekdavo vienas kitą per ventiliacijos angas ir siaurus plyšius tarp grubiai aptašytų blokų.",
      "fixed": "Vytautas buvo uždarytas kitoje patalpoje, atskirtas nuo tėvo. Jie negalėjo vienas kito matyti, bet jų balsai, prislopinti akmens ir drėgmės, karts nuo karto pasiekdavo vienas kitą per plyšius tarp akmenų.",
      "explanation": "       **Anachronizmai**:       - 'Ventiliacijos angos' – neegzistuojantis XIV a. terminas. Pakeičiamas į 'plyšius tarp akmenų'.       - 'Aptašyti blokai' – neegzistuojantis žodis. Pakeičiamas į 'akmenys'.       - 'Iškraipyti akmens aidas' – neegzistuojantis žodis. Pakeičiamas į 'prislopinti akmens ir drėgmės'.       ",
      "confidence": 0.99
    },
    {
      "file": "08_krevos_pozemiai.qmd",
      "type": "anachronism|style",
      "original": "Šioje kameroje tos istorijos buvo vienintelė jo apsauga nuo slegiančios, viską ryjančios pilkumos.",
      "fixed": "Šiame žemės mūro patalpoje jo istorijos buvo vienintelė apsauga nuo slegiančios pilkumos, kuri viską užlieja.",
      "explanation": "       - **Anachronizmas**: 'kamera' (modernus žodis) pakeistas į 'žemės mūro patalpa' (XIV a. pilies konstrukcija).       - **Stilius**: 'viską ryjančios pilkumos' per metaforiškas, pakeistas į 'kuris viską užlieja' (panašesnis į senovės lietuvių kalbos poeziją).       ",
      "confidence": 0.99
    },
    {
      "file": "08_krevos_pozemiai.qmd",
      "type": "anachronism",
      "original": "Jos sienos buvo neįtikėtinai storos, išmūrytos iš didžiulių, pilkų ir šaltų akmenų, kurie, atrodo, siurbė bet kokią šviesą ir viltį iš bet ko, kas išdrįsdavo įžengti į jos vidų.",
      "fixed": "Sienos buvo labai storos, išmūrytos iš didelių akmenų, kurie neleido šviesai ir vilties į pilį.",
      "explanation": "       **Anachronizmas**: 'neįtikėtinai' ir 'siurbė' yra per modernūs žodžiai. XIV a. tekstas turėtų būti praktiškesnis, be retorinių būdvardžių. 'Siurbė' yra anglizmo paveiktas žodis ('absorb'). Pakeičiamas į 'neleido šviesai' – paprastesnis ir tinkamesnis XIV a. kontekstui.       ",
      "confidence": 0.98
    },
    {
      "file": "08_krevos_pozemiai.qmd",
      "type": "style",
      "original": "Vytis šioje tamsoje ne blėso, o priešingai — darėsi vis aštresnis, ryškesnis ir pavojingesnis. Visos jo iliuzijos apie giminės šventumą dingo tą pačią akimirką, kai už jų nugarų nukrito Vilniaus grotas. Dabar jame gyveno tik vienas, visa apimantis jausmas — šaltas, apskaičiuotas ir negailestingas keršto noras.",
      "fixed": "Vytis šioje tamsoje neprarado jėgų, o tapo aštresnis. Jo nuomonės apie giminės garbę dingo, kai Vilniaus pilis nukrito. Dabar jame vyravo vienas jausmas — keršto troškimas.",
      "explanation": "       **Stilius**:       - Ištrintas per daug būdvardžių ('aštresnis', 'ryškesnis', 'pavojingesnis', 'apskaičiuotas', 'negailestingas').       - 'Iliuzijos' – neegzistuojantis XIV a. žodis. Pakeičiamas į 'nuomonės'.       - 'Nukrito Vilniaus grotas' – neegzistuojantis žodis. Pakeičiamas į 'nukrito Vilniaus pilis'.       - 'Visa apimantis jausmas' – per retorinis. Pakeičiamas į 'vyravo vienas jausmas'.       ",
      "confidence": 0.98
    },
    {
      "file": "08_krevos_pozemiai.qmd",
      "type": "anachronism|style",
      "original": "Kęstučio pasakojimai po požemio skliautais skambėjo ne kaip prisiminimai apie praeitį, o kaip galutinis ir skausmingas atsisveikinimas. Jis kalbėjo apie savo jaunystės žygius, apie dainas prie laužų po žvaigždėtu dangumi, apie laiką, kai Lietuva buvo vientisa pagoniška ašis, kuriai nereikėjo jokių svetimų dievų ar auksinių karūnų.",
      "fixed": "Kęstutis pasakojo po žemės skliautų, ir jo žodžiai nebuvo kaip senovės prisiminimai, o kaip paskutinis, skausmingas atsisveikinimas su gyvenimu. Jis kalbėjo apie jaunystės žygius, apie dainas prie ugnies, kai dangus buvo žvaigždėtas, ir apie laiką, kai Lietuva buvo vieninga, nes turėjo savo dievus, o ne svetimus karalių karūnas.",
      "explanation": "       - **Anachronizmas**: 'laužai' (modernus žodis) pakeistas į 'ugnies' (senovės lietuvių kalbos terminas už kampų).       - **Stilius**: 'galutinis ir skausmingas atsisveikinimas' per modernu, pakeistas į 'paskutinis, skausmingas atsisveikinimas su gyvenimu' (panašesnis į XIV a. kalbą).       - **Terminai**: 'pagoniška ašis' ir 'auksinės karūnų' pakeisti į 'savo dievus' ir 'karalių karūnas' (senovės lietuvių kalbos kontekste karūnos buvo simbolis valdžios, o ne dievų).       ",
      "confidence": 0.98
    },
    {
      "file": "08_krevos_pozemiai.qmd",
      "type": "style",
      "original": "Jie tiesiog laukė, ir kiekvienas lašas, nusiritantis nuo skliautų, garsiai pranešė, kad jų laikas po šia saule pamažu, bet visiškai nepermaldaujamai baigiasi. Miškas už sienų ošė, šaukdamas savo kunigaikščius, bet gilaus požemio tamsa jokių atsakymų nedavė.",
      "fixed": "Jie tik laukė. Kiekvienas lašas, nusiritęs nuo skliautų, pranešė, kad jų laikas šioje saule baigiasi. Miškas už sienų ošė, šaukdamas savo kunigaikščius, bet tamsa nieko neatsakė.",
      "explanation": "       - **Stilius**: 'garsiai pranešė' per modernu, pakeista į 'pranešė' (senovės lietuvių kalboje pranešimai buvo paprastesni).       - **Stilius**: 'pamažu, bet visiškai nepermaldaujamai' per perteklinis, pakeista į 'baigiasi' (senovės lietuvių kalboje laikui baigti buvo sakoma tiesiogiai).       - **Stilius**: 'ošė, šaukdamas' per metaforiškas, pakeista į 'ošė' (senovės lietuvių kalboje šaukimas buvo paprastesnis).       ",
      "confidence": 0.98
    },
    {
      "file": "08_krevos_pozemiai.qmd",
      "type": "anachronism|grammar",
      "original": "Vytautas dažniausiai nieko neatsakydavo. Jis tiesiog sėdėdavo tamsoje, pakišęs ranką į gilią savo apsiausto kišenę, kur rado mažą gintaro gabalėlį — motinos Birutės atsisveikinimo dovaną. Tamsoje gintaras skleidė vos matomą, neįtikėtinai šiltą šviesą, tarsi jame būtų amžiams uždarytas paskutinis Trakų saulėlydis.",
      "fixed": "Vytautas dažniausiai nieko neatsakydavo. Jis tik sėdėjo tamsoje, įsikišęs ranką į savo drabužių kišenę ir išsitraukęs mažą akmenuką — motinos Birutės paskutinio atsisveikinimo dovaną. Tamsoje akmenukas skleidė vos matomą šviesą, tarsi jame būtų uždaryta paskutinė Trakų saulė.",
      "explanation": "       - **Anachronizmas**: 'gintaras' (XIV a. lietuvių kalboje nebuvo tokio terminų, o akmenys buvo žinomi kaip 'akmenukai' arba 'gintaras' buvo retas ir vertingas, bet ne kaip dovanos simbolis). Pakeistas į 'akmenuką'.       - **Anachronizmas**: 'apsiaustas' (modernus žodis) pakeistas į 'drabužiai' (XIV a. lietuvių kalboje).       - **Grammatika**: 'neįtikėtinai šiltą šviesą' per modernu, pakeista į 'šviesą' (senovės lietuvių kalboje pojūčiai buvo apibūdinami paprastai).       - **Anachronizmas**: 'saulėlydis' kaip poezija pakeistas į 'saulė' (senovės lietuvių kalboje saulė buvo dievybė, o ne metafora).       ",
      "confidence": 0.97
    },
    {
      "file": "08_krevos_pozemiai.qmd",
      "type": "anachronism|style",
      "original": "Krėva buvo vieta, kur baigėsi visi keliai ir visos svajonės. Čia kvepėjo senu ledu, drėgnu akmeniu ir lėtai pūvančiais šiaudais. Laikas čia ištįso, virsdamas į nesibaigiančią pilką masę, kurioje mirtis atrodė ne kaip pabaiga, o kaip vienintelis įmanomas išsivadavimas iš šio akmeninio narvo.",
      "fixed": "Krėva buvo vieta, kur baigėsi visi keliai ir visos svajonės. Čia kvepėjo senas ledas, drėgnas akmuo ir šiaudai. Laikas čia sustojo, virsdamas į pilką, nesibaigiančią tamsą, kur mirtis atrodė ne kaip pabaiga, o kaip vienintelis išsivadavimas iš šio akmeninio narvo.",
      "explanation": "       - **Anachronizmas**: 'svajonės' (modernus žodis) pakeistas į 'svajonės' (senovės lietuvių kalboje buvo žinomi 'sapnai' ar 'galvos vaizdai').       - **Stilius**: 'nesibaigiančią pilką masę' per metaforiškas, pakeista į 'pilką, nesibaigiančią tamsą' (panašesnis į XIV a. kalbą).       - **Stilius**: 'išsivadavimas iš šio akmeninio narvo' per modernu, pakeista į 'išsivadavimas iš šio narvo' (senovės lietuvių kalboje narvas buvo žinomi kaip 'kaliniai' ar 'kalėjimas').       ",
      "confidence": 0.95
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "anachronism|grammar",
      "original": "Tai nebuvo lietuviai; jų veidai, apšviesti vienišo deglo, išdavė slaviškus bruožus. Samdiniai iš Rusios žemių. Žmonės be sielos, be tėvynės ir be vardų — tik aštrios rankos ir šalti, sistemingi judesiai.",
      "fixed": "Tai nebuvo lietuviai; jų veidai, apšviesti vieno deglo, rodė slaviškus bruožus. Rusios žmonės, samdiniai. Žmonės be sielos, be tėvynės ir be vardų — tik aštrios rankos ir šalti judesiai.",
      "explanation": "Anachronizmas: 'sistemingi' - XIV a. nebuvo žinomas šis terminas. 'Deglo' - galima pakeisti į 'deglo' (nebe 'vienišo deglo', nes tai perteklių). 'Išdavė' - galima pakeisti į 'rodė', nes 'išdavė' yra anachronizmas. 'Rusios žemių' - galima pakeisti į 'Rusios žmonės', nes 'žemės' yra perteklių. 'Bevardžiai' - galima pakeisti į 'bevardžiai' (jei reikia), bet kontekste 'bevardai' yra tinkamesnis.",
      "confidence": 0.99
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "grammar|style",
      "original": "— Specialus užsakymas iš pačios Krokuvos, — sušnibždėjo samdinys, vynioti grandinę aplink Kęstučio kaklą. — Ponai lenkai nori, kad viskas būtų... tinkama jūsų rangui. Aristokratiškas galas.",
      "fixed": "— Šis užsakymas iš Krokuvos, — pasakė samdinys, pritaikydamas grandinę Kęstučio kaklui. — Lenkai norėjo, kad ji būtų tinkama jūsų garbei. Tai aukso grandinė.",
      "explanation": "       1. **Gramatika**: 'vynioti' - neegzistuojantis XIV a. žodis. Būtų naudotas 'pritaikydamas' arba 'sukabindamas'.       2. **Anachronizmas**: 'tinkama jūsų rangui' - 'tinkama' yra anglizmas. XIV a. būtų naudotas 'tinkama jūsų garbei'.       3. **Stilius**: 'aristokratiškas galas' - per modernus terminas. XIV a. būtų pateiktas konkretus faktas ('aukso grandinė').       4. 'Ponai lenkai' - per formalus. XIV a. būtų naudotas 'lenkai' (be 'ponai').       ",
      "confidence": 0.99
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "grammar|style",
      "original": "— Jis nuėjo savo keliu, Kęstuti. Dabar jis turi tik save patį, savo pyktį ir savo išmintį. Ir tai jam padės kur kas labiau nei tavo garbingi prisiminimai. Gamta pati pasirūpins savo vilku.",
      "fixed": "— Jis eina savo keliu, Kęstuti. Dabar jis turi tik save, savo pyktį ir išmintį. Tai jam labiau už tavo garbę. Miškas pats pasirūpins savo vilku.",
      "explanation": "       1. **Gramatika**: 'savo keliu' - neteisingas linksnis. XIV a. būtų naudotas 'savo keliu' (be 'nuėjo' - būtų 'eina' ar 'einą').       2. **Stilius**: 'kur kas labiau' - per modernus ir neegzistuojantis XIV a. tekstuose. Būtų naudotas 'labiau už'.       3. 'Garbė' - XIV a. būtų pateiktas konkretesnis apibūdinimas ('garbę' už 'garbingi prisiminimai').       4. 'Gamta pati pasirūpins' - per modernus ir abstraktus. XIV a. būtų naudotas 'Miškas pats pasirūpins'.       ",
      "confidence": 0.99
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "style|grammar",
      "original": "Ryte Vytautas išgirdo žinią per ventiliacijos angą.",
      "fixed": "Ryte Vytautas išgirdo žinią per angą.",
      "explanation": "       'Ventiliacijos' yra anachronizmas – XIV a. lietuvių nebuvo šio terminų. Pakeitę į 'per angą' (senovės lietuvių kalbos terminas). Gramatika taip pat patikrinta – 'angą' yra teisingas linksnis (vienaskaita, įnaginis).       ",
      "confidence": 0.99
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "anachronism",
      "original": "— Skirgaila ir Jogaila siunčia jums savo... paskutinius sveikinimus, — tarė vyriausiasis iš jų. Jo lietuvių kalba buvo baisi, iškraipyta stipraus akcento, bet prasmė buvo aiškesnė už dieną.",
      "fixed": "— Skirgaila ir Jogaila siunčia jums savo... paskutinius žodžius, — tarė vyriausiasis iš jų. Jo lietuvių kalba buvo iškraipyta stipraus akcento, bet prasmė buvo aiškesnė už dieną.",
      "explanation": "Anachronizmas: 'sveikinimus' - XIV a. nebuvo žinomas šis terminas. 'Baisi' - perteklių būdvardis. 'Aiškesnė už dieną' - neteisingas lyginimas (diena - neegzistuojantis kontekstas).",
      "confidence": 0.98
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "anachronism|style",
      "original": "Tai nebuvo paprasta grandinė. Ji buvo sunki, nušlifuota ir baugiai blizganti deglo šviesoje. Auksinė grandinė. To paties auksas, kuris kvepėjo Jogailos pasiuntinių dovanomis.",
      "fixed": "Tai ne paprasta grandinė. Ji buvo sunkia, išmesta ir šviesiai blizganti ugnies šviesoje. Ta pati auksinė grandinė, kurią Jogailos pasiuntiniai nešė kaip dovaną.",
      "explanation": "       1. **Anachronizmas**: 'deglo šviesoje' - XIV a. būtų naudotas 'ugnies šviesoje' (ne 'deglo').       2. **Stilius**: 'baugiai blizganti' ir 'kvepėjo' yra per daug emociniai būdvardžiai. XIV a. tekstai būtų naudoję konkretesnius apibūdinimus ('išmesta' už 'nušlifuota').       3. 'Kvepėjo Jogailos pasiuntinių dovanomis' - per modernus ir metaforiškas. XIV a. būtų pateiktas konkretus faktas ('nešė kaip dovaną').       ",
      "confidence": 0.98
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "style|anachronism",
      "original": "Paskutinė mintis, kuri nušvito Kęstučio galvoje prieš jam užgesant, nebuvo apie skausmą ar baisulį. Tai buvo tas pats senas sapnas apie Ąžuolą. Paskutinį kartą jis pamatė tą didžiulį medį, krintantį tyloje vienišame lauke. Ir jis pagaliau suprato — medis krito ne dėl vėjo ar laiko. Jis krito, nes protėvių dievai nusprendė, kad jo šaknims nebėra vietos šitoje naujoje, auksinių grandinių Lietuvoje.",
      "fixed": "Paskutinė mintis, kuri atsimušė Kęstučio galvoje, buvo apie sapną. Jis pamatė didelį ąžuolą, krintantį viename lauke. Medis krinta, nes dievai nusprendė, kad jo šaknims nėra vietos šioje naujoje žemėje.",
      "explanation": "       1. **Stilius**: 'nušvito' ir 'pagaliau suprato' - per modernūs ir emociniai. XIV a. būtų naudotas tiesioginis aprašymas ('atsimušė').       2. **Anachronizmas**: 'aukso grandinių Lietuvoje' - per modernus ir metaforiškas. XIV a. būtų pateiktas konkretus faktas ('šioje naujoje žemėje').       3. 'Protėvių dievai' - per modernus ir abstraktus. XIV a. būtų naudotas 'dievai' (be 'protėvių').       4. 'Naujoje, auksinių grandinių Lietuvoje' - per daug metaforiškas. XIV a. būtų naudotas tiesioginis apibūdinimas ('naujoje žemėje').       ",
      "confidence": 0.98
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "anachronism",
      "original": "Jis sėdėjo savo kameroje visiškai nejudėdamas, žiūrėdamas į tą pačią pilką akmens sieną valandų valandas.",
      "fixed": "Jis sėdėjo savo patalpoje, nejudėdamas, žiūrėdamas į pilką akmenų sieną, kol akys prasiveržė.",
      "explanation": "       'Kamera' yra anachronizmas – XIV a. lietuvių nebuvo šio žodžio. Pakeitę į 'patalpa' (senovės lietuvių kalbos terminas). 'Valandų valandas' pakeitę į 'kol akys prasiveržė' – tai būdingesnis senovės tekstų stilius, nes laikrodžiai nebuvo paplitę. 'Pilką akmens sieną' pakeitę į 'pilką akmenų sieną' (gramatika: 'akmens' -> 'akmenų', nes akmenys yra daugiskaitos daiktai).       ",
      "confidence": 0.98
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "anachronism|style",
      "original": "Jie buvo čia ne kovoti, o atlikti darbą, už kurį sumokėta auksiniu pažadu.",
      "fixed": "Jie buvo čia ne kovoti, o atlikti užsakytą darbą, už kurį sumokėta auksu.",
      "explanation": "Anachronizmas: 'pažadus' - XIV a. žodis 'pažadas' buvo žinomas, bet 'auksinis pažadas' yra perteklių metafora. 'Darbą' - galima pakeisti į 'užsakytą darbą', nes XIV a. žodis 'darbas' buvo žinomas, bet 'pažadas' buvo reikšmingesnis kontekste. 'Auksiniu' - galima pakeisti į 'auksu', nes 'auksinis' yra anachronizmas.",
      "confidence": 0.97
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "style|anachronism",
      "original": "Ji ištiesė jam savo švelnią, dervos kvapą nešančią ranką.",
      "fixed": "Ji ištiesė jam savo ranką, kuri kvapo dervės.",
      "explanation": "       1. **Stilius**: 'švelnią' ir 'dervos kvapą nešančią' yra per daug metaforiški ir emociniai. XIV a. tekstai būtų naudoję konkretesnius apibūdinimus.       2. **Anachronizmas**: 'dervos kvapą nešančią' - per modernus ir poetinis. XIV a. būtų pateiktas tiesioginis aprašymas ('kvapo dervės').       ",
      "confidence": 0.97
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "style",
      "original": "Viskas, kas dar siejo jį su Kęstučio garbe, dingo kartu su tėvo paskutiniu kvėpavimu. Liko tik ledinis šaltis, pagoniškas pyktis ir vienas vienintelis, aštrus poreikis — kerštas.",
      "fixed": "Viskas, kas siejo jį su Kęstučio garbe, dingo kartu su tėvo paskutiniu kvėpavimu. Liko tik šaltis ir pagoniškas pyktis, kuris užgulė kaip sniegas.",
      "explanation": "       'Ledinis šaltis' ir 'aštrus poreikis — kerštas' yra per daug metaforiški ir neįprasti XIV a. tekstuose. Pakeitę į 'šaltis' (nes 'ledinis' yra per daug modernus) ir 'kuris užgulė kaip sniegas' (metafora, kuri būtų suprantama senovės lietuvių). 'Vienas vienintelis' pakeitę į 'vienas' (perteklių).       ",
      "confidence": 0.97
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "anachronism|style",
      "original": "— Jie ateis vėliau, kunigaikšti. Pažiūrėti į tai, kas iš jūsų liks. O dabar — laikas mokėti skolą.",
      "fixed": "— Jie ateis vėliau, kunigaikščiui. Pažiūrėti, kas iš jūsų liks. Dabar laikas mokėti skolą.",
      "explanation": "Anachronizmas: 'kunigaikšti' - XIV a. galima panaudoti 'kunigaikščiui' (vardininkas). 'Laikas mokėti skolą' - galima pakeisti į 'dabar laikas mokėti skolą', nes 'laikas' yra perteklių. 'Pažiūrėti į tai' - galima pakeisti į 'pažiūrėti, kas liks', nes 'pažiūrėti į tai' yra perteklių.",
      "confidence": 0.96
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "anachronism",
      "original": "Tai nebebuvo ta rami tyla, kurią jis mylėjo savo miškuose po medžioklės; tai buvo slegianti, spengianti ir laukianti nebuvimas garsų, primenantis Tylos Puotą Vilniaus pilyje.",
      "fixed": "Tai nebebuvo ta tyla, kurią jis mylėjo miškuose po medžioklės; tai buvo slegianti, laukianti tyla, primenanti Tylos Puotą Vilniaus pilyje.",
      "explanation": "Anachronizmas: 'nebuvimas garsų' - neteisingas XIV a. terminas. 'Tylos Puota' - neegzistuojantis XIV a. terminas (neišlikęs šaltiniuose). 'Spengianti' - perteklių būdvardis. 'Medžioklė' - galima pakeisti į 'medžioklės žygis' arba ištrinti, nes XIV a. žodis 'medžioklė' buvo žinomas, bet kontekste galima paprastinti.",
      "confidence": 0.95
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "type": "style|anachronism",
      "original": "Tai nebebuvo saulėlydžio šviesa; tai buvo deganti ugnis, kuri neleido jam sustingti.",
      "fixed": "Tai nebebuvo saulės šviesa; tai buvo akmens šviesa, kuri neleido jam sustingti.",
      "explanation": "       'Saulėlydis' yra anachronizmas – XIV a. lietuvių nebuvo šio terminų. 'Deganti ugnis' yra per daug metaforiška ir neįprasta senovės tekstuose. Pakeitę į 'akmens šviesa' – tai būdingesnis senovės tekstų stilius, nes akmenys buvo svarbūs simboliai. 'Neleido sustingti' pakeitę į 'neleido sustingti' (nekeičiant, nes tai yra priimtina metafora, bet 'deganti ugnis' buvo per silpna).       ",
      "confidence": 0.95
    },
    {
      "file": "10_saltas_rytas.qmd",
      "type": "anachronism",
      "original": "Kiekvienas sargybinio žingsnis koridoriuje, kiekviena krentanti vandens lašo tyla dabar buvo tik sudėtingos šachmatų partijos figūros.",
      "fixed": "Kiekvienas sargybinio žingsnis koridoriuje, kiekviena krentanti vandens lašo tyla dabar buvo kaip paslėptos žaibų žvaigždės, kurios žymėjo kelį.",
      "explanation": "Žodis 'šachmatų partija' yra anachronizmas. XIV a. tekstas naudotų metaforą su 'žaibų žvaigždėmis' arba 'paslėptomis žymėmis'. Pakeičiau į tradicinę, retorinės vertės metaforą.",
      "confidence": 0.99
    },
    {
      "file": "10_saltas_rytas.qmd",
      "type": "style",
      "original": "Grįžęs į savo drėgną kamerą, Vytautas priėjo prie mažo, apsamanojusio metalinio indo su pilkšvu vandeniu.",
      "fixed": "Grįžęs į savo drėgną patalį, Vytautas priėjo prie mažo metalinio indelio, kuris buvo užpilęs pilkšvu vandeniu.",
      "explanation": "Žodis 'kamera' yra anachronizmas (XIV a. būtų 'patalys' ar 'kambarys'). 'Apsamanojusio' yra pertekliuotas būdvardis. 'Indas' pakeičiau į 'indelis', kad būtų tradicinė forma.",
      "confidence": 0.98
    },
    {
      "file": "10_saltas_rytas.qmd",
      "type": "anachronism",
      "original": "Jis turėjo tapti niekuo, šešėliu tarp šešėlių, kad galėtų rasti plyšį savo narve ir ištrūkti į laisvę.",
      "fixed": "Jis turėjo tapti nepažįstamu, bevardžiu, kad galėtų prasiveržti per sienas ir ištrūkti į laisvę.",
      "explanation": "Žodis 'narve' ir 'ištrūkti' yra anachronizmai. XIV a. tekstas naudotų 'prasiveržti per sienas'. 'Šešėlis tarp šešėlių' pakeičiau į 'nepažįstamu, bevardžiu', kad būtų tradicinė metafora.",
      "confidence": 0.97
    },
    {
      "file": "10_saltas_rytas.qmd",
      "type": "grammar",
      "original": "Jis pamatė savo atvaizdą — purviną, suvargusį, vis dar turintį dėdės bruožų, kurių dabar negalėjo pakęsti.",
      "fixed": "Jis atvaizdą atpažino — purviną, suvargusį, kurio veidas dar nešė dėdės bruožų, kuriuos dabar negalėjo pakęsti.",
      "explanation": "Netikslus linksnis ('bruožų' turi būti 'bruožus' arba 'bruožų', bet 'kuriuos' yra teisingas, tačiau 'atvaizdą atpažino' yra tiksliau. 'Turintį' pakeičiau į 'nešė', kad būtų natūralesnis XIV a. stilus.",
      "confidence": 0.95
    },
    {
      "file": "10_saltas_rytas.qmd",
      "type": "style",
      "original": "Saulė galutinai pasislėpė po debesimis, užleisdama vietą pilkai, bet lemtingai dienai.",
      "fixed": "Saulė pasislėpė už debesų, palikdama tamsą.",
      "explanation": "       XIV a. tekstai būtų rašyti labiau konkretiškai ir be pernelyg emocinės raiškos. Žodis 'lemtingai' yra pernelyg modernus ir emocinis. 'Pilkai dienai' yra pernelyg poetinis ir neegzistuotų to meto tekstuose. 'Galutinai' taip pat yra pernelyg modernus žodis. Pakeitimas į 'pasislėpė už debesų, palikdama tamsą' yra tikresnis XIV a. stilui ir nepertekliavo žodžių.       ",
      "confidence": 0.95
    },
    {
      "file": "10_saltas_rytas.qmd",
      "type": "style",
      "original": "a, kuri po savęs nepaliks nieko senojo.",
      "fixed": "a, kuri po savęs nieko nepaliks.",
      "explanation": "       XIV a. tekstai būtų rašyti labiau konkretiškai ir be pernelyg emocinės raiškos. Žodis 'senojo' yra pernelyg modernus ir neegzistuotų to meto tekstuose. Pakeitimas į 'nieko nepaliks' yra tikresnis XIV a. stilui ir labiau konkretus.       ",
      "confidence": 0.95
    },
    {
      "file": "11_nasle.qmd",
      "type": "anachronism|grammar",
      "original": "Ji buvo našlė ne pagal žmogiškąjį išdavystės ir auksinių grandinių įstatymą, o pagal kur kas galingesnę, nepermaldaujamą dievų valią.",
      "fixed": "Ji buvo našlė ne pagal žmogiškus įstatymus, o pagal dievų valią.",
      "explanation": "       - 'Žmogiškąjį išdavystės ir auksinių grandinių įstatymą' pakeičiamas į 'žmogiškus įstatymus', nes XIV a. lietuvių kalboje nebuvo terminų 'išdavystės įstatymas' ar 'auksinių grandinių įstatymas'.       - 'Kur kas galingesnę, nepermaldaujamą dievų valią' pakeičiamas į 'dievų valią', nes XIV a. lietuvių kalboje nebuvo tokių būdvardžių kaip 'galingesnė' ar 'nepermaldaujama'.",
      "confidence": 0.99
    },
    {
      "file": "11_nasle.qmd",
      "type": "anachronism|grammar",
      "original": "Tik ketvirtąjį kartą Birutė suprato — tai nebuvo atsitiktinumas, o negailestingas dievų ženklas. Jos ryšys su Kestučiu kaip dvasiniu vedliu nebuvo baigtas; jis tiesiog pakeitė savo materialią formą.",
      "fixed": "Ketvirtą kartą Birutė suprato: tai ne atsitiktinumas, o dievų žodis. Jos ryšys su Kestučiu kaip dvasinis vedlys nebuvo nutrauktas – jis tik pakeitė savo pavaizdą.",
      "explanation": "         - **Anachronizmas**: 'negailestingas dievų ženklas' – XIV a. būtų naudojama 'dievų žodis' (dievai kalbėdavo žodžiais, ne 'ženklais').         - **Gramatika**: 'dvasiniu vedliu' → 'dvasinis vedlys' (XIV a. lietuvių kalboje būtų naudojama tiesioginė forma be '-iu').         - **Stilius**: 'pakeitė savo materialią formą' → 'pakeitė savo pavaizdą' (metaforiškesnis ir senesnis žodynas).       ",
      "confidence": 0.99
    },
    {
      "file": "11_nasle.qmd",
      "type": "anglicism|style",
      "original": "Tai nebuvo malda kokiam nors silpnam, žmonių sugalvotam dievui; tai buvo įsakymas pačioms gamtos stichijoms, kurios ją girdėjo kaip savo dalį.",
      "fixed": "Tai nebuvo malda žmonių dievams; tai buvo įsakymas paties dievo jėgoms, kurios ją klausė kaip savo dalį.",
      "explanation": "         - **Anglicizmas**: 'stichijoms' – neegzistuojantis žodis (pakeistas į 'jėgoms').         - **Stilius**:           - 'silpnam, žmonių sugalvotam' – per daug būdvardžių ir per modernus ryšys.           - 'pačioms gamtos' → 'paties dievo' (XIV a. būtų naudojama tiesioginė dievo forma).       ",
      "confidence": 0.99
    },
    {
      "file": "11_nasle.qmd",
      "type": "anachronism",
      "original": "Birutė stovėjo prie Šventojo akmens — milžiniško, pilko ir samanoto riedulio, kurio paviršius buvo išraižytas senoviniais, laiko beveik nušlifuotais simboliais, saugančiais žinias apie pamirštus dievus.",
      "fixed": "Birutė stovėjo prie Šventojo akmens — milžiniško, pilko akmens, kurio paviršius buvo išraižytas senovinėmis žymėmis, saugančiais žinias apie senus dievus.",
      "explanation": "       - 'Samanoto' žodis XIV a. lietuvių kalboje neegzistavo (šis terminas yra modernus, reiškiantis 'apaugęs samanomis').       - 'Senoviniai, laiko beveik nušlifuotais simboliais' pakeičiamas į 'senovinėmis žymėmis', nes XIV a. lietuvių kalboje nebuvo terminų 'simboliai' ar 'nušlifuoti'.       - 'Pamirštus dievus' pakeičiamas į 'senus dievus', nes XIV a. lietuvių mitologijoje dievai buvo laikomi amžiniu, ne 'pamirštu' turiniu.",
      "confidence": 0.98
    },
    {
      "file": "11_nasle.qmd",
      "type": "anachronism|style",
      "original": "bet kaip savo dalią. Su giliu, plaučius plėšančiu atodūsiu, ji metė auksą gilyn į putojančias, juodas bangas.",
      "fixed": "bet kaip savo dalį. Su giliu, širdį sukrėtančiu atodūsiu, ji metė auksą į putojančias juodas bangas.",
      "explanation": "         - **Anachronizmas**: 'plaučius plėšančiu' – XIV a. būtų naudojama metaforė su 'širdimi' (plaučiai kaip organas nebuvo tokiu akivaizdžiai aprašomi).         - **Stilius**: 'giliu' – per daug būdvardžių. XIV a. būtų naudojama trumpesnė forma ('giliu atodūsiu').       ",
      "confidence": 0.98
    },
    {
      "file": "11_nasle.qmd",
      "type": "style|grammar",
      "original": "Ji nebebuvo našlė, kuriai reikėjo dvariškių užuojautos; ji tapo gamtos jėga, kurią kiekvienas protingas žmogus privalėjo gerbti labiau už bet kokį kariuomenės vadą.",
      "fixed": "Ji nebuvo našlė, kuriai reikėjo užuojautos; ji tapo gamtos jėga, kurią privalėjo gerbti visi, labiau už kariuomenės vadai.",
      "explanation": "         - **Stilius**:           - 'dvariškių užuojautos' → 'užuojautos' (XIV a. būtų naudojama tiesioginė forma).           - 'kiekvienas protingas žmogus' → 'visi' (senesnis ir trumpesnis ryšys).           - 'labiau už bet kokį kariuomenės vadą' → 'labiau už kariuomenės vadai' (per daug būdvardžių ir modernus ryšys).         - **Gramatika**: 'privalėjo gerbti labiau už' → 'privalėjo gerbti visi' (senesnis būdvardis 'visi').       ",
      "confidence": 0.98
    },
    {
      "file": "11_nasle.qmd",
      "type": "style|anachronism",
      "original": "Ji buvo našlė. Tačiau šis statusas Birutei nereiškė to paties, ką jis reiškė paprastoms moterims, kurios per laidotuves draskydavosi drabužius ir klykdavo iš sielvarto.",
      "fixed": "Ji buvo našlė. Tačiau šis statusas Birutei nebuvo kaip paprastoms moterims, kurios laidotuvėse draskydavo drabužius ir klykėdavo iš sielvarto.",
      "explanation": "       - 'Nereiškė to paties' pakeičiamas į 'nebuvo kaip', nes XIV a. lietuvių kalboje nebuvo tokių sintaksinių konstrukcijų.       - 'Sielvarto' pakeičiamas į 'klykėdavo' (nes 'sielvartas' yra XIV a. žodis, bet 'klykėti' yra paprastesnis ir tikresnis veiksmas).       - Perdėta metafora 'draskydavosi drabužius' pakeičiama į 'draskydavo drabužius' (nes XIV a. lietuvių kalboje nebuvo tokių būdvardžių kaip 'perdėta' ar 'pertekliniai žodžiai').",
      "confidence": 0.97
    },
    {
      "file": "11_nasle.qmd",
      "type": "anachronism|style",
      "original": "Ji tapo didesnio, amžino ir nepermaldaujamo kosminio ciklo dalimi. Ji užmerkė akis ir sąmoningai pasiuntė savo valią per nesibaigiančius vandenis ir vėjus toli į rytus, link tos tamsios ir drėgnos Krėvos pilies, kurioje mirė jos pasaulis.",
      "fixed": "Ji tapo amžinojo ciklo dalimi. Užmerkusi akis, ji pasiuntė savo valią per vandenis ir vėjus į rytus, kur tamsioje Krėvos pilies mirė jos pasaulis.",
      "explanation": "         - **Anachronizmai**:           - 'kosminis ciklas' → 'amžinojo ciklo' (XIV a. būtų naudojama 'amžinas' kaip būdvardis, o ne 'kosminis').           - 'nepermaldaujamas' – neegzistuojantis žodis (pakeistas į 'amžinas').           - 'sąmoningai' – per modernus žodis (pakeistas į tiesioginę veiksmo formą).         - **Stilius**:           - 'tamsios ir drėgnos' → 'tamsioje' (per daug būdvardžių).           - 'nesibaigiančius' → 'vandenis' (metaforiškesnis ir senesnis ryšys).       ",
      "confidence": 0.97
    },
    {
      "file": "12_gedulo_skraiste.qmd",
      "type": "anachronism|style",
      "original": "Ji buvo tobula aktorė, vaidinanti dūžtančią, bejėgę ir palūžusią moterį, nors giliai jos viduje dega toks šaltas, aštrus ir nepalenkiamas pyktis, kad jis savo jėga galėtų perkirsti patį kiečiausią Krėvos pilies granitą.",
      "fixed": "Ji atrodė dūžtančia, bejėgė moterimi, bet jos viduje degė pyktis, kuri galėtų sudeginti pilį.",
      "explanation": "         - 'Tobula aktorė', 'vaidinanti', 'dūžtančią, bejėgę ir palūžusią moterį', 'šaltas, aštrus ir nepalenkiamas pyktis', 'perkirsti patį kiečiausią granitą' yra per modernūs ir metaforiniai.         - 'Šaltas, aštrus ir nepalenkiamas' yra perteklių būdvardžių.         Ištaisyta: paprastesnis, be būdvardžių ir metaforų tekstas, kuris atitinka XIV a. stilistiką.",
      "confidence": 0.99
    },
    {
      "file": "12_gedulo_skraiste.qmd",
      "type": "anachronism|style",
      "original": "Krėvos pilis tądien atrodė ypač niūri, tarsi patys šimtamečiai akmenys būtų pasidengę juodu, tirštu sielvarto pelėsiu, neleidžiančiu giliau kvėpuoti. Dangus virš pilies buvo nepermatomai užtrauktas storais, purvinais pilkais debesimis, pro kuriuos neprasiskverbė nė vienas menkiausias saulės spindulys, suteikiantis bent krislą vilties.",
      "fixed": "Krėvos pilis tą dieną atrodė juoda, tarsi akmenys būtų uždengti juodu, stiprų sielvarto pelėsiu. Dangus virš pilies buvo uždengtas pilkais debesimis, kuriuos neprasiskverbė saulė.",
      "explanation": "         - 'Niūri' ir 'menkiausias' yra anachronizmai (XIV a. lietuvių kalboje būdvardžiai buvo retai naudojami, o 'niūri' yra XIX a. žodis).         - 'Sielvarto pelėsis' ir 'suteikiantis krislą vilties' yra per metaforiniai ir perteklių būdvardžių.         - 'Saulės spindulys' ir 'neleidžiančiu giliau kvėpuoti' yra per modernūs metaforiniai pasakojimai.         - 'Nepermatomai užtrauktas' ir 'purvinais pilkais' yra perteklių būdvardžių.         - 'Krislą vilties' yra neegzistuojantis XIV a. žodis.         Ištaisyta: paprastesnis, be metaforų ir būdvardžių tekstas, kuris atitinka XIV a. stilistiką.",
      "confidence": 0.98
    },
    {
      "file": "12_gedulo_skraiste.qmd",
      "type": "anachronism|style",
      "original": "Kiekvienas jos žingsnis ant šlapio grindinio buvo lėtas, sunkus, beveik varginantis, tarsi ji ant savo gležnų pečių neštų mirtiną visos Lietuvos pralaimėjimo naštą.",
      "fixed": "Jos žingsniai buvo lėti ir sunkūs, tarsi ji neštų smurtą.",
      "explanation": "         - 'Lėtas', 'sunkus', 'beveik varginantis', 'gležni pečiai', 'mirtiną visos Lietuvos pralaimėjimo naštą' yra perteklių būdvardžių ir metaforinių pasakojimų.         - 'Šlapio grindinio' ir 'mirtiną naštą' yra per modernūs žodžiai.         Ištaisyta: paprastesnis, be būdvardžių ir metaforų tekstas, kuris atitinka XIV a. stilistiką.",
      "confidence": 0.98
    },
    {
      "file": "12_gedulo_skraiste.qmd",
      "type": "anachronism|style",
      "original": "Jos akys buvo ištinusios, raudonos ir nuolat ašarojančios — tai buvo ne tik gryno, tikro sielvarto pasekmė, bet ir rezultatas kruopštaus darbo su svogūnų sultimis, kurias ji negailestingai įtrynė į jautrius vokus prieš pat išlipdama iš vežimo.",
      "fixed": "Jos akys buvo raudonos ir ašarojančios. Ji buvo pasidengusi juodais apdangalais, kad atrodytų skruzdėta.",
      "explanation": "         - 'Ištinusios', 'grynas sielvartas', 'kruopštus darbas su svogūnų sultimis', 'negailestingai įtrynė į jautrius vokus' yra per modernūs ir metaforiniai.         - 'Ašarojančios' yra perteklių būdvardis.         Ištaisyta: paprastesnis, be metaforų ir būdvardžių tekstas, kuris atitinka XIV a. stilistiką.",
      "confidence": 0.97
    },
    {
      "file": "12_gedulo_skraiste.qmd",
      "type": "grammar",
      "original": "kutinę pilies ramybę",
      "fixed": "kutinę pilies ramybę *arba* kūrinę pilies ramybę",
      "explanation": "       XIV a. lietuvių kalboje būtų naudojami tradiciniai linksniai. 'Ramybė' yra moteriškosios giminės žodis, todėl galininkas būtų 'ramybę', bet 'kutinę' yra neaiškus. Galima spekuliuoti, kad tai būtų 'kūrinę' (dalyvis 'kūrinčią' arba 'kūrinė') arba 'kūrinę' kaip 'kūrinčią' (dalyvis būtent 'kūrinčią' būtų tinkamesnis XIV a. tekstui). Tačiau be konteksto, tai yra sudėtinga aiškinti. Jei tekstas yra iš XIV a., būtų reikalingas pilnas kontekstas, kad tiksliai nustatyti linksnį.       ",
      "confidence": 0.7
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "anglicism|style",
      "original": "Tai buvo Eglė, ta pati paslaptinga būtybė, kurią jis trumpam matė prieš galutinai prarasdamas sąmonę. Ji stovėjo visiškai nejudėdama, bet Vytautas jautė jos dvasinį buvimą kiekviename savo įtemptame nerve.",
      "fixed": "Tai buvo Eglė, ta pati paslaptinga būtybė, kurią matė trumpam prieš praradęs sąmonę. Ji stovėjo nejudėdama, o Vytautas jautė jos dvasią kiekviename savo nervyje.",
      "explanation": "       - **Anglicizmas**: 'dvasinį buvimą' yra tiesioginis vertimas iš anglų kalbos ('spiritual presence'). XIV a. būtų naudojamas tiesesnis 'dvasią'.       - **Anachronizmas**: 'įtemptas nervas' yra per modernus terminas; 'nervas' būtų pakeistas į 'nervys' (senesnis žodis).       - **Stilius**: 'galutinai prarasdamas sąmonę' yra per daug retorinis; 'prarasdamas sąmonę' yra tiesesnis.       ",
      "confidence": 0.99
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "anachronism|grammar",
      "original": "Tik nendrės vis dar lengvai siūbavo ten, kur ji ką tik stovėjo, o tolimas, raminantis žalčio šlamėjimas žolėje priminė jam, kad nuo šios akimirkos jis niekada nebebus visiškai vienas šiame pasaulyje.",
      "fixed": "Nendrės dar siūbo ten, kur Eglė buvo, o tolimas žalčio šlamėjimas priminė, kad nuo šiol jis nebebus vienas.",
      "explanation": "       **Anachronizmas**: 'Žalčio šlamėjimas' – per vėlyvas terminas (žaltys kaip simbolis yra populiariau vėlesniuose tekstuose). 'Niekada nebebus visiškai vienas' – per modernus laiko apibūdinimas.       **Grammatinė netikrumas**: 'Lengvai siūbavo' – per retas žodis. XIV a. būtų naudojama tiesiog 'siūbo'.       ",
      "confidence": 0.99
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "style",
      "original": "Jis stovėjo ant naujos, pavojingos ateities ribos, visas purvinas, iki mirties pavargęs, bet pirmą kartą po ilgo laiko — laisvas.",
      "fixed": "Jis stovėjo prie naujos, baisios ateities ribos, purvinas, be jėgų, bet po ilgo laiko pirmą kartą laisvas.",
      "explanation": "       Perteklių ir per daug būdvardžių: 'pavojingos' -> 'baisios' (XIV a. būtų naudotas stipresnis būdvardis), 'iki mirties pavargęs' -> 'be jėgų' (pvz., 'be jėgų kaip miręs'). 'Visas purvinas' – 'purvinas' teisinga, bet 'visas' perteklių. 'Pirmą kartą po ilgo laiko — laisvas' – dviejų kartų 'laisvas' perteklių, todėl ištrintas.       ",
      "confidence": 0.99
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "grammar|style",
      "original": "Po skaidriu, bet klastingai giliu vandeniu, Vytis karts nuo karto matydavo baltuojančias kaukoles ir surūdijusių šarvų fragmentus — tylius pėdsakus tų drąsuolių, kurie bandė įveikti Dykrą be vedlio ir be pagarbos.",
      "fixed": "Po šviesaus, bet gilių vandens Vytis dažnai matydavo baltas kaukoles ir rūsčius šarvus – senųjų kariauninkų pėdsakus. Jie, be vedlio ir be pagarbos, bandė pražengti per pelkę.",
      "explanation": "       **Grammatinė netikrumas**: 'Skaidriu, bet klastingai giliu' – netinkamas žodžių junginys (dvejopė forma). 'Baltuojančias kaukoles' – per modernus apibūdinimas (XIV a. būtų naudojama tiesiog 'baltas').       **Stilius**: 'Dykra' kaip pavadinimas – netinkamas terminas. XIV a. tekstuose pelkė būtų aprašyta kaip 'pelkė' ar 'miškinga žemė'. 'Tylius pėdsakus' – per retas žodis.       ",
      "confidence": 0.98
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "grammar",
      "original": "naujos gyvybės, šviežių spyglių, dervos ir drėgnos žemės dvelksmas",
      "fixed": "jaunosios gyvosios, spyglių, dervos ir žemės drėgnumo kvapas",
      "explanation": "       'Naujos gyvybės' – neteisingas žodžių junginys (XIV a. būtų naudotas 'gyvosios' ar 'jaunosios gyvosios'). 'Šviežių spyglių' – 'spyglių' vienaskaitos forma būtų teisingesnė (pvz., 'spyglių kvapas'). 'Dvelksmas' – XIV a. būtų naudotas 'kvapas' (pvz., 'kvapas žemės'). 'Dervos' – teisinga, bet 'drėgnos žemės' būtų 'žemės drėgnumo'.       ",
      "confidence": 0.98
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "anachronism|style",
      "original": "Pelkė buvo pilna senų, alkanų dvasių, kurios iš šešėlių tyliai stebėjo kiekvieną jo drebantį žingsnį.",
      "fixed": "Pelkė buvo pilna senų dvasių, kurios iš šešėlių stebėjo kiekvieną žingsnį. Jos maldaudavo pagalbos arba pasmerkdavo netikėtus žmones.",
      "explanation": "       **Anachronizmas**: 'Alkanų dvasių' – per modernus apibūdinimas. Dvasios XIV a. mitologijoje būtų aprašytos kaip 'maldaudamos' ar 'pasmerkdamos', ne 'alkanos'.       **Stilius**: 'Tyliai stebėjo' – per romantiška. Dvasios būtų aprašytos kaip veikiančios konkretesnių veiksmu (pvz., 'maldaudavo').       ",
      "confidence": 0.97
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "anachronism",
      "original": "Kelias į vokiečių ordiną buvo atviras, bet kaina, kurią jis turėjo sumokėti už pagalbą, buvo didesnė už bet kokią pilį.",
      "fixed": "Kelias į kryžininkų žemes buvo atviras, bet kaina už pagalbą buvo didesnė už bet kokią pilį.",
      "explanation": "       'Vokiečių ordinas' – XIV a. lietuvių kalboje būtų naudotas 'kryžininkai' ar 'žemės kryžininkų' (pvz., 'žemės, kurias valdžia kryžininkai'). 'Pagalba' – XIV a. būtų 'palaipa' ar 'palaipa už pagalbą' (pvz., 'kaina už palaipą').       ",
      "confidence": 0.97
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "grammar|style",
      "original": "Jis retkarčiais lėtai iškišdavo savo skeltą, juodą liežuvį, tarsi mįslingai šnibždėdamas jai į ausį senas paslaptis apie tai, kas dabar tyko po nepermatomu vandens paviršiumi.",
      "fixed": "Žaltys retkarčiais iškišdavo savo skeltą liežuvį, tarsi šnibždėdamas senas paslaptis apie tai, kas tyko po vandens paviršiumi.",
      "explanation": "       - **Gramatika**: 'savo skeltą, juodą liežuvį' yra per daug retorinis; XIV a. tekstuose būtų naudojamas tiesesnis 'skeltą liežuvį'.       - **Stilius**: 'mįslingai šnibždėdamas' ir 'nepermatomu' yra per daug retoriniai; tekstas turi būti tiesesnis.       - **Kultūrinis netikslumas**: 'nepermatomas' būtų suprantamas, bet 'tyko' yra tiesesnis už 'dabar tyko'.       ",
      "confidence": 0.96
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "style|anachronism",
      "original": "Galiausiai ji atvedė jį prie vienišo, milžiniško akmens, kylančio tiesiai iš vandens, kurio paviršius buvo ištisai padengtas keistomis, švytinčiomis melsvomis kerpėmis.",
      "fixed": "Galiausiai ji atvedė prie vieno didelio akmens, kylančio iš vandens. Jo paviršius buvo dengtas senovinėmis, švytinčiomis kerpėmis.",
      "explanation": "       **Stilius**: 'Milžiniško' ir 'keistomis, švytinčiomis melsvomis' – per daug būdvardžių. XIV a. tekstuose būtų naudojami tik esminiai aprašai.       **Anachronizmas**: 'Švytinčios' – per modernus apibūdinimas. Kerpės būtų aprašytos kaip 'švytinčios' tik jei tai būtų aiškus mitologinis elementas (pvz., 'švytinčios nuo ugnies').       ",
      "confidence": 0.96
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "anachronism|grammar",
      "original": "Pirmas dalykas, kurį jis sąmoningai pajuto, buvo sunkus, dusinantis purvo ir pūvančių samanų svoris jo plaučiuose — kiekvienas įkvėpimas buvo kova.",
      "fixed": "Pirmas, ko sąmoningai pajuto, buvo sunkus, dusinantis purvo ir samanų svoris, kuris užpildė jo krūtinę; kiekvienas kvėpavimas buvo kovos.",
      "explanation": "       - **Anachronizmas**: 'įkvėpimas' ir 'plaučiai' yra anatominiai terminai, kurie XIV a. lietuvių kalboje būtų naudoti retai arba pakeisti į 'krūtinė' (senesnis terminas).       - **Stilius**: 'dusinantis' ir 'kova' yra per modernūs; XIV a. tekstuose būtų naudojami paprastesni būdvardžiai ('sunkus', 'duslus').       ",
      "confidence": 0.95
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "style|anachronism",
      "original": "— sekundės virto valandomis, o metrai — begalybe. Jie žengė pro skęstančius, pajuodusius ir kreivus medžius, kurie siekė pilką dangų tarsi suluošintos, maldaujančios žmogaus rankos.",
      "fixed": "Laikas slinko lėtai, o žingsniai į pelkę tarsi prarado savąjį svorį. Medžiai, susirūdinę ir susilaužę, išsikišo į pilką dangų, tarsi žmogaus rankos, maldaudamos pagalbos.",
      "explanation": "       **Anachronizmas**: 'Begalybe' kaip apibūdinimas laiko – per modernus terminas. 'Sekundės virto valandomis' – per ankstyvas laikotarpis, kai laikmatis buvo ne toks precizingas.       **Stilius**: 'Suluošintos, maldaujančios žmogaus rankos' – per romantiška metafora. XIV a. tekstuose būtų naudojami konkretesni, natūralesni aprašai (pvz., 'tarsi maldaudamos').       ",
      "confidence": 0.95
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "type": "anachronism",
      "original": "instinktais ir tais, kurie gyvena šešėliuose",
      "fixed": "gamtinėmis žinijomis ir tamsumos žmonėmis",
      "explanation": "       Žodis 'instinktai' yra anachronizmas – XIV a. žmonės nebuvo psichologizuoję elgsenos taip aiškiai. 'Instinktai' būtų vertinami kaip 'gamtinės žinios' (pvz., 'kaip gyvūnai žino, ko reikia'). 'Šešėliuose gyvenantys' būtų vertinama kaip 'tamsumos žmonės' (pvz., 'tamsos žmonės, kurie žino slaptąsias kelius').       ",
      "confidence": 0.95
    },
    {
      "file": "18_gelezinis_magistras.qmd",
      "type": "anglicism",
      "original": "Ir kokia bus galutinė kaina už jūsų... krikščioniškąją malonę?",
      "fixed": "Ir kokia bus kaina už jūsų pripažinimą?",
      "explanation": "'Krikščioniškąją malonę' yra tiesioginis vertimas iš anglų kalbos ('Christian favor'). XIV a. lietuvių kalboje tokio terminų nebuvo. Pakeičiau į 'pripažinimą', nes tai būtent tai, ko reikalavo Ordinas – pripažinimas krikščionybės ir valdžios.",
      "confidence": 0.99
    },
    {
      "file": "18_gelezinis_magistras.qmd",
      "type": "grammar",
      "original": "— Jūsų tėvo mirtis Krėvoje yra tragiška klaida, kurios buvo galima išvengti.",
      "fixed": "— Jūsų tėvo mirtis Krėvoje buvo klaida, kurią galima buvo išvengti.",
      "explanation": "XIV a. lietuvių kalboje nebuvo 'tragiškas' kaip būdvardis. 'Klaida' turėjo būti 'buvo', nes tekstas yra tiesioginis kalbėjimas, o ne rašytinis aprašymas. 'Kurios' pakeičiau į 'kurią', nes tai tiesioginis kalbėjimas, o ne rašytinis tekstas.",
      "confidence": 0.99
    },
    {
      "file": "18_gelezinis_magistras.qmd",
      "type": "anachronism|grammar",
      "original": "Tą akimirką jis galutinai suprato: Kniprode niekada nebus jo draugas ar sąjungininkas. Jis buvo tik įrankis, lygiai taip pat, kaip ir Ordinas šiame žaidime buvo tik kruvinas įrankis Vytautui pasiekti jo galutinį tikslą.",
      "fixed": "Tą akimirką Vytautas suprato: Kniprodas niekada nebus jam draugas. Jis buvo tik įrankis, kaip ir Ordinas – tik kūnas, kuriuo Vytautas siekia savo tikslą.",
      "explanation": "       **Anachronizmai**:       - 'Žaidime' – neegzistuojantis XIV a. žodis (pvz., 'dalyva' ar 'sąmokslas').       - 'Galutinis tikslas' – abstraktumas. XIV a. būtų 'tikslas' (be 'galutinis').       - 'Kruvinas įrankis' – modernus metaforinis žodynas. XIV a. būtų 'kūnas' (reikšmingas žodis, nes Ordinas buvo konkretus institutas).       **Gramatika**:       - 'Niekada nebus' – neegzistuojantis būdas (XIV a. būtų 'niekada nebus' arba 'nebus draugas').       - 'Jis buvo tik įrankis' – teisinga, bet 'lygiai taip pat' – perteklinis.       ",
      "confidence": 0.99
    },
    {
      "file": "18_gelezinis_magistras.qmd",
      "type": "anachronism",
      "original": "Jogaila padarė lemtingą klaidą, pasirinkdamas brolžudišką smurtą vietoj derybų civilizacijos šešėlyje.",
      "fixed": "Jogaila pasirinko brolžudišką smurtą, o ne derybas, kurios galėjo išsaugoti taiką.",
      "explanation": "'Civilizacijos šešėlyje' yra anachronizmas – XIV a. lietuvių kalboje tokio terminų nebuvo. 'Lemtingą klaidą' pakeičiau į 'pasirinkimą', nes tai būtent istorinis sprendimas, o ne klaida. 'Brolžudišką smurtą' paliekame, nes tai istorinis faktas.",
      "confidence": 0.98
    },
    {
      "file": "18_gelezinis_magistras.qmd",
      "type": "anachronism",
      "original": "— Aš sutinku su jūsų sąlygomis, magistre, — pasakė Vytautas. Žodžiai nuskambėjo lengvai, beveik abejingai, bet jų dvasinis svoris Vytauto širdyje buvo didesnis už bet kokį Marienburgo akmenį.",
      "fixed": "— Priešingai nei jūsų norėtumėte, magistre, — atsakė Vytautas. Žodžiai klausėsi lėtai, bet jo širdyje jie užsėdo giliau nei Marienburgo pilies akmenys.",
      "explanation": "       **Anachronizmai**:       - 'Sąlygos' XIV a. būtų vadinamos 'sutartimi' ar 'sąlyga' (be 'sąlygomis' kaip dgs. forma).       - 'Magistras' kaip titulatas XIV a. lietuvių kalboje neegzistavo (pvz., 'povietas' ar 'valdytojas').       - 'Dvasinis svoris' – abstraktumas. XIV a. būtų 'širdies svoris' ar 'dvasia'.       - 'Nuskambėjo... beveik abejingai' – neegzistuojantis būdas ('nuskambėti' reiškia 'girdėti', o 'abejingai' – modernus būdvardis).       **Stilius**: Išvengta 'beveik' (perteklinis). Pakeistas į 'klausėsi lėtai' – konkretesnis.       ",
      "confidence": 0.98
    },
    {
      "file": "18_gelezinis_magistras.qmd",
      "type": "style",
      "original": "Bet mes... mes galime jums padėti ištaisyti šią istorinę neteisybę. Mes galime suteikti jums galingą kariuomenę, neribotą auksą ir galią galutinai atsiimti tai, kas pagal prigimtį priklauso jūsų giminei.",
      "fixed": "Mes galime jums padėti atstatyti teisę. Suteiksime jums kariuomenę, auksą ir pagalbą atgauti tai, kas priklauso jūsų giminei.",
      "explanation": "'Istorinė neteisybė' ir 'neribotą auksą' yra pertekliniai būdvardžiai bei stilistinis perteklius. 'Galingą kariuomenę' pakeičiau į 'kariuomenę', nes XIV a. tekstuose būdvardžiai naudojami retai. 'Galutinai atsiimti' pakeičiau į 'atgauti', nes tai būtent tai, ko siekė Vytautas – atgauti žemes, o ne 'atsiimti'.",
      "confidence": 0.97
    },
    {
      "file": "18_gelezinis_magistras.qmd",
      "type": "anachronism|style",
      "original": "Magistras pradėjo ilgai ir užtikrintai kalbėti apie jų bendrą „civilizacijos misiją“, apie „pagonių sielų išgelbėjimą“, ir Vytautas suprato patį baisiausią dalyką: šis senas vyras iš tiesų, iki pačių gelmių tikėjo kiekvienu savo tariamu žodžiu.",
      "fixed": "Magistras ilgai ir tvirtai kalbėjo apie bendrą tikėjimo tvirtinimą, apie pagonius, kuriuos reikia įtikinti, ir Vytautas suprato geriausiai: šis senas vyras tikrai tikėjo savo žodžiais, kaip tikėtų į dievą.",
      "explanation": "       **Anachronizmai**:       - 'Civilizacijos misija' – neegzistuojantis XIV a. terminas. XIV a. būtų 'tikėjimo tvirtinimas' ar 'dvasinis darbas'.       - 'Pagonių sielų išgelbėjimas' – abstraktumas. XIV a. būtų 'pagonius įtikinti' (pvz., 'pagonių sielas išgelbėti' – neegzistuojantis žodynas).       **Stilius**:       - Išvengta abstraktumo ('baisiausią dalyką' → 'geriausiai').       - 'Iš tiesų, iki pačių gelmių' – perteklinis. XIV a. būtų 'tikrai' ar 'kaip tikėtų į dievą' (konkretesnis).       ",
      "confidence": 0.97
    },
    {
      "file": "18_gelezinis_magistras.qmd",
      "type": "style|anachronism",
      "original": "Miškas jo sieloje galutinai nutilo, užleisdamas vietą ledinei, racionaliai ir neįtikėtinai šaltai Marienburgo tvarkai. Atgalinis kelias į Lietuvą prasidėjo, bet tai nebuvo herojaus sugrįžimas; tai buvo kelias per išdavystę, svetimus dievus ir kraujo skonį ant lūpų.",
      "fixed": "Vytauto siela nutilo kaip miškas žiemą, o vietoje jos atsirado Marienburgo tvarka – šalta kaip ledas. Grįžtant į Lietuvą, jis negrįžo kaip herojus, o kaip žmogus, kuris paliko savo dievus ir pasidavė Ordino tvarkai.",
      "explanation": "       **Anachronizmai**:       - 'Racionaliai' – neegzistuojantis XIV a. žodis.       - 'Neįtikėtinai šaltai' – perteklinis.       - 'Kraujo skonį ant lūpų' – metaforinis, XIV a. būtų 'kraujo skonis' (be 'ant lūpų').       **Stilius**:       - 'Galutinai nutilo' – abstraktumas. XIV a. būtų 'nutilo kaip miškas žiemą'.       - 'Išdavystę, svetimus dievus' – perteklinis. XIV a. būtų 'paliko savo dievus' (konkretesnis).       - 'Herojaus sugrįžimas' – abstraktumas. XIV a. būtų 'grįžimas kaip herojus' (be 'sugrįžimas').       ",
      "confidence": 0.96
    },
    {
      "file": "24_pasirinkimas.qmd",
      "type": "anachronism|grammar",
      "original": "Jis tiksliai žinojo, kur kerta pagrindinės, storos kanapių virvės, laikančios visą šio sudėtingo mechanizmo svorį ir balansą.",
      "fixed": "Jis žinojo, kur prisižiūrėjęs storas virvės, kuri laikė bokšto svorį.",
      "explanation": "       - 'Sudėtingas mechanizmas' ir 'balansas' yra pernelyg techniniai žodžiai.       - 'Kerta' (kirsti) yra neegzistuojantis veiksmažodis šiame kontekste (XIV a. lietuvių kalboje nebuvo tokio žodžio).       - 'Pagrindinės' ir 'storos' yra pernelyg aiškūs būdvardžiai.       - 'Kanapių' virvės XIV a. būtų vadinamos tiesiog 'virvėmis' ar 'siūlomis'.       ",
      "confidence": 0.99
    },
    {
      "file": "24_pasirinkimas.qmd",
      "type": "anachronism|anglicism",
      "original": "Jis staigiu judesiu nukirto pirmąją virvę. Sunkus kanapių pluoštas nuaidėjo nakties tyloje tarsi tolimas, skausmingas botago kirtis į gyvą mėsą.",
      "fixed": "Jis staiga ištrynė virvę. Sunkus siūlų pluoštas nuaidėjo kaip smūgis į širdį.",
      "explanation": "       - 'Botago kirtis' yra anachronizmas (botagas – XIX a. terminas).       - 'Staigiu judesiu' yra pernelyg modernus būdvardinis lotyniškas žodis.       - 'Nukirto' (kirsti) yra neegzistuojantis veiksmažodis šiame kontekste.       - 'Tarsi tolimas skausmingas botago kirtis' yra pernelyg metaforiškas ir modernus.       ",
      "confidence": 0.99
    },
    {
      "file": "24_pasirinkimas.qmd",
      "type": "grammar",
      "original": "Jogailai: „Geležis dega. Išeik į lauką.“",
      "fixed": "Jogailai: „Geležis degia. Išeikite į lauką.“",
      "explanation": "XIV a. lietuvių kalboje nebuvo naudojamas 'Jogailai' (daugiskaitos forma) - Jogaila buvo vienas valdovas. Taip pat 'Išeik' - neegzistuojantis veiksmažodis. Pakeitę į 'Jogaila' ir 'Išeikite' (daugiskaitos forma, nes žinia skirta daugeliui žmonių).",
      "confidence": 0.99
    },
    {
      "file": "24_pasirinkimas.qmd",
      "type": "anachronism",
      "original": "Vilkas be gaujos, be namų, be garantijų ir be garbingo vardo.",
      "fixed": "Vilkas be draugų, be namų, be saugumo ir be garbingo vardžio.",
      "explanation": "Žodis 'garantijų' yra anachronizmas (XIV a. nebuvo naudojama ši reikšmė). 'Vardo' vietoje 'vardžio' (senesnis žodis). 'Be gaujos' - 'be draugų' (XIV a. 'gauja' reiškė žmonių grupę, bet 'draugai' buvo paprastesnis žodis).",
      "confidence": 0.99
    },
    {
      "file": "24_pasirinkimas.qmd",
      "type": "anachronism",
      "original": "Jis lėtai ir užtikrintai priėjo prie didžiausio apgulties bokšto — tos pačios milžiniškos konstrukcijos, kurią vokiečių inžinieriai su pasididžiavimu vadino „Lietuvos griovėju“. Tai buvo trijų aukštų medinė pabaisa, kruopščiai padengta šlapiomis žaliomis odomis, kad apsisaugotų nuo Jogailos gynėjų leidžiamų ugninių strėlių.",
      "fixed": "Jis lėtai priėjo prie didžiausio bokšto, kurį vokiečiai vadino 'Lietuvos griovėju'. Tai buvo aukštas medinis bokštas, dengtas šlapiomis odomis, kad apsaugotų nuo ugnies iš pilies.",
      "explanation": "       - 'Milžiniška konstrukcija' ir 'pabaisa' yra pernelyg modernūs būdvardžiai.       - 'Ugninės strėlės' yra anachronizmas – XIV a. Lietuvoje nebuvo žinomi degiųjų strėlių (tarpukario terminas).       - 'Inžinieriai' ir 'konstrukcija' yra pernelyg specializuoti žodžiai.       - 'Lietuvos griovėjas' yra tikslus, bet 'milžiniška' ir 'pabaisa' ištrenkiama.       ",
      "confidence": 0.98
    },
    {
      "file": "24_pasirinkimas.qmd",
      "type": "style",
      "original": "Tai nebuvo paprasta ugnis; tai buvo baisus, riaumojantis ir nevaldomas monstras, rydamas šimtamečius ąžuolo rąstus.",
      "fixed": "Tai nebuvo paprasta ugnis. Tai buvo smarkus ir nevaldomas ugnies gaisras, kuris sudegino senus ąžuolo rąstus.",
      "explanation": "Per daug būdvardžių ('baisus, riaumojantis, nevaldomas') ir perteklių ('monstras'). Pakeitę į 'smarkus ir nevaldomas ugnies gaisras' (panašus reiškinys, bet be perteklių). 'Šimtamečius' pakeitę į 'senus' (XIV a. 'šimtamečius' reiškė 'senus', bet 'senus' yra paprastesnis žodis).",
      "confidence": 0.98
    },
    {
      "file": "24_pasirinkimas.qmd",
      "type": "style|grammar",
      "original": "Jo rankos šiek tiek drebėjo, bet tai nebuvo paprasta, žmogiška baimė. Tai buvo adrenalinas, įniršis ir ta baisi, negrįžtama išdavystės kaina, kurią jis sąmoningai turėjo sumokėti už Vilniaus išsaugojimą.",
      "fixed": "Jo rankos drebėjo, bet ne dėl baimės. Tai buvo pyktis ir išdavystės kaina už Vilnių.",
      "explanation": "       - 'Adrenalinas' yra anachronizmas (nebuvo žinomas XIV a.).       - 'Negrįžtama išdavystės kaina' yra pernelyg modernus ir metaforiškas žodžių junginys.       - 'Sąmoningai turėjo sumokėti' yra pernelyg aiškus ir modernus.       - 'Žmogiška baimė' yra pernelyg aiškus būdvardinis junginys.       - 'Šiek tiek' yra pernelyg modernus būdvardis.       ",
      "confidence": 0.97
    },
    {
      "file": "24_pasirinkimas.qmd",
      "type": "anachronism",
      "original": "Teutonų stovykloje kilo nevaldomas, baisus chaosas. Riteriai rėkė nesuprasdami kas vyksta, žirgai baidėsi ir trūpino aptvarus, o juodi dūmai užpildė visą Vilniaus slėnį, darydami viską aplinkui nerealu, tarytum košmarišką paveikslą.",
      "fixed": "Teutonų stovykloje kilo nevaldomas triukšmas. Riteriai rėkė, nesuprasdami kas vyksta, žirgai baidėsi ir trūpino aptvarus. Juodi dūmai užpildė visą slėnį, padarydami aplinką nepriimtinai smarkiai nerealu.",
      "explanation": "Žodis 'chaosas' yra anglizmas. 'Nerealu, tarytum košmarišką paveikslą' - per daug būdvardžių ir perteklių. Pakeitę į 'nevaldomas triukšmas' (senesnis žodis) ir 'nepriimtinai smarkiai nerealu' (panašus reiškinys, bet be perteklių).",
      "confidence": 0.97
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "type": "anachronism|grammar",
      "original": "Jis buvo priverstas išduoti tėvo garbę Krėvoje, kad išgyventų. Dabar jis ciniškai išdavė didžiausią Europos karinę jėgą — Ordiną, — kad stebuklingai išgelbėtų miestą, kurio jis pats nebevaldė ir galbūt niekada nebevaldys.",
      "fixed": "Jis buvo priverstas palikti tėvo garbę Krėvoje, kad išgyventų. Dabar jis išdavė didelę karinę jėgą – Teutonų ordino žmones, – kad išgelbėtų miestą, kurį nebevaldė ir galbūt niekada nebevaldys.",
      "explanation": "       1) 'Išduoti garbę' – neegzistuojantis XIV a. žodis. Pakeistas į 'palikti garbę' (panašus požiūris, bet tinkamesnis).       2) 'Europos karinė jėga' – anachronizmas (XIV a. nebuvo toks terminas). Pakeista į 'Teutonų ordino žmones' (realistiškesnis).       3) 'Stebuklingai išgelbėtų' – religinis požiūris, kuris XIV a. būtų neigiamai vertintas. Pakeista į 'išgelbėtų' (neiškeltas stebuklas).       4) 'Neprognozuojama išdavystė' – anachronizmas. Pakeista į 'išdavimas' (paprastesnis, neegzistuojantis XIV a. žodis).       ",
      "confidence": 0.99
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "type": "anachronism|grammar",
      "original": "Jogaila Vilniuje taip pat nebuvo jo laukęs su ištiestomis rankomis; jis buvo šaltakraujis brolžudys, kuris dabar tiesiog ramiai stebėjo situaciją iš tolo, kantriai laukdamas, kol jo pusbrolis galutinai sunaikins pats save tarp dviejų ugnių.",
      "fixed": "Jogaila Vilniuje nebuvo jo laukęs. Jis buvo šaltakraujis brolis, kuris stebėjo, kaip Vytautas pats pats nusiaubiamas tarp dviejų priešų.",
      "explanation": "       1) 'Su ištiestomis rankomis' – anachronizmas (nebuvo XIV a. žodis). Pakeista į 'nebuvo jo laukęs' (paprastesnis).       2) 'Šaltakraujis brolžudys' – 'brolžudys' XIV a. būtų neigiamai vertintas. Pakeista į 'šaltakraujis brolis' (neiškeltas žudymas).       3) 'Kantriai laukdamas' – anachronizmas ('kantrus' nebuvo XIV a. žodis). Pakeista į 'stebėjo' (paprastesnis).       4) 'Tarp dviejų ugnių' – metafora, kuri XIV a. būtų neaiški. Pakeista į 'tarp dviejų priešų' (realistiškesnis).       ",
      "confidence": 0.99
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "type": "style|grammar",
      "original": "Jis kovėsi dėl kitos gyvybinės sekundės, dėl kito žingsnio gilyn į laisvę.",
      "fixed": "Jis kovėsi už kiekvieną gyvybės sekundę, už kiekvieną žingsnį į laisvę.",
      "explanation": "         **Klaida**:         - 'Gyvybinės sekundės' – per metaforiškas, XIV a. būtų naudojamas 'gyvybės sekundės' (be 'gyvybinės').         - 'Dėl kito žingsnio gilyn' – neteisinga sintaksė (XIV a. lietuvių kalboje būtų 'už kiekvieną žingsnį').         - Perteklių ('kitos', 'kito') – XIV a. tekstai būtų trumpesni ir tiesesni.          **Ištaisymas**:         - Pakeista į 'už kiekvieną gyvybės sekundę' (konkretesnis).         - Sintaksė pakeista į 'už kiekvieną žingsnį' (senovės lietuvių kalbos bruožai).       ",
      "confidence": 0.99
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "type": "anachronism",
      "original": "Jis tapo mitine būtybe, kuria niekas negalėjo pasitikėti, bet kurios bijojo visi.",
      "fixed": "Jis tapo žmogumi, kurį visi bijojo ir kuris niekam nepasitikėjo.",
      "explanation": "XIV a. lietuvių kalba nebuvo terminų kaip 'mitinė būtybė' ar 'neprognozuojama išdavystė'. Pakeitimas į paprastesnį, realistišką aprašymą, kuris atitinka XIV a. kalbos stilių. 'Bijojo visi' – paprastesnis, negu 'bijojo visi' (be 'kurios' – neegzistuojantis XIV a. žodis).",
      "confidence": 0.98
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "type": "anachronism|style",
      "original": "Jis buvo neabejotinas išdavikų išdavikas. Bet jis vis dar buvo gyvas, kvėpuojantis ir pajėgus mąstyti. Ir šitame brolžudiškų kovų draskomame pasaulyje tai buvo pati didžiausia įmanoma pergalė, nešanti savyje didžiulę ateities grėsmę.",
      "fixed": "Jis buvo išdavikų išdavikas. Bet vis dar gyvas, galėjęs mąstyti. Šiame brolžudiškų kovų draskomame pasaulyje tai buvo didžiausia pergalė, kurią galėjo turėti žmogus.",
      "explanation": "         **Klaida**:         - 'Neabejotinas išdavikų išdavikas' – perteklių ('neabejotinas' ir 'išdavikų išdavikas' – dvigubas).         - 'Kvėpuojantis ir pajėgus mąstyti' – per daug būdvardžių (XIV a. būtų 'galėjęs mąstyti').         - 'Nešanti savyje didžiulę ateities grėsmę' – per metaforiškas (XIV a. būtų 'kuria didelę grėsmę ateičiai').         - 'Draskomas pasaulys' – per metaforiškas (XIV a. būtų 'kovų pasaulys').          **Ištaisymas**:         - 'Neabejotinas' ištrintas.         - 'Kvėpuojantis ir pajėgus' pakeista į 'galėjęs mąstyti'.         - 'Nešanti savyje didžiulę ateities grėsmę' pakeista į 'kuria didelę grėsmę ateičiai'.         - 'Draskomas' pakeista į 'kovų'.       ",
      "confidence": 0.98
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "type": "anglicism|style",
      "original": "Jis bėgo ne vienas, nors jautėsi visiškai vienišas. Su juo vis dar laikėsi mažas, ištikimas būrys vyrų, kurie sekė jį per mirtinas pelkes ir tankiausius miškus, vedami kažkokios neaiškios, mistinės ištikimybės žmogui, kurio poelgiai aplinkiniams atrodė kaip protu nesuvokiamas, kliedesinga klaidžiojimas tarp gėrio ir blogio.",
      "fixed": "Jis bėgo vienas, bet jautėsi vienišas. Su juo liko nedidelis būrys žmonių, kurie sekė jį per mirtines pelkes ir miškus. Jie sekė jį ne dėl aiškios ištikimybės, bet dėl paties Vytauto žmogaus, kurio poelgiai atrodė neaiški ir nepatikimi.",
      "explanation": "       1) 'Ne vienas, nors jautėsi visiškai vienišas' – perteklių (duburys). Pakeista į 'vienas, bet jautėsi vienišas'.       2) 'Neaiškios, mistinės ištikimybės' – anachronizmas ('mistinis' nebuvo XIV a. žodis). Pakeista į 'neaiškios ištikimybės' (paprastesnis).       3) 'Protu nesuvokiamas, kliedesinga klaidžiojimas tarp gėrio ir blogio' – per daug metaforų ir būdvardžių. Pakeista į 'neaiški ir nepatikimi' (realistiškesnis).       ",
      "confidence": 0.97
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "type": "anachronism|style",
      "original": "Jos buvo pajuodusios nuo pūvančio purvo, parako dūmų ir brolių kraujo.",
      "fixed": "Jos buvo pajuodusios nuo purvo, dūmų ir brolių kraujo.",
      "explanation": "         **Klaida**:         - 'Pūvančio purvo' – per metaforiškas (XIV a. būtų 'purvo').         - 'Parako dūmų' – anachronizmas (neegzistavo).         - Perteklių ('pajuodusios' – per daug būdvardžių).          **Ištaisymas**:         - Ištrintas 'pūvančio' ir 'parako dūmų'.         - 'Pajuodusios' pakeista į 'pajuodusios' (tiek pat, bet trumpiau).       ",
      "confidence": 0.97
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "type": "style",
      "original": "io gedulo ar sielvarto; tik tyras, protėvių alkis ir nauja, negailestinga jėga.",
      "fixed": "io skausmo ar sielos smurto; tik šaltas, protėvių gniaužtas ir nešvarus dvasia.",
      "explanation": "       1. **Stilius**: 'Gedulo' ir 'sielvarto' pakeičiami į 'skausmo' ir 'sielos smurto' – XIV a. lietuviškai būtų naudojami paprastesni žodžiai.       2. 'Alkis' pakeičiamas į 'gniaužtas' (XIV a. lietuviškai būtų naudojamas žodis 'gniaužti' ar 'gniaužtas' – reiškiantis jėgą, smurtą).       3. 'Nauja, negailestinga jėga' pakeičiamas į 'nešvarus dvasia' – XIV a. lietuviškai būtų naudojami retesni žodžiai, o 'nešvarus' reiškia nešvarumą, nešvarą, o ne tik jėgą.       ",
      "confidence": 0.95
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "type": "grammar",
      "original": "Vilkas ne tik sugrįžo į mišką; jis tapo pačiu mišku.",
      "fixed": "Vilkas ne tik grįžo į mišką; jis tapo pati miško jėga.",
      "explanation": "       1. 'Sugrįžo' pakeičiamas į 'grįžo' – XIV a. lietuviškai būtų naudojamas paprastesnis žodis.       2. 'Pačiu mišku' pakeičiamas į 'pati miško jėga' – XIV a. lietuviškai būtų naudojami metaforiniai žodžiai, reiškiantys jėgą, ne konkretų daiktą.       ",
      "confidence": 0.95
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "type": "style",
      "original": "Ir šį kartą jis tiksliai žinojo, kaip jame valdyti visas baimes.",
      "fixed": "Ir šį kartą jis žinojo, kaip jį įveikti ir baimes ištrinti.",
      "explanation": "       1. 'Tiksliai žinojo' pakeičiamas į 'žinojo' – 'tiksliai' yra anachronizmas.       2. 'Valdyti' pakeičiamas į 'įveikti ir baimes ištrinti' – XIV a. lietuviškai būtų naudojami žodžiai, reiškiantys kovą su baime, ne valdymą.       ",
      "confidence": 0.95
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "grammar",
      "original": "Sudegusių valstiečių trobų pajuodusios liekanos kyšojo iš juodos, gaisrų nualintos žemės tarsi kreivi, grasinantys pirštai, o ore vis dar sunkiai tvyrojo tas dusinantis, graužiantis pelenų ir degančios ąžuolo medienos tvaikas.",
      "fixed": "Sudegusių trobų liekanos pajuodė žemę, o ore tvyrojo pelenų ir degančios medienos tvaikas, kuris graužė nosį.",
      "explanation": "'Pajuodusios liekanos' yra neegzistuojantis XIV a. žodis ('pajuodusios' kaip būdvardis). 'Graužiantis tvaikas' yra per metaforiškas. Pakeičiami į paprastesnius, XIV a. tinkamus žodžius.",
      "confidence": 0.99
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "anachronism",
      "original": "Jogaila, priešingai, buvo pasidabinęs prabangiais Krokuvos šilkais ir brangiomis kailio skraistėmis, tačiau po šia išorine ramybe ir puošnumu Vytis aiškiai matė drebančias rankas ir neryžtingą, klajojantį žvilgsnį, kurio neuždengė jokios karūnos.",
      "fixed": "Jogaila, priešingai, buvo apsirengęs šilkais ir kailiais, tačiau jo rankos drebėjo, o žvilgsnis klajojo be jokių valdovo žymų.",
      "explanation": "'Krokuvos šilkai' yra anachronizmas (XIV a. lietuviškai nebuvo 'Krokuva'). 'Karūna' yra krikščioniškas terminas, kuris XIV a. lietuviškai nebuvo toks aiškiai išraiškingas. Pakeičiami į paprastesnius žodžius.",
      "confidence": 0.99
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "grammar",
      "original": "Jis buvo milžiniškas inkaras, traukiantis visus mus į tamsų dugną, kol dar nebuvome išmokę plaukti.",
      "fixed": "Jis buvo milžiniškas uola, traukianti mus į tamsų dugną, kol dar nebuvome išmokę plaukti.",
      "explanation": "'Inkaras' nėra XIV a. lietuviškas žodis (panašus reikšmės žodis - 'uola'). 'Traukiantis' pakeičiamas į 'traukianti', nes 'inkaras' yra moteriškosios giminės žodis. 'Mus' pakeičiamas į 'mus' (linksnis teisingas, bet 'inkaras' turi būti moteriškas).",
      "confidence": 0.99
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "grammar",
      "original": "— Mes sudarysime laikinąsias paliaubas, — pasakė Vytautas, ir jo žodžiai nuskambėjo kaip nuosprendis jiems abiems.",
      "fixed": "— Sudarysim laikinas paliaubą, — pasakė Vytautas. Jo žodžiai nuskambėjo kaip nuosprendis abiem.",
      "explanation": "'Laikinąsias paliaubas' (daugiskaitos neteisingumas, nes paliauba yra vienaskaitos). 'Jiems abiems' pakeičiamas į 'abiem' (linksnis teisingas, bet 'jiems' yra neteisingas).",
      "confidence": 0.99
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "grammar|style",
      "original": "Tu būsi mano karalius, Jogaila, tavo vardą garsins Europoje, bet aš visada būsiu tavo ilgiausias šešėlis, tavo aštriausias kalavijas ir tavo nešvari sąžinė, kurios tu bijosi kiekvieną kartą užmerkęs akis.",
      "fixed": "Tu būsi karalius, Jogaila, ir tavo vardas klausėsi Europos žemėse. Bet aš visada būsiu tavo ilgiausias šešėlis, tavo aštriausias ginklas ir tavo nešvari sąžinė, kurią tu bijosi užmerkdamas akis.",
      "explanation": "         **Grammatinis netikslumas**: 'Tavo vardą garsins Europoje' – netinkamas linksnis ('garsinti' reikėtų būti 'klausėsi'). XIV a. lietuvių kalboje vartotas 'klausėsi' (pvz., 'vardas klausėsi žemėse').         **Stilius**: 'Aštriausias kalavijas' pakeistas į 'aštriausias ginklas' (kalavijas XIV a. tekstuose dažniau minima kaip 'ginklas' ar 'peilis').         **Anglicizmas**: 'Nešvari sąžinė' – neegzistuojantis terminas. Pakeistas į 'nešvari sąžinė' (bet su korekcija: 'nešvari' yra teisinga, o 'nešvari' – neteisingas rašybos variantas).         **Perteklinumas**: Ištrintas 'tavo' prieš 'vardą' (XIV a. tekstuose dažniau vartotas tiesioginis linksnis).       ",
      "confidence": 0.99
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "grammar|style",
      "original": "Pusbroliai stovėjo sudegusios bažnyčios viduryje, apsupti pelenų, dūmų ir sielvarto, ir tą istorinę akimirką jie abu galutinai suprato, kad nuo šiol jie bus surišti amžinai — nebe šventu krauju, o bendra kalte, bendra paslaptimi ir bendru, gyvulišku poreikiu išgyventi pasaulyje, kuris nebeturėjo vietos nei vienam iš jų senųjų pagoniškų idealų.",
      "fixed": "Pusbroliai stovėjo sudegusios bažnyčios viduryje, aplinkui pelenus ir dūmus, ir tuomet suprato, kad nuo šiol jie bus surišti amžinai — ne šventu krauju, bet bendra kalte, bendra paslaptimi ir bendru poreikiu išgyventi pasaulyje, kuris nebeliko vietos jų seniesiems pagoniškiesiems idealams.",
      "explanation": "         **Grammatinis netikslumas**:         - 'Apsupti pelenų, dūmų ir sielvarto' → 'Aplinkui pelenus ir dūmus' (XIV a. lietuvių kalboje vartotas 'aplinkui' su tiesioginiu linksniu).         - 'Ne šventu krauju, o bendra kalte' → 'Ne šventu krauju, bet bendra kalte' (tiesesnis XIV a. stilus, 'bet' dažniau naudotas nei 'o').         **Stilius**:         - 'Gyvulišku poreikiu' → 'Bendru poreikiu' (XIV a. tekstuose 'gyvuliškas' retai vartotas, o 'poreikiu' – tiesesnis).         - 'Nei vienam iš jų senųjų pagoniškų idealų' → 'Nei jų seniesiems pagoniškiesiems idealams' (tiesesnis linksnis ir rašybos korekcija: 'seniesiems' ir 'pagoniškiesiems').         - Ištrintas 'istorinę akimirką' (per daug abstraktumas).       ",
      "confidence": 0.99
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "anachronism",
      "original": "Vilniaus priemiesčiai po ilgų savaičių negailestingos apgulties dabar atrodė kaip šiurpus, nebegyvas milžinų skeletų laukas.",
      "fixed": "Vilniaus apylinkės po ilgų savaičių apgulties atrodė kaip mirtinai sudegusi, apleista vieta, kurioje liko tik apdegusių trobų liekanos.",
      "explanation": "XIV a. lietuviškai nebuvo 'priemiesčiai' (anachronizmas), 'milžinų skeletų laukas' yra per metaforiškas ir neegzistuojantis žodis. Pakeičiami į konkretesnius, XIV a. tinkamus terminus.",
      "confidence": 0.98
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "style|anachronism",
      "original": "Sutemos pagaliau galutinai prarijo bažnyčios likučius. Vytautas lėtai pasisuko ir pirmas išėjo į naktį, palikdamas Jogailą vieną stūksančiuose griuvėsiuose su jo auksais, šilkais ir begalinėmis baimėmis.",
      "fixed": "Sutemos galutinai prarijo bažnyčios griuvėsius. Vytautas lėtai pasisuko ir pirmas išėjo į naktį, palikdamas Jogailą vieną griuvėsių viduryje, su jo auksais ir šilkais, o baimė klausėsi kaip širdies šauksmas.",
      "explanation": "         **Stilius**:         - 'Begalinėmis baimėmis' → 'Baimė klausėsi kaip širdies šauksmas' (XIV a. metaforos dažniau naudojo 'klausėsi' nei 'begalinis').         - 'Stūksančiuose griuvėsiuose' → 'Griuvėsių viduryje' (tiesesnis XIV a. stilus).         - Ištrintas 'pagaliau' (per daug modernus tempinis žodis).         **Anachronizmas**: 'Begalinėmis baimėmis' – 'begalinis' kaip būdvardis XIV a. tekstuose neegzistavo.       ",
      "confidence": 0.98
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "anachronism",
      "original": "Pusbroliai susitiko neutralioje vietoje — apgriuvusios, sudegusios medinės bažnyčios griuvėsiuose. Tai buvo vieta, kuri po gaisro nebebuvo nei šventa pagoniška giraitė, nei naujakurių krikščioniški maldos namai.",
      "fixed": "Pusbroliai susitiko senosios medinės kapinės, kurios buvo sudegusios gaisro metu. Čia nebeliko nei senosios šventosios girios, nei naujai pastatytų krikščioniškų maldos namų.",
      "explanation": "'Neutralioje vietoje' yra anachronizmas (XIV a. lietuviškai nebuvo toks terminas). 'Bažnyčios griuvėsiai' yra krikščioniškas terminas, kuris XIV a. lietuviškai nebuvo toks aiškiai išraiškingas. Pakeičiami į paprastesnius žodžius.",
      "confidence": 0.97
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "anglicism",
      "original": "Jogaila akimirksniu, beveik instinktyviai nusuko akis į šalį.",
      "fixed": "Jogaila akimirksniu, beveik natūraliai, nusuko akis į šalį.",
      "explanation": "'Instinktyviai' yra tiesioginis anglų kalbos vertimas. XIV a. tekstas naudotų 'natūraliai' arba 'savotiškai'.",
      "confidence": 0.97
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "anachronism|style",
      "original": "Tai nebuvo taikos sutartis; tai buvo mirtino šaltojo karo tarp artimiausių žmonių pradžia.",
      "fixed": "Tai nebuvo taikos sutartis, bet susitarimas, kuris prasidėjo kaip šaltas karas tarp artimiausių žmonių.",
      "explanation": "         **Anachronizmas**: 'Mirtino šaltojo karo' – terminas 'šaltasis karas' atsirado XX a. Pakeistas į 'šaltas karas' (XIV a. tekstuose vartotas 'šaltas karas' kaip metafora).         **Stilius**: Ištrintas 'nebuvo taikos sutartis; tai buvo' (per daug abstraktumas). Pakeista į 'susitarimas, kuris prasidėjo kaip šaltas karas' (autentiškesnis XIV a. stilius).       ",
      "confidence": 0.97
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "style",
      "original": "Tai buvo pats pirmasis kartas, kai abu pusbroliai pažvelgė vienas kitam tiesiai į akis po tos baisios, Kraujo ir išdavystės nakties Krėvos požemiuose.",
      "fixed": "Tai buvo pirmas kartas, kai abu pusbroliai pažvelgė vienas kitam tiesiai į akis po Krėvos mūšio.",
      "explanation": "'Baisios, Kraujo ir išdavystės nakties' yra perteklinis ir metaforiškas. XIV a. lietuviškai būtų panaudotas trumpesnis, konkretesnis terminas ('Krėvos mūšis').",
      "confidence": 0.95
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "type": "style",
      "original": "Tai būtų buvę labai paprasta. Tai būtų buvę teisinga pagal senąjį karingą įstatymą.",
      "fixed": "Tai būtų buvę paprasta. Senasis karingas įstatymas tai leistų.",
      "explanation": "Perteklių būdvardžių ('labai paprasta', 'teisinga') ir perteklių žodžių ('tai būtų buvę') tekstą padaryti sunkiau skaitomą. XIV a. tekstas būtų trumpesnis ir tiesesnis.",
      "confidence": 0.95
    },
    {
      "file": "prologue.qmd",
      "type": "anachronism|grammar",
      "original": "— Nuvežk savo užsakovui šią žinią, — tarė ji balsu, kuris labiau priminė lūžtantį pavasario ledą nei žmogaus kalbą.",
      "fixed": "— Nuvežk šią žinią savo valdovui, — tarė ji balsu, kuris priminė ledą, prasiveržusį iš žemės.",
      "explanation": "       - **Anachronizmas**: 'užsakovui' – XIV a. terminas būtų 'valdovui' ar 'kunigaikščiui' (neegzistuojantis 'užsakovas').       - **Stilius**: 'lūžtantį pavasario ledą' yra perteklių metafora. XIV a. tekstuose būtų naudojama tiesesnė, natūralesnė metafora ('ledas, prasiveržęs iš žemės').       ",
      "confidence": 0.99
    },
    {
      "file": "prologue.qmd",
      "type": "anachronism|grammar",
      "original": "Eglė net nepasisuko. Ji pajuto tą šaltą, pragmatišką plieno buvimą savo erdvėje dar gerokai prieš jį pamatydama.",
      "fixed": "Eglė nepasisuko. Ji pajuto šaltą, nepažįstamą jėgą savo erdvėje dar prieš patį žmogų pamatydama.",
      "explanation": "       - **Anachronizmas**: 'pragmatišką plieno buvimą' – 'plienas' yra anachronizmas (XIV a. naudojamas geležis). 'Pragmatizmas' – neegzistuojantis XIV a. terminas.       - **Gramatika**: 'savo erdvėje' – netinkamas linksniavimas. XIV a. būtų naudojama tiesesnė forma ('erdvėje').       - **Stilius**: 'nepažįstamą jėgą' – tiesesnis nei 'šaltą, pragmatišką plieno buvimą'.       ",
      "confidence": 0.99
    },
    {
      "file": "prologue.qmd",
      "type": "anachronism|grammar",
      "original": "— Tai paprastas faktas. Tai ištiso amžiaus pabaiga. Jūsų vaikai nebepažins šios tylos.",
      "fixed": "— Tai tikra žodis. Amžius baigiasi, o jūsų vaikai neklausys šios tylos.",
      "explanation": "         - 'Paprastas faktas' – modernus stilius. Pakeistas į 'tikra žodis' (senovės lietuvių kalboje 'tikras' reiškė tikrą, nešmatą).         - 'Ištiso amžiaus pabaiga' -> 'Amžius baigiasi' (XIV a. lietuvių kalboje nebuvo 'ištisas' kaip dabar).         - 'Nebepažins' -> 'neklausys' (pažinti – žinoti, o klausyti – girdėti, o vaikai 'klausys' – girdės).       ",
      "confidence": 0.99
    },
    {
      "file": "prologue.qmd",
      "type": "anachronism|style",
      "original": "Kapitonas pasišalino, palikdamas giraitę dar gilesnėje tamsoje. Eglė vėl atsiklaupė prie ugnies, bet žarijos jau buvo pradėjusios blėsti, virstant į pilkus, šaltus pelenus. Žaidimas prasidėjo, ir niekas, net dievai, negalėjo jo sustabdyti.",
      "fixed": "Vyras išėjo, palikdamas šaltą tamsoje. Eglė atsiklaupė prie ugnies, kuri jau blėso, virstant į pelenus. Žaidimas prasidėjo, ir niekas, net dievai, negalėjo sustabdyti.",
      "explanation": "         - 'Pasišalino' -> 'išėjo' (senovės lietuvių kalboje 'pasišalinti' – retas veiksmas).         - 'Giraitę' -> 'šaltą' (XIV a. lietuvių kalboje 'giraitė' – modernus žodis, o 'šaltas' – natūralesnis).         - 'Žarijos' -> 'ugni' (XIV a. lietuvių kalboje 'žarijos' – modernus žodis, o 'ugni' – tiesioginis).         - 'Pilkus, šaltus pelenus' -> 'pelenus' (per daug būdvardžių).         - 'Žaidimas prasidėjo' – modernus metaforinis žodis. Pakeista į 'prasidėjo' (tiesioginis veiksmas).       ",
      "confidence": 0.99
    },
    {
      "file": "prologue.qmd",
      "type": "anachronism|grammar|style",
      "original": "Eglė lėtai, neapsakomai oriai atsistojo, lėtu judesiu išsilygindama savo baltus, nešvarius lininius drabužius.",
      "fixed": "Eglė lėtai atsistojo, išsilygindama savo baltus, šviesius drabužius.",
      "explanation": "       - **Stilius**: 'neapsakomai oriai' ir 'nešvarius lininius' yra perteklių būdvardžių kūrimas, kuris neegzistuotų XIV a. tekstuose. 'Neapsakomai' yra anachronizmas (panašus į anglų 'unfathomable').       - **Gramatika**: 'nešvarius lininius' yra netinkamas linksniavimas (dvejopė forma). XIV a. tekstuose būtų naudojamas tiesesnis 'baltus drabužius' arba 'šviesius drabužius'.       - **Terminai**: 'lininiai' yra anachronizmas (linas kaip tekstilės medis XIV a. Lietuvoje nebuvo naudojamas masiškai).       ",
      "confidence": 0.98
    },
    {
      "file": "prologue.qmd",
      "type": "anachronism|style",
      "original": "— Jie perplėš paties pasaulio gerklę, — sušnibždėjo ji, pajutusi, kaip jos pačios rankos nevaldomai dreba nuo reginio svorio.",
      "fixed": "— Jie perplėš pasaulio širdį, — tarė ji, pajutusi, kaip jos rankos dreba nuo reginio.",
      "explanation": "       - **Stilius**: 'gerklę' ir 'reginio svorio' yra perteklių metaforų kūrimas. XIV a. tekstuose būtų naudojama tiesesnė forma ('pasaulio širdį' – senovės lietuvių mitologijoje pasaulio simbolis).       - **Gramatika**: 'nevaldomai dreba' – netinkamas būdvardis ('nevaldomai' yra anachronizmas, XIV a. būtų naudojama tiesesnė forma).       ",
      "confidence": 0.98
    },
    {
      "file": "prologue.qmd",
      "type": "anachronism",
      "original": "Kapitonas bjauriai susiraukė, jo dešinė ranka instinktyviai nukrito ant kalavijo rankenos. — Ar tai tavo grasinimas didžiajam kunigaikščiui, raganos palikuone?",
      "fixed": "Vyras, kuris laivą valdo, susiraukė, o jo dešinė ranka nukrito ant kalavijo rankenos. — Ar tai tavo grasinimas didžiajam kunigaikščiui, raganos dukteri?",
      "explanation": "         - 'Kapitonas' kaip laivyno pareigūnas yra anachronizmas XIV a. lietuvių kalboje (laivai buvo retumė, o 'kapitonas' – vėlesnis žodis).         - 'Instinktyviai' – modernus būdvardis. Pakeistas į 'nukrito' (natūralesnis veiksmas).         - 'Raganos palikuone' -> 'dukteri' (XIV a. lietuvių kalboje 'palikuonis' reiškė palikuonį, o 'dukteri' – tiksliau).       ",
      "confidence": 0.98
    },
    {
      "file": "prologue.qmd",
      "type": "anachronism|grammar",
      "original": "— Eik, — ramiai, bet galingai įsakė ji. — Pasakyk jam dar vieną dalyką, kurio jis bijojo paklausti: Geležinis Vilkas šią naktį klykia ne iš alkio, o iš sielvarto.",
      "fixed": "— Eik, — sakė ji ramiai, bet galingai. — Pasakyk jam dar vieną žodį, kurį jis bijojo paklausti: Geležinis Vilkas šią nakties klyksta ne iš alkio, o iš sielos skausmo.",
      "explanation": "         - 'Ramiai, bet galingai' – modernus stilius. Pakeista į 'sakė ramiai, bet galingai' (senovės lietuvių kalboje būdvardžiai naudoti retai).         - 'Dalyką' -> 'žodį' (XIV a. lietuvių kalboje 'dalykas' reiškė dalyką, o 'žodis' – tiksliau).         - 'Klykia' -> 'klyksta' (senovės lietuvių kalboje 'klykti' reiškė skambėti, o 'klyksta' – tiesioginis veiksmas).         - 'Sielvarto' -> 'sielos skausmo' ('sielvartas' – modernus žodis, o 'sielos skausmas' – senovės lietuvių kalbos bruožas).       ",
      "confidence": 0.98
    },
    {
      "file": "prologue.qmd",
      "type": "anachronism|style",
      "original": "Už jos nugaros staigus, sunkus ir nepagarbus šarvuotų batų kaukšėjimas grubiai sulaužė giraitės magišką šventumą.",
      "fixed": "Už jos nugaros girdėjo sunkūs, nepagarbūs pėdų žingsniai, kurie sulaužė šventovės šventumą.",
      "explanation": "       - **Anachronizmas**: 'šarvuotų batų kaukšėjimas' – XIV a. šarvai būtų 'pvėsiniai' ar 'dailės medžioklės skydai', o 'batai' neegzistuotų (naudojamos medinės batelės arba naktys).       - **Stilius**: 'staigus, sunkus ir nepagarbus' yra perteklių būdvardžių kūrimas. XIV a. tekstuose būtų naudojama tiesesnė forma ('sunkūs pėdų žingsniai').       ",
      "confidence": 0.97
    },
    {
      "file": "prologue.qmd",
      "type": "anachronism|style",
      "original": "Ji trumpam pažvelgė aukštyn į didingų, senųjų ąžuolų viršūnes, kurios siūbavo nuo tolimos perkūnijos. Iš Vakarų, iš už vandenų, nepermaldaujamai artėjo didžiulė, juoda kaip smala audra.",
      "fixed": "Ji pažvelgė aukštyn į aukštus ąžuolus, kurie šaukė nuo tolimos pergunijos. Iš vakarų, iš už jūros, artėjo didinga juoda audra.",
      "explanation": "         - 'Didingų' ir 'senųjų' – per daug būdvardžių. Pakeista į 'aukštus' (senovės lietuvių kalboje būdvardžiai naudoti retai).         - 'Siūbavo' – modernus žodis. Pakeista į 'šaukė' (senovės lietuvių kalboje 'šaukti' reiškė skambėti, girdėti).         - 'Perkūnijos' -> 'pergunijos' (XIV a. lietuvių kalboje 'perkūnas' buvo dievas, o 'pergunija' – jo garbėjimas).         - 'Nepermaldaujamai' – modernus būdvardis. Pakeista į 'didinga' (senovės lietuvių kalboje 'didinga' reiškė didingą, stulbinantį).         - 'Juoda kaip smala' – metafora, kuri neegzistuotų XIV a. lietuvių kalboje. Pakeista į 'juoda' (paprastas apibūdinimas).       ",
      "confidence": 0.97
    }
  ],
  "all_results": [
    {
      "file": "01_senasis_sernas.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism",
          "original": "Tai buvo paprastas, bet galingas ąžuolinis sostas, kurį savo rankomis padarė dar jo tėvo tėvas.",
          "fixed": "Tai buvo senas, tvirtas ąžuolinis krėslas, kurį padarė jo tėvo tėvas. Medis nusitrynė nuo laiko, bet išliko tvirtas.",
          "explanation": "       'Sostas' yra anachronizmas (XIV a. lietuvių kalboje naudojamas 'krėslas' ar 'sėdynė'). 'Galingas' yra per daug būdvardis. 'Padarė' pakeičiamas į 'padarė' (senesnis laikas), nes tekstas aprašo praeitį. 'Tėvo tėvas' ištaisomas į 'tėvo tėvas' (gramatika), nes XIV a. lietuvių kalba naudojo 'tėvas' (ne 'tėvo tėvas').",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "Jie sako nešantys Jogailos taikos žodį.",
          "fixed": "Jie praneša, kad Jogaila siūlo taikos derybų žodį.",
          "explanation": "       'Pasiuntiniai' ir 'taikos žodis' yra anachronizmai (XIV a. lietuvių kalboje naudojama 'praneša' ir 'derybų žodis'). 'Nešantys' pakeičiamas į 'siūlo' (senesnis ir autentiškesnis veiksmažodis). 'Jogaila' pateikiamas kaip 'Jogaila' (ne 'Jogailos'), nes XIV a. lietuvių kalboje vardai naudojami be priedėlio.",
          "confidence": 0.99
        },
        {
          "type": "grammar",
          "original": "Kiekvienas jų turėjo savo istoriją: kirstas lenkų riterio kirvis prie Liublino, teutonų strėlės drėskis prie Ragainės, senas peilio dūris per broliškas grumtynes jaunystėje.",
          "fixed": "Kiekvienas randas turėjo savo istoriją: lenkų riterio kirvis Liublino mūšyje, teutonų strėlės Ragainės mūšyje, senas peilis broliškoje grumtynėje jaunystėje.",
          "explanation": "       'Kirstas' ir 'drėskis' yra neegzistuojantys XIV a. žodžiai (pakeičiami į 'mūšyje' ir 'grumtynėje'). 'Broliškas' pakeičiamas į 'broliškoje' (linksnis). 'Jaunystėje' pakeičiamas į 'jaunystėje' (linksnis). 'Kirstas' ir 'drėskis' yra modernūs žodžiai, o 'mūšys' ir 'grumtynės' yra autentiškesni.",
          "confidence": 0.97
        },
        {
          "type": "style",
          "original": "Rūkas virš Trakų ežero kvėpavo. Tai nebuvo paprastas rytmetinis garas, kylantis nuo vandens; tai buvo tiršta, balkšva masė, kuri lėtai riko aplink pilies bokštus tarsi gyva, medžiojanti būtybė.",
          "fixed": "Rūkas virš Trakų ežero kyla. Tai ne paprastas rytmetis garas nuo vandens, o tankus, baltas rūkas, kuris lėtai apima pilies bokštus, tarsi gyva būtybė.",
          "explanation": "       'Kvėpavo' ir 'medžiojanti būtybė' yra pertekliniai epitetai (XIV a. tekstai naudojo trumpesnes frazes). 'Tiršta, balkšva masė' pakeičiamas į 'tankus, baltas rūkas' (autentiškesnis aprašymas). 'Tarsi gyva būtybė' pakeičiamas į 'tarsi gyva būtybė' (trumpesnis ir tiesesnis).",
          "confidence": 0.95
        },
        {
          "type": "anachronism",
          "original": "Karas persikėlė iš laukų į menes?",
          "fixed": "Karas persikėlė iš laukų į pilis?",
          "explanation": "       'Menes' yra anachronizmas (XIV a. lietuvių kalboje naudojamas 'pilis' ar 'tvirtovė'). 'Menes' yra modernus žodis, o 'pilis' yra autentiškesnis.",
          "confidence": 0.99
        },
        {
          "type": "anachronism",
          "original": "ar visų tų pamokų pakaks dabar, kai karas persikėlė iš laukų į menes?",
          "fixed": "ar visų tų pamokų pakaks dabar, kai karas persikėlė iš laukų į **miesčius**?",
          "explanation": "'Menes' yra anachronizmas – XIV a. lietuvių kalboje nebuvo žodžio 'menes' reiškiant 'miesčius'. Senovės lietuvių kalboje naudojamos formos kaip 'miestas' arba 'miestai'. 'Persikėlė iš laukų į miestus' yra tinkamesnis variantas.",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "Jogaila. Jo brolio Algirdo sūnus. Jaunas, ambicingas, turintis tą patį šaltą protą kaip ir tėvas, bet papuoštą nauja, svetima elegancija.",
          "fixed": "Jogaila. Algirdo sūnus. Jis turi tą patį šaltą protą kaip ir tėvas, bet jo elgesys yra **neprieinamas** ir **neįprastas** **senovės kunigaikščiams**.",
          "explanation": "1. 'Jaunas' ir 'ambicingas' yra anachronizmai – XIV a. lietuvių kalboje nebuvo tokių žodžių. 2. 'Elegancija' yra anachronizmas – senovės lietuvių kalboje nebuvo to žodžio. 3. Pakeičiamas į konkretesnius, senovės kontekstui tinkamus žodžius ('neprieinamas' ir 'neįprastas').",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Tai buvo naujosios eros įrankiai — diplomatai, kurie žudė sėdėdami prie stalo.",
          "fixed": "Tai buvo **neprieinami** žmonės, kurie **nebuvo kariai**, bet turėjo **svarbų užduotį** – **pateisinti** Jogailos žodžius.",
          "explanation": "1. 'Naujosios eros įrankiai' yra anachronizmas – XIV a. lietuvių kalboje nebuvo tokių metaforinių sąvokų. 2. 'Diplomatai' yra anachronizmas – žodis 'diplomatas' atsirado vėliau. 3. 'Žudė sėdėdami prie stalo' yra metafora, kuri netinka senovės kontekstui. Pakeičiamas į konkretesnį ir tinkamesnį pasakojimą.",
          "confidence": 0.97
        },
        {
          "type": "grammar|style",
          "original": "Jų apsiaustai buvo brangaus rytietiško šilko, nusagstyti sidabrinėmis sagėmis, kurios žvakių šviesoje blizgėjo lyg žuvies žvynai.",
          "fixed": "Jų drabužiai buvo **brangūs** ir **iš brangaus šilko**, **iš rytų atgabenti**, o **sidabrinės sagės** **blizgėjo** **šviesoje** **lyg žvynai**.",
          "explanation": "1. 'Apsiaustai' yra anachronizmas – XIV a. lietuvių kalboje naudojamas žodis 'drabužiai'. 2. 'Rytietiško' yra anachronizmas – reikėtų panaudoti 'iš rytų atgabenti'. 3. Perteklių žodžių ('brangaus rytietiško šilko') ir metaforinių pasakojimų ('lyg žuvies žvynai') pakeičiamas į konkretesnį pasakojimą.",
          "confidence": 0.99
        },
        {
          "type": "anachronism|grammar",
          "original": "Kvepalai iš pačios Bizantijos, — paaiškino pasiuntinys su pasididžiavimu. — Ir aukščiausios kokybės vaškas iš Venecijos jūsų pilies žvakėms, kad naktys Trakuose būtų šviesios kaip dieną.",
          "fixed": "Kvepalai **iš rytų** — **iš Bizantijos** — **brangūs ir saldūs**, — pasakė pasiuntinys. — **Ir švelnūs žvakės medis iš Italijos**, kad **šviesa būtų stipri** **Trakuose**.",
          "explanation": "1. 'Kvepalai iš pačios Bizantijos' yra anachronizmas – XIV a. lietuvių kalboje nebuvo tokių metaforinių sąvokų. 2. 'Aukščiausios kokybės vaškas iš Venecijos' yra anachronizmas – Venecija kaip valstybė nebuvo tokiu žinomu XIV a. pradžioje. 3. 'Kad naktys būtų šviesios kaip dieną' yra metafora, kuri netinka senovės kontekstui. Pakeičiamas į konkretesnį pasakojimą.",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "Kvepalai iš pačios Bizantijos, — paaiškino pasiuntinys su pasididžiavimu. — Ir aukščiausios kokybės vaškas iš Venecijos jūsų pilies žvakėms, kad naktys Trakuose būtų šviesios kaip dieną.",
          "fixed": "Kvepalai iš tolimų kraštų, — paaiškino pasiuntinys su pasididžiavimu. — Ir medinis vaškas iš tolimų žemių jūsų pilies žvakėms, kad naktys Trakuose būtų šviesios kaip diena.",
          "explanation": "         - 'Kvepalai iš Bizantijos' yra anachronizmas, nes XIV a. Bizantija jau buvo silpstanti, o 'kvepalai' kaip žodis būtų neįprastas lietuvių kalboje. Pakeičiau į 'kvepalai iš tolimų kraštų' (neišskirtinai Bizantijos, nes tai būtų pernelyg konkretu).         - 'Aukščiausios kokybės vaškas iš Venecijos' – Venecija XIV a. buvo žinoma, bet 'aukščiausios kokybės' yra modernus būdvardis. Pakeičiau į 'medinis vaškas iš tolimų žemių' (medinis, nes XIV a. žvakės būtų medinės, o 'aukščiausios kokybės' – pernelyg abstraktus).         - 'Šviesios kaip dieną' pakeičiau į 'šviesios kaip diena' (be 'kaip' – XIV a. lietuvių kalba būtų konkretesnė).       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "Šios dovanos buvo tarsi švelnios rankos, kurios glaudžia tavo kaklą prieš jį užverždamos.",
          "fixed": "Šios dovanos buvo kaip užsienietiškos, neprieštaringos, bet neprieinamos.",
          "explanation": "         - 'Švelnios rankos' ir metafora 'glaudžia kaklą' yra pernelyg abstraktūs ir modernūs. XIV a. tekstas būtų konkretesnis.         - Pakeičiau į 'užsienietiškos, neprieštaringos, bet neprieinamos' – tai būtų tinkamesnis aprašymas, nes XIV a. žmonės neapibūdintų daiktus emocingai, o tik konkretiai.       ",
          "confidence": 0.95
        },
        {
          "type": "anglicism",
          "original": "Kai pilies šeimininkas, jis negalėjo parodyti nepasitenkinimo. Svetingumas buvo senesnis įstatymas už bet kokią politiką.",
          "fixed": "Ką galėtų padaryti? Svetingumas buvo seniau už visą politiką.",
          "explanation": "         - 'Kai pilies šeimininkas' – neegzistuojantis XIV a. žodis ('pilies šeimininkas' būtų 'kunigaikštis' arba 'valdovas').         - 'Nepradėti nepasitenkinimo' – neegzistuojantis frazė. Pakeičiau į 'Ką galėtų padaryti?' (konkretesnis klausimas, kuris būtų tinkamas XIV a. kontekstui).         - 'Svetingumas buvo senesnis įstatymas už bet kokią politiką' – pernelyg abstraktus. Pakeičiau į 'Svetingumas buvo seniau už visą politiką' (be 'įstatymas' – XIV a. žmonės neapibūdintų svetingumą kaip įstatymą).       ",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Kęstutis žiūrėjo į šiuos svetimus daiktus ir nieko nesakė. Jo nosį graužė tas saldumas. Vaškas. Kvepalai. Kailiai iš tolimų kraštų. Tai buvo dalykai, kurie nieko nereiškė vyrui, pratusiam prie kraujo, prakaito ir dūmų kvapo. Jie kvepėjo ne Lietuva, ne jos šventaisiais ąžuolais, o kažkuo dirbtinu, kažkuo, kas atėjo iš Vakarų kartu su kalbomis apie 'civilizaciją' ir 'vienintelį tikrąjį dievą'.",
          "fixed": "Kęstutis žiūrėjo į šiuos svetimus daiktus ir nieko nesakė. Jo nosį graužė kvapas. Vaškas, kvepalai, kailiai iš tolimų žemių. Tai buvo dalykai, kurie nebuvo lietuviški. Jis žinojo, kad Lietuva kvepia žemės kvapu, žirgų kailiu, o ne užsienietišku kvapu.",
          "explanation": "         - 'Saldumas' pakeičiau į 'kvapas' (XIV a. žmonės neapibūdintų kvapą kaip 'saldumą').         - 'Kažkuo dirbtinu' ir 'kažkuo, kas atėjo iš Vakarų' – pernelyg abstraktūs. Pakeičiau į 'nebuvo lietuviški' (konkretesnis).         - 'Civilizacija' ir 'vienintelį tikrąjį dievą' – pilnieji anachronizmai. Pakeičiau į 'užsienietišku kvapu' (neapibūdintų religijos, tik konkretų kvapo).         - Ištrinta perteklių metaforų ('kažkuo, kas atėjo kartu su kalbomis').       ",
          "confidence": 0.97
        },
        {
          "type": "grammar",
          "original": "Kailiai — tamsūs, beveik mėlyni savo gilumu, tokie švelnūs, kad atrodė, jog jie gali ištirpti po pirštais.",
          "fixed": "Kailiai — tamsūs, beveik mėlyni, tokie švelnūs, kad atrodė, jog jie gali išslysti po pirštais.",
          "explanation": "         - 'Savo gilumu' – netikras dydis (kailiai negali būti 'gilumi'). Pakeičiau į 'tamsūs, beveik mėlyni' (dydis aprašomas tiesiogiai).         - 'Ištirpti' pakeičiau į 'išslysti' (XIV a. žmonės neapibūdintų kailius kaip 'ištirpantys', o tik kaip 'išslystantys').       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|grammar",
          "original": "— Mano valdovas nuoširdžiai kviečia jus į Vilnių, — pasiuntinys tęsė, atsargiai kramtydamas duoną, tarsi bijotų joje rasti kietą grūdą.",
          "fixed": "— Mano valdovas nuoširdžiai kviečia jus į Vilnių, — pasakė pasiuntinys, atsiėmęs duoną ir atsižvelgdamas į grūdus.",
          "explanation": "         **Anachronizmas**: 'Kviečia' kaip politinis terminas yra anachronizmas (XIV a. būtų naudojama 'kviečia' kaip paprastas žodis, bet ne su 'nuoširdžiai' kaip politiniu kontekstu).         **Gramatika**: 'Kramtydamas' yra per modernus žodis. XIV a. būtų naudojama paprastesnė frazė ('atsiėmęs duoną').         **Stilius**: 'Tarsi bijotų' yra per metaforiškas ir neegzistuojantis XIV a. tekstuose.       ",
          "confidence": 0.95
        },
        {
          "type": "anachronism|style",
          "original": "Jis buvo mažas, vilkintis keistais, margais drabužiais, kurie, atrodo, keitė spalvą priklausomai nuo šviesos.",
          "fixed": "Jis vilkėjo neįprastus, juodai ir raudonai apjuostus drabužius, kurie atrodė kaip išsiverkšti iš tamsos.",
          "explanation": "         **Anachronizmas**: 'Margais drabužiais' ir 'keitė spalvą priklausomai nuo šviesos' yra per modernūs ir neegzistuojantys XIV a. tekstuose.         **Stilius**: 'Keistais' ir 'atrodo' yra per metaforiški. XIV a. tekstuose būtų naudojami konkretesni aprašai (pvz., 'juodai ir raudonai apjuostus').       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "Tai buvo Šešėlių Pardavėjas, jėga, kuri nemėgo atviro karo, bet dievino išdavystę.",
          "fixed": "Tai buvo Šešėlis, kuris nebuvo žmogaus, o tik prarastojo dvasia, kuri miegojo išdavystės šaltiniuose.",
          "explanation": "         **Anachronizmas**: 'Šešėlių Pardavėjas' yra per modernus ir mitologinis terminas. XIV a. tekstuose būtų naudojami paprastesni aprašai (pvz., 'Šešėlis' kaip simbolis).         **Gramatika**: 'Jėga' yra per abstraktus žodis. XIV a. būtų naudojama konkretesnė frazė ('prarastojo dvasia').       ",
          "confidence": 0.97
        },
        {
          "type": "anachronism|style",
          "original": "Ir jis kvepėjo jūra — sūriu vandeniu, jodu ir gintaru.",
          "fixed": "Ir kvepėjo jūros sūri, jodo ir gintaro kvapas, kaip iš senų žuvų ir medžiagos.",
          "explanation": "         **Anachronizmas**: 'Gintaro Karalienė' kaip mitinis konceptas yra anachronizmas. XIV a. būtų naudojami konkretesni aprašai (pvz., 'jūros sūri').         **Stilius**: 'Jūra — sūriu vandeniu' yra per metaforiškas. XIV a. tekstuose būtų naudojami paprastesni aprašai.       ",
          "confidence": 0.99
        },
        {
          "type": "grammar|style",
          "original": "Kęstutis pakėlė savo paprastą medinę taurę. Midus joje buvo tamsus, tirštas, kvepiantis miško medumi.",
          "fixed": "Kęstutis pakėlė medinę taurę, kurioje buvo tamsus, tirštas alus, kvepiantis medumi.",
          "explanation": "         **Gramatika**: 'Paprastą medinę taurę' yra per daug būdvardžių. XIV a. būtų naudojama paprastesnė frazė ('medinė taurė').         **Anachronizmas**: 'Midus' kaip gėrimas yra anachronizmas. XIV a. būtų naudojamas 'alus' ar 'medusinis gėrimas'.         **Stilius**: 'Kvepiantis miško medumi' yra per metaforiškas. XIV a. būtų naudojama paprastesnė frazė ('kvepiantis medumi').       ",
          "confidence": 0.96
        },
        {
          "type": "anachronism|style",
          "original": "as, kad atrodė, jog pilis plūduriuoja danguje. Ir jis kvepėjo jūra — sūriu vandeniu, jodu ir gintaru.",
          "fixed": "pilis stovėjo aukštai, o vėjas nunešė jūros kvapą: sūrių vandenį ir druska.",
          "explanation": "       - **Anachronizmas**: 'plūduriuoja danguje' ir 'jodų/gintaro' aprašymas yra pernelyg detalingas ir modernus. XIV a. tekstuose būtų naudojami **apibūdinimai be konkrečių medžiagų** (pvz., 'kvapas', 'druska').       - **Stilius**: 'jodų' ir 'gintaro' minėjimas yra **pseudomedievalinis** (išvaizdžiai senovinis, bet neegzistuojantis XIV a.). Gintaras buvo vertingas, bet ne aprašytas tokiu detaliu.       - **Ištaisymas**: Pakeistas į **apibūdinimą be konkrečių medžiagų**, kuris būtų įprastas XIV a. tekstuose (pvz., 'kvapas', 'druska').       ",
          "confidence": 0.95
        },
        {
          "type": "anachronism|grammar",
          "original": "Nors Baltijos jūra buvo už šimtų mylių, tą naktį ji buvo čia pat.",
          "fixed": "Nors jūra buvo toli, ši naktį jos kvapas atėjo kaip artimas.",
          "explanation": "       - **Anachronizmas**: 'šimtų mylių' - XIV a. tekstuose būtų naudojami **neapibrėžti atstatai** (pvz., 'tolio', 'toli', 'daug toli').       - **Gramatinė nuoseklumas**: 'Baltijos jūra' - XIV a. lietuviškas tekstas būtų naudojęs **neapibrėžtą 'jūra'** (be pavadinimo), nes tai būtų įprastas žodis, o ne geografinis terminas.       - **Ištaisymas**: Pakeista į **neapibrėžtą aprašymą**, kuris būtų įprastas XIV a. tekstuose.       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|style",
          "original": "Gintaro Karalienė šaukė Kęstutį, bet jis dar nežinojo, kad šis šauksmas yra ne pagalbos prašymas, o atsisveikinimas su amžiumi, kuris jau baigėsi.",
          "fixed": "Gintaro motina šaukė Kęsto, bet jis nepasiklausė, nes žinojo, kad tai ne pagalba, o paskutinis žodis.",
          "explanation": "       - **Anachronizmas**:         1. 'Gintaro Karalienė' - XIV a. tekstuose būtų naudojamas **neapibrėžtas 'gintaro motina'** (neoficialus titulas).         2. 'Kęstutis' - XIV a. lietuviškas tekstas būtų naudojęs **nepilną vardą 'Kęsto'** (nes Kęstutis buvo XV a. valdovas).         3. 'atsisveikinimas su amžiumi' - pernelyg **filosofiškas ir modernus** aprašymas.       - **Stilius**:         - 'ne pagalbos prašymas, o atsisveikinimas su amžiumi' - pernelyg **dramatiškas ir emocinis**.         - XIV a. tekstuose būtų naudojamas **neapibrėžtas 'paskutinis žodis'**.       - **Ištaisymas**:         - Pakeista į **neapibrėžtą aprašymą**, kuris būtų įprastas XIV a. tekstuose.         - 'Gintaro Karalienė' -> 'Gintaro motina' (neoficialus titulas).         - 'Kęstutis' -> 'Kęsto' (nepilnas vardas).         - 'atsisveikinimas su amžiumi' -> 'pasutinis žodis' (neapibrėžtas).       ",
          "confidence": 0.99
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5 | Rasta 5 klaidų, ištaisyta 5 | Rasta 5 klaidų, ištaisyta 5. Tekstas tinkamesnis XIV a. kontekstui. | Rasta 5 klaidų, ištaisyta 5. Tekstas ištaisytas taip, kad atrodytų tikresnis XIV a. lietuvių kalbos ir kultūros kontekste. | Rasta 3 klaidų, ištaisyta 3. Tekstas adaptuotas XIV a. lietuviškosios kalbos stiliui."
    },
    {
      "file": "02_vilko_perspejimas.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism",
          "original": "aštriai krentant šviesai",
          "fixed": "šviesa nykstant",
          "explanation": "XIV a. tekstuose neegzistuojantis frazeologizmas 'krentant šviesai'. Panaudojamas paprastesnis ir realesnis 'šviesa nykstant' – natūralus šviesos nykimas rudenį.",
          "confidence": 0.98
        },
        {
          "type": "grammar",
          "original": "Tai buvo ne tik įrankis žudyti; tai buvo jų giminės tęstinumo simbolis.",
          "fixed": "Tai buvo ne tik įrankis žudyti; tai buvo giminės tęstinumo žymė.",
          "explanation": "XIV a. tekstuose būtų naudojama 'žymė' (santrumpa) vietoj 'simbolis' (anglicizmas). 'Tęstinumo' forma yra neegzistuojanti – panaudojama 'tęstinumo žymė' (konkretesnis ir senovinis žodis).",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Jis lėtai valė metalą švelnaus audinio skiaute, jausdamas kiekvieną įbrėžimą, kiekvieną dantuką, pasakojantį apie susidūrimą su kryžiuočių plienu.",
          "fixed": "Jis lėtai valė metalą švelnia skiaute, jausdamas kiekvieną įbrėžimą, kuris prisiminėdavo kryžiuočių plieno susidūrimus.",
          "explanation": "Per daug metaforinių būdvardžių ('švelnaus audinio') ir perteklių ('pasakojantį'). XIV a. tekstuose būtų naudojama konkretesnė, beveik beveik metaforinė sintaksė. 'Švelnia skiaute' – paprastesnis, o 'prisiminėdavo' – realesnis nei 'pasakojantį'.",
          "confidence": 0.97
        },
        {
          "type": "anglicism",
          "original": "Tai nebuvo tik metalo korozija. Vytautui tai pasirodė kaip ženklas, kaip pati žemė šnabždėtų apie pabaigą.",
          "fixed": "Tai nebuvo tik metalo rūdija. Vytautui tai atrodė kaip žemės pranašavimas – kaip žemė pati praneštų apie pabaigą.",
          "explanation": "Žodis 'šnabždėtų' yra neegzistuojantis XIV a. žodis (anglicizmas). Pakeistas į 'pranašavimas' (senovinis žodis) ir 'praneštų' (realia sintaksė). 'Ženklas' pakeistas į 'pranašavimas' – XIV a. tekstuose būtų naudojama konkretesnė forma.",
          "confidence": 0.99
        },
        {
          "type": "grammar",
          "original": "— Vytautai. — Jis krūptelėjo, bet neatsisuko. Žinojo šį žingsnį — sunkų, bet užtikrintą. Tėvas stovėjo duryse, jo šešėlis nutįso per visą ginklinę, uždengdamas pusę eksponuojamų šarvų.",
          "fixed": "— Vytautai, — pasakė tėvas. Vytautas krūptelėjo, bet neatsisuko. Žinojo šį žingsnį – sunkų, bet užtikrintą. Tėvas stovėjo duryse, o jo šešėlis nutįso per visą ginklinę, uždengdamas pusę šarvų.",
          "explanation": "1. '— Vytautai.' pakeista į '— Vytautai, — pasakė tėvas.' – XIV a. tekstuose būtų naudojama dialogo sintaksė su 'pasakė'. 2. 'eksponuojamų šarvų' pakeista į 'šarvų' – 'eksponuoti' yra anachronizmas (XIV a. būtų naudojama tiesioginė forma).",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "Dokumentas atrodė prastai — jį lietė dešimtys rankų, jis kvepėjo dulkėmis ir pavojaus prakaitu.",
          "fixed": "Dokumentas atrodė senas ir išdžiūvęs — jį perrašė daug rankų, jis kvepėjo pražangomis ir mirties kvapu.",
          "explanation": "       'Dulkės' ir 'prakaitas' yra anachronizmai – XIV a. tekstuose būtų naudojami konkretesni žodžiai, pvz., 'pražangos' (dulkės iš pergamento) ir 'mirties kvapas' (ne 'pavojaus prakaitas'). 'Prakaitas' yra modernus žodis, o 'pražangos' būtų natūralesnis XIV a. tekstui. 'Atrodė prastai' pakeičiamas į 'senas ir išdžiūvęs', nes tai būtų tikresnis aprašymas pergamento būklės.",
          "confidence": 0.98
        },
        {
          "type": "grammar",
          "original": "Jis pažadėjo jiems Žemaitiją. Mūsų širdį, tėve.",
          "fixed": "Jis pažadėjo jiems Žemaitiją. Mūsų širdį, tėve, — tai mūsų kraštas.",
          "explanation": "       'Mūsų širdį' yra neteisingas linksnis – XIV a. tekstuose būtų naudojamas tiesesnis ir konkretesnis aprašymas, pvz., 'mūsų kraštas' ar 'mūsų žemė'. 'Širdį' kaip metafora yra per moderni ir emocingas. 'Tėve' reikėtų atskirti su dvitaškio ir kablelio pagalba, kad tekstas būtų aiškesnis.",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Jis yra sūris spąstuose, o mes dabar esame pelės, uostančios tą saldų vašką.",
          "fixed": "Jis yra sūris spąstuose, o mes dabar esame pelės, kurios uostančios vašką.",
          "explanation": "       'Saldus vaškas' yra per daug metaforiškas ir modernus. XIV a. tekstuose būtų naudojamas tiesesnis aprašymas, pvz., 'vaškas' (be 'saldus'). Metafora 'pelės uostančios vašką' yra per poetinga ir neįprasta istoriniam tekstui. 'Uostančios' pakeičiamas į 'kurios uostančios', kad būtų aiškesnis.",
          "confidence": 0.97
        },
        {
          "type": "anachronism",
          "original": "Net tavo ištikimiausias ginklas pradeda pūti. Metalas jaučia tiesą anksčiau už tave.",
          "fixed": "Net tavo ištikimiausias ginklas pradeda rūgti. Žalvaris jaučia pavojų anksčiau už tave.",
          "explanation": "       'Pūti' ir 'metalas jaučia tiesą' yra anachronizmai. XIV a. tekstuose būtų naudojamas žodis 'rūgti' (aprašyti ginklo rūgstančio metalo), o 'tiesą' būtų pakeičiamas į 'pavojų' (nes 'tiesa' kaip abstraktus pojūtis yra per modernus). 'Žalvaris' būtų natūralesnis nei 'metalas' – XIV a. ginklai būtų daromi iš žalvario ar geležies.",
          "confidence": 0.99
        },
        {
          "type": "anglicism",
          "original": "Tai ne gandai, sūnau. Žmonės mėgsta kalbėti baisumus, kai bijo permainų.",
          "fixed": "Tai ne pranašai, sūnau. Žmonės mėgsta kalbėti baisumus, kai bijo pakeitimo.",
          "explanation": "       'Gandai' yra tiesioginis vertimas iš anglų 'rumors', bet XIV a. lietuvių kalboje būtų naudojamas žodis 'pranašai' (ar 'gandai' kaip 'gandai apie baisumus', bet ne kaip dabartinis žodis). 'Permainų' pakeičiamas į 'pakeitimo', nes 'permainos' yra per modernus žodis. 'Baisumus' yra teisingas, nes tai būtų natūralus XIV a. tekstui.",
          "confidence": 0.95
        },
        {
          "type": "anachronism",
          "original": "— Gerai, — Vytautas galiausiai pasidavė, pajutęs šaltą gumulą gerklėje.",
          "fixed": "— Gerai, — Vytautas galiausiai pasidavė, pajutęs širdies smūgį.",
          "explanation": "'Gumulas' yra anachronizmas, nes XIV a. būtų naudojamas tradicinis žodis 'širdies smūgis' ar 'širdies smūgis'. 'Gumulas' yra žodis iš naujesnių laikų.",
          "confidence": 0.95
        },
        {
          "type": "style",
          "original": "Pasaulis tau atrodo per tamsus.",
          "fixed": "Pasaulis tau tamsus.",
          "explanation": "Pertekliavimas: 'atrodo per tamsus' yra per daug būdvardžių ir pertekliavimas. XIV a. tekstas būtų trumpesnis ir tiesesnis.",
          "confidence": 0.98
        },
        {
          "type": "anglicism",
          "original": "Mes būsime pasiruošę viskam.",
          "fixed": "Mes būsime pasiruošę visiems grėsmiams.",
          "explanation": "'Pasiruošę viskam' yra pertekliavimas ir neteisingas vertimas iš anglų kalbos. XIV a. būtų naudojamas tradicinis žodis 'pasiruošę visiems grėsmiams'.",
          "confidence": 0.99
        },
        {
          "type": "grammar",
          "original": "— Mes važiuojame į Vilnių, — tarė jis tyliai, beveik šnabždėdamas.",
          "fixed": "— Rytoj važiuosime į Vilnių, — tarė jis tyliai, beveik šnabždėdamas.",
          "explanation": "XIV a. lietuvių kalba būtų naudojama tiesioginė kalba, be būsimojo laiko ('važiuosime' pakeičiamas į 'važiuosime').",
          "confidence": 0.97
        },
        {
          "type": "style",
          "original": "Tai nebuvo nugalėto žmogaus žvilgsnis, tai buvo žmogaus, kuris nusprendė eiti iki galo, kad ir kas nutiktų.",
          "fixed": "Tai nebuvo nugalėto žmogaus žvilgsnis, tai buvo žmogaus, kuris nusprendė eiti iki galo, jei tik būtų reikia.",
          "explanation": "Pertekliavimas ir per daug emocinių žodžių. XIV a. tekstas būtų trumpesnis ir nepertekliavęs.",
          "confidence": 0.99
        },
        {
          "type": "grammar|style",
          "original": "stovėjo tamsoje ir klausėsi tėvo žingsnių, kurie Aidėjo koridoriumi, kol visai išnyko.",
          "fixed": "stovėjo tamsumoje ir klausėsi tėvo žingsnių, kurie klausėsi koridoriuje, kol visai išnyko.",
          "explanation": "       1. **Grammatinė klaida**: 'Aidėjo' yra neegzistuojantis XIV a. žodis (pvz., 'klausėsi' ar 'skambėjo' būtų tinkamesnis).       2. **Stilius**: 'tamsoje' pakeičiamas į 'tamsumoje' (senovės lietuvių kalboje dažniau naudojamas 'umo' ar 'umoje' – pavyzdžiui, 'tamsumoje' ar 'tamsumoje').       ",
          "confidence": 0.95
        },
        {
          "type": "anachronism|grammar",
          "original": "Jis paėmė aštrų galąstuvą ir pradėjo trinti metalą su baisiu įniršiu.",
          "fixed": "Jis paėmė aštrų akmenį ir pradėjo trinti geležį su dideliu pykčiu.",
          "explanation": "       1. **Anachronizmas**: 'galąstuvą' – XIV a. lietuvių kalboje neegzistuojantis žodis (pvz., 'akmenį' ar 'grindį' būtų tinkamesnis).       2. **Grammatinė klaida**: 'metalą' pakeičiamas į 'geležį' (XIV a. lietuvių kalboje 'metalas' neegzistuojantis žodis, o geležis buvo dažniausiai naudojamas).       3. **Stilius**: 'baisiu įniršiu' pakeičiamas į 'dideliu pykčiu' (senovės lietuvių kalboje dažniau naudojami 'pykčius', 'pyktis' ar 'pyktis').       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "Ir kartais vienintelis būdas išgelbėti girios medį yra nukirsti tą šaką, kuri jau nebežaliuoja, kad ir kaip būtų sunku paleisti tai, kas tau brangu.",
          "fixed": "Ir kartais vienintelis būdas išgelbėti medį yra nukirsti šaką, kuri jau nebežaliuoja, nes sunku atiduoti tai, kas tau brangu.",
          "explanation": "       1. **Anachronizmas**: 'girios medį' – 'girios' kaip žodis XIV a. lietuvių kalboje neegzistuojantis (pvz., 'medį' ar 'medžį').       2. **Grammatinė klaida**: 'kad ir kaip būtų' pakeičiamas į 'nes' (senovės lietuvių kalboje dažniau naudojamas 'nes' ar 'nesi').       3. **Stilius**: 'brangu' pakeičiamas į 'brangų' (XIV a. lietuvių kalboje 'brangus' būtų tinkamesnis).       ",
          "confidence": 0.97
        },
        {
          "type": "anachronism|style",
          "original": "Tą naktį Vytautas nemiegojo. Jis sėdėjo prie siauro lango ir žiūrėjo į mišką, kuris ošė keista, svetima kalba.",
          "fixed": "Tą naktį Vytautas nepasimiegojo. Jis sėdėjo prie siauro lango ir klausėsi miško, kuris skambėjo nepažįstama kalba.",
          "explanation": "       1. **Anachronizmas**: 'nemiegojo' pakeičiamas į 'nepasimiegojo' (XIV a. lietuvių kalboje 'miegoti' buvo 'miegoti', o 'nepasimiegoti' būtų tinkamesnis).       2. **Stilius**: 'ošė' pakeičiamas į 'skambėjo' (XIV a. lietuvių kalboje 'ošė' neegzistuojantis žodis, o 'skambėjo' būtų tinkamesnis).       3. 'keista, svetima kalba' pakeičiamas į 'nepažįstama kalba' (senovės lietuvių kalboje 'nepažįstama' būtų tinkamesnis).       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Medžiai siūbavo vėjyje, o jų šešėliai ant sniego atrodė kaip kariai, tyliai žygiuojantys link pilies sienų.",
          "fixed": "Medžiai šaukė vėjyje, o jų šešėliai ant sniego atrodė kaip kariai, klausęsi link pilies sienų.",
          "explanation": "       1. **Anachronizmas**: 'siūbavo' pakeičiamas į 'šaukė' (XIV a. lietuvių kalboje 'siūbėti' neegzistuojantis žodis, o 'šaukti' būtų tinkamesnis).       2. **Stilius**: 'tyliai žygiuojantys' pakeičiamas į 'klausęsi' (senovės lietuvių kalboje 'klausėsi' būtų tinkamesnis, nes 'tyliai žygiuoti' yra per metaforiškas ir neegzistuojantis XIV a.).       ",
          "confidence": 0.98
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5. Tekstas ištaisytas pagal XIV a. kalbos normas, pašalinant anachronizmus, anglizmus ir perteklius. | Rasta 5 klaidų, ištaisyta 5. Tekstas ištaisytas taip, kad atitiktų XIV a. stilistiką, gramatiką ir terminologiją. | Rasta 5 klaidų, ištaisyta 5 | Rasta 5 klaidų, ištaisyta 5"
    },
    {
      "file": "07_tylos_puota.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism|grammar|style",
          "original": "Jogaila sėdėjo didžiojoje menėje prie stalo, kuris buvo nuklotas geriausiais įmanomais patiekalais. Kepti šernai, įdaryti miško uogomis, marinuoti lydekos iš giliausių ežerų, brangiausias vynas, atvežtas iš tolimų vakarų kraštų — viskas buvo čia, spindėjo po šimtų vaškinių žvakių šviesa.",
          "fixed": "Jogaila sėdėjo didžiojoje menėje prie stalo, kuris buvo nuklotas geriausiais patiekalais. Kepti šernai, įdaryti miško uogomis, lydekos iš giliausių ežerų, vynas iš tolimų kraštų — viskas buvo čia, šviesą leido šimtų vaškinių žvakių šviesa.",
          "explanation": "         - Ištrintas 'įmanomais' (per modernus būdvardis).         - 'Marinuoti' pakeistas į 'lydekos' (XIV a. tekstuose naudojamas tiesesnis 'lydekos' – neegzistuojantis terminas 'marinuoti').         - 'Brangiausias vynas' pakeistas į 'vynas' (per daug būdvardžių).         - 'Šviesa' išlaikoma, bet pakeistas sintaksė, kad būtų tiksliau XIV a. stiliumi (ne 'spindėjo po').       ",
          "confidence": 0.95
        },
        {
          "type": "anachronism|grammar",
          "original": "Skirgaila stebėjo tai be jokios emocijos, savo užrašų knygelėje žymėdamas kiekvieną sėkmingą susitvarkymą kaip paprastą administracinę užduotį.",
          "fixed": "Skirgaila stebėjo tai be jokių jausmų, užrašydamas savo knygelėje kiekvieną sėkmingą veiklą kaip paprastą darbą.",
          "explanation": "         - 'Administracinė užduotis' pakeista į 'darbą' (XIV a. tekstuose neegzistuojantis terminas 'administracinė').         - 'Užrašų knygelė' pakeista į 'knygelė' (tiesesnis žodis).         - 'Susitvarkymas' pakeistas į 'veiklą' (tiesesnis kontekstas).       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|style",
          "original": "Tai nebuvo didvyriškas karas; tai buvo sistemingas, kliniškas 'senosios mėsos' šalinimas.",
          "fixed": "Tai nebuvo didvyriškas karas; tai buvo sistemingas žmonių išnaikinimas.",
          "explanation": "         - 'Kliniškas' ir 'senosios mėsos' yra anachronizmai (neegzistuojantis terminas 'kliniškas' ir neegzistuojantis žodžių junginys 'senosios mėsos').         - Pakeistas į tiesesnį XIV a. kontekstą ('žmonių išnaikinimas').       ",
          "confidence": 0.99
        },
        {
          "type": "grammar|style",
          "original": "Jis nesiųsdavo karių į atvirą, garbingą mūšį. Ne, jis siuntė specialiai paruoštus žudikus į kareivines, kur poilsio po ilgos kelionės atgulė Kęstučio lojalistai.",
          "fixed": "Jis neleido kariams eiti į atvirą mūšį. Ne, jis siuntė žudikus į kareivines, kur poilsio po ilgos kelionės atgulę Kęstučio sekėtojai.",
          "explanation": "         - 'Nesiųsdavo' pakeista į 'neleido' (tiesesnis XIV a. stilus).         - 'Garbingą mūšį' pakeista į 'atvirą mūšį' (tiesesnis kontekstas).         - 'Lojalistai' pakeista į 'sekėtojai' (tiesesnis XIV a. terminas).         - 'Žudikus' išlaikomas, bet sintaksė pakeista, kad būtų tiksliau.       ",
          "confidence": 0.97
        },
        {
          "type": "anachronism|style",
          "original": "Tai buvo ženklas — jo žmogiškumas traukėsi, užleisdamas vietą tam tamsiam, negailestingam pavidalui, kurį kantriai maitino Šešėlių Pardavėjas.",
          "fixed": "Tai buvo ženklas — jo žmogiškumas traukėsi, užleisdamas vietą tam tamsiam, negailestingam pavidalui, kurį kantriai maitino Dievas.",
          "explanation": "         - 'Šešėlių Pardavėjas' yra anachronizmas (neegzistuojantis XIV a. mitas).         - Pakeistas į 'Dievas' (tiesesnis kontekstas).       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism",
          "original": "kiekviena pralieta kraujo auka buvo tarsi „sumokėta moneta“ į Auksinio Smauglio skrynią.",
          "fixed": "kiekviena pralieta kraujo auka buvo tarsi įdėta į Auksinio Smauglio skrynią.",
          "explanation": "'Auksinio Smauglio' yra anachronizmas – tai yra žinomas iš vėlesnių legendų (pvz., 'Hobbit' bei Tolkieno mitologijos), o XIV a. lietuvių tekstuose būtų naudojami tradiciniai žodžiai kaip 'Auksinis Amulelis' arba 'Auksinė Skrynia' (jei reikėtų pabrėžti vertybę). 'Sumokėta moneta' yra tiesioginis anglų kalbos vertimas ('paid in blood'), o XIV a. būtų naudojama metafora kaip 'kraujo atlygis' ar 'kraujo mokestis'.",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "Miestas, kuris tūkstančius metų buvo saugumo ir protėvių garbės simbolis, po truputį virto didžiuliais, prabangiais mirties namais.",
          "fixed": "Miestas, kuris amžiais buvo saugumo ir protėvių garbės simbolis, po truputį virto mirties namais.",
          "explanation": "'Prabangiai' yra anachronizmas – XIV a. tekstas būtų naudojęs nešvarų, senų žodžių ('nusidėvėjęs', 'nusidrėkęs', 'nusidūręs'). 'Didžiuliai' yra pertekintas būdvardis, o 'prabangiai' – vėlesnis terminas, nesusijęs su XIV a. kalba. Pakeitimas į 'mirties namai' palieka metaforą, bet atitinka senovės kalbos stilių.",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Jogaila galiausiai pradėjo kalbėtis su neegzistuojančiais svečiais, kilnodamas taurę už „naująją, didingą Lietuvą“, kol jo balsas galutinai nuskendo vienuolio giesmėje.",
          "fixed": "Jogaila galiausiai pakilo ir kilnodamas taurę už 'Lietuvą', kol jo balsas nuskendo vienuolio giesmėje.",
          "explanation": "'Naująją, didingą Lietuvą' yra pertekintas ir anachronizmas – XIV a. tekstas būtų naudojęs trumpesnį, nešvaresnį pavadinimą ('Lietuvą' ar 'Lietuvos žemę'). 'Neegzistuojančiais svečiais' yra pertekintas epitetas, nes XIV a. būtų naudojama metafora kaip 'fantasmagorinės figūros' arba 'sielos vaizdai'. 'Kilnodamas taurę' yra teisinga, bet 'naująją, didingą' yra pertekintas.",
          "confidence": 0.97
        },
        {
          "type": "anachronism",
          "original": "Vilnius nebebuvo žmonių miestas; jis tapo idėjų, pasirašytų krauju, lauku.",
          "fixed": "Vilnius nebebuvo žmonių miestas; jis tapo kraujo ir sielų lauku.",
          "explanation": "'Idėjų, pasirašytų krauju' yra anachronizmas – XIV a. būtų naudojama metafora kaip 'kraujo ir sielų laukas' (pvz., 'kraujo žemė', 'sielų žemė'). 'Idėjų' terminas yra vėlesnis, susijęs su renesansu ir humanizmu. 'Lauku' yra teisinga, bet 'pasirašytų krauju' yra neegzistuojantis XIV a. žodžių junginys.",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Jogaila klausėsi tos giesmės ir pajuto, kaip jo šešėlis ant sienos pamažu pradeda judėti savarankiškai, tarsi norėdamas atsiskirti nuo jo drebančio kūno. Tai buvo ženklas — jo žmogiškumas traukėsi, užleisdamas vietą tam tamsiam, negailestingam pavidalui, kurį kantriai maitino Šešėlių Pardavėjas.",
          "fixed": "Jogaila klausėsi giesmės ir pajuto, kaip jo šešėlis ant sienos pamažu pradėjo judėti, tarsi atsiskiręs nuo jo kūno. Tai buvo ženklas – žmogiškumas traukėsi, palikdamas vietą tamsiai, kurią maitino Šešėlių Tėvas.",
          "explanation": "'Savarankiškai' ir 'kantriai' yra pertekinti būdvardžiai, nes XIV a. tekstas būtų naudojęs trumpesnes metaforas ('atsiskiręs', 'palikdamas vietą'). 'Negailestingam pavidalui' yra pertekintas epitetas – būtų teisingesnis 'tamsiai' ar 'nežmogiškai'. 'Šešėlių Pardavėjas' yra anachronizmas – XIV a. būtų naudojamas tradicinis žodis kaip 'Šešėlių Tėvas' ar 'Tamsos Valdytojas'.",
          "confidence": 0.98
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5 | Rasta 5 klaidų, ištaisyta 5. Pagrindiniai problemų tipai: anachronizmai (3), pertekintas stilius (2). Tekstas adaptuotas XIV a. lietuvių kalbos stiliui."
    },
    {
      "file": "08_krevos_pozemiai.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism",
          "original": "Jos sienos buvo neįtikėtinai storos, išmūrytos iš didžiulių, pilkų ir šaltų akmenų, kurie, atrodo, siurbė bet kokią šviesą ir viltį iš bet ko, kas išdrįsdavo įžengti į jos vidų.",
          "fixed": "Sienos buvo labai storos, išmūrytos iš didelių akmenų, kurie neleido šviesai ir vilties į pilį.",
          "explanation": "       **Anachronizmas**: 'neįtikėtinai' ir 'siurbė' yra per modernūs žodžiai. XIV a. tekstas turėtų būti praktiškesnis, be retorinių būdvardžių. 'Siurbė' yra anglizmo paveiktas žodis ('absorb'). Pakeičiamas į 'neleido šviesai' – paprastesnis ir tinkamesnis XIV a. kontekstui.       ",
          "confidence": 0.98
        },
        {
          "type": "grammar",
          "original": "Kęstutis sėdėjo savo kameroje, kuri jam, pratusiam prie begalinių horizontų, atrodė mažesnė už vilko guolį.",
          "fixed": "Kęstutis sėdėjo savo patalpoje, kuri jam, pratusiam laukinėms žemėms, atrodė mažesnė už vilko guolį.",
          "explanation": "       **Grammatika/Anachronizmas**:       - 'Kamero' XIV a. lietuviškas tekstas neįvardintų (neegzistuojantis žodis). Pakeičiamas į 'patalpa' (paprastesnis ir tinkamesnis).       - 'Begalinių horizontų' – neegzistuojantis žodis. Pakeičiamas į 'laukinės žemės' (paprastesnis ir tinkamesnis XIV a. kontekstui).       ",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Kęstutis sėdėjo savo kameroje, kuri jam, pratusiam prie begalinių horizontų, atrodė mažesnė už vilko guolį. Jo gigantiškas, randa is nusėtas kūnas, kuris dešimtmečius nešiojo sunkius grandininius šarvus ir jojo per lygumas, čia keistai susitraukė.",
          "fixed": "Kęstutis sėdėjo savo patalpoje. Jo kūnas, kuris dešimtmečius nešė sunkius šarvus ir jojo per žemes, čia susitraukė.",
          "explanation": "       **Stilius**:       - Ištrintas per daug būdvardžių ('gigantiškas', 'begaliniai') ir perteklinumas.       - 'Randa is nusėtas' – netikslus linksnis ir neegzistuojantis žodis. Pakeičiamas į 'nešė' (paprastesnis ir tinkamesnis).       - 'Grandininius šarvus' – XIV a. tekstas neįvardintų tokio terminų. Pakeičiamas į 'sunkius šarvus'.       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism",
          "original": "Vytautas buvo užrakintas kitoje sienos pusėje, visiškai atskirtas nuo tėvo. Jie negalėjo vienas kito matyti, bet jų balsai — prislopinti, iškraipyti akmens aido ir drėgmės — karts nuo karto pasiekdavo vienas kitą per ventiliacijos angas ir siaurus plyšius tarp grubiai aptašytų blokų.",
          "fixed": "Vytautas buvo uždarytas kitoje patalpoje, atskirtas nuo tėvo. Jie negalėjo vienas kito matyti, bet jų balsai, prislopinti akmens ir drėgmės, karts nuo karto pasiekdavo vienas kitą per plyšius tarp akmenų.",
          "explanation": "       **Anachronizmai**:       - 'Ventiliacijos angos' – neegzistuojantis XIV a. terminas. Pakeičiamas į 'plyšius tarp akmenų'.       - 'Aptašyti blokai' – neegzistuojantis žodis. Pakeičiamas į 'akmenys'.       - 'Iškraipyti akmens aidas' – neegzistuojantis žodis. Pakeičiamas į 'prislopinti akmens ir drėgmės'.       ",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Vytis šioje tamsoje ne blėso, o priešingai — darėsi vis aštresnis, ryškesnis ir pavojingesnis. Visos jo iliuzijos apie giminės šventumą dingo tą pačią akimirką, kai už jų nugarų nukrito Vilniaus grotas. Dabar jame gyveno tik vienas, visa apimantis jausmas — šaltas, apskaičiuotas ir negailestingas keršto noras.",
          "fixed": "Vytis šioje tamsoje neprarado jėgų, o tapo aštresnis. Jo nuomonės apie giminės garbę dingo, kai Vilniaus pilis nukrito. Dabar jame vyravo vienas jausmas — keršto troškimas.",
          "explanation": "       **Stilius**:       - Ištrintas per daug būdvardžių ('aštresnis', 'ryškesnis', 'pavojingesnis', 'apskaičiuotas', 'negailestingas').       - 'Iliuzijos' – neegzistuojantis XIV a. žodis. Pakeičiamas į 'nuomonės'.       - 'Nukrito Vilniaus grotas' – neegzistuojantis žodis. Pakeičiamas į 'nukrito Vilniaus pilis'.       - 'Visa apimantis jausmas' – per retorinis. Pakeičiamas į 'vyravo vienas jausmas'.       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|style",
          "original": "Kęstučio pasakojimai po požemio skliautais skambėjo ne kaip prisiminimai apie praeitį, o kaip galutinis ir skausmingas atsisveikinimas. Jis kalbėjo apie savo jaunystės žygius, apie dainas prie laužų po žvaigždėtu dangumi, apie laiką, kai Lietuva buvo vientisa pagoniška ašis, kuriai nereikėjo jokių svetimų dievų ar auksinių karūnų.",
          "fixed": "Kęstutis pasakojo po žemės skliautų, ir jo žodžiai nebuvo kaip senovės prisiminimai, o kaip paskutinis, skausmingas atsisveikinimas su gyvenimu. Jis kalbėjo apie jaunystės žygius, apie dainas prie ugnies, kai dangus buvo žvaigždėtas, ir apie laiką, kai Lietuva buvo vieninga, nes turėjo savo dievus, o ne svetimus karalių karūnas.",
          "explanation": "       - **Anachronizmas**: 'laužai' (modernus žodis) pakeistas į 'ugnies' (senovės lietuvių kalbos terminas už kampų).       - **Stilius**: 'galutinis ir skausmingas atsisveikinimas' per modernu, pakeistas į 'paskutinis, skausmingas atsisveikinimas su gyvenimu' (panašesnis į XIV a. kalbą).       - **Terminai**: 'pagoniška ašis' ir 'auksinės karūnų' pakeisti į 'savo dievus' ir 'karalių karūnas' (senovės lietuvių kalbos kontekste karūnos buvo simbolis valdžios, o ne dievų).       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|style",
          "original": "Šioje kameroje tos istorijos buvo vienintelė jo apsauga nuo slegiančios, viską ryjančios pilkumos.",
          "fixed": "Šiame žemės mūro patalpoje jo istorijos buvo vienintelė apsauga nuo slegiančios pilkumos, kuri viską užlieja.",
          "explanation": "       - **Anachronizmas**: 'kamera' (modernus žodis) pakeistas į 'žemės mūro patalpa' (XIV a. pilies konstrukcija).       - **Stilius**: 'viską ryjančios pilkumos' per metaforiškas, pakeistas į 'kuris viską užlieja' (panašesnis į senovės lietuvių kalbos poeziją).       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|grammar",
          "original": "Vytautas dažniausiai nieko neatsakydavo. Jis tiesiog sėdėdavo tamsoje, pakišęs ranką į gilią savo apsiausto kišenę, kur rado mažą gintaro gabalėlį — motinos Birutės atsisveikinimo dovaną. Tamsoje gintaras skleidė vos matomą, neįtikėtinai šiltą šviesą, tarsi jame būtų amžiams uždarytas paskutinis Trakų saulėlydis.",
          "fixed": "Vytautas dažniausiai nieko neatsakydavo. Jis tik sėdėjo tamsoje, įsikišęs ranką į savo drabužių kišenę ir išsitraukęs mažą akmenuką — motinos Birutės paskutinio atsisveikinimo dovaną. Tamsoje akmenukas skleidė vos matomą šviesą, tarsi jame būtų uždaryta paskutinė Trakų saulė.",
          "explanation": "       - **Anachronizmas**: 'gintaras' (XIV a. lietuvių kalboje nebuvo tokio terminų, o akmenys buvo žinomi kaip 'akmenukai' arba 'gintaras' buvo retas ir vertingas, bet ne kaip dovanos simbolis). Pakeistas į 'akmenuką'.       - **Anachronizmas**: 'apsiaustas' (modernus žodis) pakeistas į 'drabužiai' (XIV a. lietuvių kalboje).       - **Grammatika**: 'neįtikėtinai šiltą šviesą' per modernu, pakeista į 'šviesą' (senovės lietuvių kalboje pojūčiai buvo apibūdinami paprastai).       - **Anachronizmas**: 'saulėlydis' kaip poezija pakeistas į 'saulė' (senovės lietuvių kalboje saulė buvo dievybė, o ne metafora).       ",
          "confidence": 0.97
        },
        {
          "type": "anachronism|style",
          "original": "Krėva buvo vieta, kur baigėsi visi keliai ir visos svajonės. Čia kvepėjo senu ledu, drėgnu akmeniu ir lėtai pūvančiais šiaudais. Laikas čia ištįso, virsdamas į nesibaigiančią pilką masę, kurioje mirtis atrodė ne kaip pabaiga, o kaip vienintelis įmanomas išsivadavimas iš šio akmeninio narvo.",
          "fixed": "Krėva buvo vieta, kur baigėsi visi keliai ir visos svajonės. Čia kvepėjo senas ledas, drėgnas akmuo ir šiaudai. Laikas čia sustojo, virsdamas į pilką, nesibaigiančią tamsą, kur mirtis atrodė ne kaip pabaiga, o kaip vienintelis išsivadavimas iš šio akmeninio narvo.",
          "explanation": "       - **Anachronizmas**: 'svajonės' (modernus žodis) pakeistas į 'svajonės' (senovės lietuvių kalboje buvo žinomi 'sapnai' ar 'galvos vaizdai').       - **Stilius**: 'nesibaigiančią pilką masę' per metaforiškas, pakeista į 'pilką, nesibaigiančią tamsą' (panašesnis į XIV a. kalbą).       - **Stilius**: 'išsivadavimas iš šio akmeninio narvo' per modernu, pakeista į 'išsivadavimas iš šio narvo' (senovės lietuvių kalboje narvas buvo žinomi kaip 'kaliniai' ar 'kalėjimas').       ",
          "confidence": 0.95
        },
        {
          "type": "style",
          "original": "Jie tiesiog laukė, ir kiekvienas lašas, nusiritantis nuo skliautų, garsiai pranešė, kad jų laikas po šia saule pamažu, bet visiškai nepermaldaujamai baigiasi. Miškas už sienų ošė, šaukdamas savo kunigaikščius, bet gilaus požemio tamsa jokių atsakymų nedavė.",
          "fixed": "Jie tik laukė. Kiekvienas lašas, nusiritęs nuo skliautų, pranešė, kad jų laikas šioje saule baigiasi. Miškas už sienų ošė, šaukdamas savo kunigaikščius, bet tamsa nieko neatsakė.",
          "explanation": "       - **Stilius**: 'garsiai pranešė' per modernu, pakeista į 'pranešė' (senovės lietuvių kalboje pranešimai buvo paprastesni).       - **Stilius**: 'pamažu, bet visiškai nepermaldaujamai' per perteklinis, pakeista į 'baigiasi' (senovės lietuvių kalboje laikui baigti buvo sakoma tiesiogiai).       - **Stilius**: 'ošė, šaukdamas' per metaforiškas, pakeista į 'ošė' (senovės lietuvių kalboje šaukimas buvo paprastesnis).       ",
          "confidence": 0.98
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5. Tekstas tampa tinkamesnis XIV a. kontekstui: ištrinti anachronizmai, per daug būdvardžių, paprastesnis stilius. | Rasta 5 klaidų, ištaisyta 5. Tekstas adaptuotas XIV a. lietuvių kalbos kontekstui, panaikinus anachronizmus, anglizmus ir per modernų stilų."
    },
    {
      "file": "09_paskutine_giesme.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism",
          "original": "Tai nebebuvo ta rami tyla, kurią jis mylėjo savo miškuose po medžioklės; tai buvo slegianti, spengianti ir laukianti nebuvimas garsų, primenantis Tylos Puotą Vilniaus pilyje.",
          "fixed": "Tai nebebuvo ta tyla, kurią jis mylėjo miškuose po medžioklės; tai buvo slegianti, laukianti tyla, primenanti Tylos Puotą Vilniaus pilyje.",
          "explanation": "Anachronizmas: 'nebuvimas garsų' - neteisingas XIV a. terminas. 'Tylos Puota' - neegzistuojantis XIV a. terminas (neišlikęs šaltiniuose). 'Spengianti' - perteklių būdvardis. 'Medžioklė' - galima pakeisti į 'medžioklės žygis' arba ištrinti, nes XIV a. žodis 'medžioklė' buvo žinomas, bet kontekste galima paprastinti.",
          "confidence": 0.95
        },
        {
          "type": "anachronism",
          "original": "— Skirgaila ir Jogaila siunčia jums savo... paskutinius sveikinimus, — tarė vyriausiasis iš jų. Jo lietuvių kalba buvo baisi, iškraipyta stipraus akcento, bet prasmė buvo aiškesnė už dieną.",
          "fixed": "— Skirgaila ir Jogaila siunčia jums savo... paskutinius žodžius, — tarė vyriausiasis iš jų. Jo lietuvių kalba buvo iškraipyta stipraus akcento, bet prasmė buvo aiškesnė už dieną.",
          "explanation": "Anachronizmas: 'sveikinimus' - XIV a. nebuvo žinomas šis terminas. 'Baisi' - perteklių būdvardis. 'Aiškesnė už dieną' - neteisingas lyginimas (diena - neegzistuojantis kontekstas).",
          "confidence": 0.98
        },
        {
          "type": "anachronism|style",
          "original": "Jie buvo čia ne kovoti, o atlikti darbą, už kurį sumokėta auksiniu pažadu.",
          "fixed": "Jie buvo čia ne kovoti, o atlikti užsakytą darbą, už kurį sumokėta auksu.",
          "explanation": "Anachronizmas: 'pažadus' - XIV a. žodis 'pažadas' buvo žinomas, bet 'auksinis pažadas' yra perteklių metafora. 'Darbą' - galima pakeisti į 'užsakytą darbą', nes XIV a. žodis 'darbas' buvo žinomas, bet 'pažadas' buvo reikšmingesnis kontekste. 'Auksiniu' - galima pakeisti į 'auksu', nes 'auksinis' yra anachronizmas.",
          "confidence": 0.97
        },
        {
          "type": "anachronism|grammar",
          "original": "Tai nebuvo lietuviai; jų veidai, apšviesti vienišo deglo, išdavė slaviškus bruožus. Samdiniai iš Rusios žemių. Žmonės be sielos, be tėvynės ir be vardų — tik aštrios rankos ir šalti, sistemingi judesiai.",
          "fixed": "Tai nebuvo lietuviai; jų veidai, apšviesti vieno deglo, rodė slaviškus bruožus. Rusios žmonės, samdiniai. Žmonės be sielos, be tėvynės ir be vardų — tik aštrios rankos ir šalti judesiai.",
          "explanation": "Anachronizmas: 'sistemingi' - XIV a. nebuvo žinomas šis terminas. 'Deglo' - galima pakeisti į 'deglo' (nebe 'vienišo deglo', nes tai perteklių). 'Išdavė' - galima pakeisti į 'rodė', nes 'išdavė' yra anachronizmas. 'Rusios žemių' - galima pakeisti į 'Rusios žmonės', nes 'žemės' yra perteklių. 'Bevardžiai' - galima pakeisti į 'bevardžiai' (jei reikia), bet kontekste 'bevardai' yra tinkamesnis.",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "— Jie ateis vėliau, kunigaikšti. Pažiūrėti į tai, kas iš jūsų liks. O dabar — laikas mokėti skolą.",
          "fixed": "— Jie ateis vėliau, kunigaikščiui. Pažiūrėti, kas iš jūsų liks. Dabar laikas mokėti skolą.",
          "explanation": "Anachronizmas: 'kunigaikšti' - XIV a. galima panaudoti 'kunigaikščiui' (vardininkas). 'Laikas mokėti skolą' - galima pakeisti į 'dabar laikas mokėti skolą', nes 'laikas' yra perteklių. 'Pažiūrėti į tai' - galima pakeisti į 'pažiūrėti, kas liks', nes 'pažiūrėti į tai' yra perteklių.",
          "confidence": 0.96
        },
        {
          "type": "anachronism|style",
          "original": "Tai nebuvo paprasta grandinė. Ji buvo sunki, nušlifuota ir baugiai blizganti deglo šviesoje. Auksinė grandinė. To paties auksas, kuris kvepėjo Jogailos pasiuntinių dovanomis.",
          "fixed": "Tai ne paprasta grandinė. Ji buvo sunkia, išmesta ir šviesiai blizganti ugnies šviesoje. Ta pati auksinė grandinė, kurią Jogailos pasiuntiniai nešė kaip dovaną.",
          "explanation": "       1. **Anachronizmas**: 'deglo šviesoje' - XIV a. būtų naudotas 'ugnies šviesoje' (ne 'deglo').       2. **Stilius**: 'baugiai blizganti' ir 'kvepėjo' yra per daug emociniai būdvardžiai. XIV a. tekstai būtų naudoję konkretesnius apibūdinimus ('išmesta' už 'nušlifuota').       3. 'Kvepėjo Jogailos pasiuntinių dovanomis' - per modernus ir metaforiškas. XIV a. būtų pateiktas konkretus faktas ('nešė kaip dovaną').       ",
          "confidence": 0.98
        },
        {
          "type": "grammar|style",
          "original": "— Specialus užsakymas iš pačios Krokuvos, — sušnibždėjo samdinys, vynioti grandinę aplink Kęstučio kaklą. — Ponai lenkai nori, kad viskas būtų... tinkama jūsų rangui. Aristokratiškas galas.",
          "fixed": "— Šis užsakymas iš Krokuvos, — pasakė samdinys, pritaikydamas grandinę Kęstučio kaklui. — Lenkai norėjo, kad ji būtų tinkama jūsų garbei. Tai aukso grandinė.",
          "explanation": "       1. **Gramatika**: 'vynioti' - neegzistuojantis XIV a. žodis. Būtų naudotas 'pritaikydamas' arba 'sukabindamas'.       2. **Anachronizmas**: 'tinkama jūsų rangui' - 'tinkama' yra anglizmas. XIV a. būtų naudotas 'tinkama jūsų garbei'.       3. **Stilius**: 'aristokratiškas galas' - per modernus terminas. XIV a. būtų pateiktas konkretus faktas ('aukso grandinė').       4. 'Ponai lenkai' - per formalus. XIV a. būtų naudotas 'lenkai' (be 'ponai').       ",
          "confidence": 0.99
        },
        {
          "type": "style|anachronism",
          "original": "Ji ištiesė jam savo švelnią, dervos kvapą nešančią ranką.",
          "fixed": "Ji ištiesė jam savo ranką, kuri kvapo dervės.",
          "explanation": "       1. **Stilius**: 'švelnią' ir 'dervos kvapą nešančią' yra per daug metaforiški ir emociniai. XIV a. tekstai būtų naudoję konkretesnius apibūdinimus.       2. **Anachronizmas**: 'dervos kvapą nešančią' - per modernus ir poetinis. XIV a. būtų pateiktas tiesioginis aprašymas ('kvapo dervės').       ",
          "confidence": 0.97
        },
        {
          "type": "grammar|style",
          "original": "— Jis nuėjo savo keliu, Kęstuti. Dabar jis turi tik save patį, savo pyktį ir savo išmintį. Ir tai jam padės kur kas labiau nei tavo garbingi prisiminimai. Gamta pati pasirūpins savo vilku.",
          "fixed": "— Jis eina savo keliu, Kęstuti. Dabar jis turi tik save, savo pyktį ir išmintį. Tai jam labiau už tavo garbę. Miškas pats pasirūpins savo vilku.",
          "explanation": "       1. **Gramatika**: 'savo keliu' - neteisingas linksnis. XIV a. būtų naudotas 'savo keliu' (be 'nuėjo' - būtų 'eina' ar 'einą').       2. **Stilius**: 'kur kas labiau' - per modernus ir neegzistuojantis XIV a. tekstuose. Būtų naudotas 'labiau už'.       3. 'Garbė' - XIV a. būtų pateiktas konkretesnis apibūdinimas ('garbę' už 'garbingi prisiminimai').       4. 'Gamta pati pasirūpins' - per modernus ir abstraktus. XIV a. būtų naudotas 'Miškas pats pasirūpins'.       ",
          "confidence": 0.99
        },
        {
          "type": "style|anachronism",
          "original": "Paskutinė mintis, kuri nušvito Kęstučio galvoje prieš jam užgesant, nebuvo apie skausmą ar baisulį. Tai buvo tas pats senas sapnas apie Ąžuolą. Paskutinį kartą jis pamatė tą didžiulį medį, krintantį tyloje vienišame lauke. Ir jis pagaliau suprato — medis krito ne dėl vėjo ar laiko. Jis krito, nes protėvių dievai nusprendė, kad jo šaknims nebėra vietos šitoje naujoje, auksinių grandinių Lietuvoje.",
          "fixed": "Paskutinė mintis, kuri atsimušė Kęstučio galvoje, buvo apie sapną. Jis pamatė didelį ąžuolą, krintantį viename lauke. Medis krinta, nes dievai nusprendė, kad jo šaknims nėra vietos šioje naujoje žemėje.",
          "explanation": "       1. **Stilius**: 'nušvito' ir 'pagaliau suprato' - per modernūs ir emociniai. XIV a. būtų naudotas tiesioginis aprašymas ('atsimušė').       2. **Anachronizmas**: 'aukso grandinių Lietuvoje' - per modernus ir metaforiškas. XIV a. būtų pateiktas konkretus faktas ('šioje naujoje žemėje').       3. 'Protėvių dievai' - per modernus ir abstraktus. XIV a. būtų naudotas 'dievai' (be 'protėvių').       4. 'Naujoje, auksinių grandinių Lietuvoje' - per daug metaforiškas. XIV a. būtų naudotas tiesioginis apibūdinimas ('naujoje žemėje').       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "Jis sėdėjo savo kameroje visiškai nejudėdamas, žiūrėdamas į tą pačią pilką akmens sieną valandų valandas.",
          "fixed": "Jis sėdėjo savo patalpoje, nejudėdamas, žiūrėdamas į pilką akmenų sieną, kol akys prasiveržė.",
          "explanation": "       'Kamera' yra anachronizmas – XIV a. lietuvių nebuvo šio žodžio. Pakeitę į 'patalpa' (senovės lietuvių kalbos terminas). 'Valandų valandas' pakeitę į 'kol akys prasiveržė' – tai būdingesnis senovės tekstų stilius, nes laikrodžiai nebuvo paplitę. 'Pilką akmens sieną' pakeitę į 'pilką akmenų sieną' (gramatika: 'akmens' -> 'akmenų', nes akmenys yra daugiskaitos daiktai).       ",
          "confidence": 0.98
        },
        {
          "type": "style|anachronism",
          "original": "Tai nebebuvo saulėlydžio šviesa; tai buvo deganti ugnis, kuri neleido jam sustingti.",
          "fixed": "Tai nebebuvo saulės šviesa; tai buvo akmens šviesa, kuri neleido jam sustingti.",
          "explanation": "       'Saulėlydis' yra anachronizmas – XIV a. lietuvių nebuvo šio terminų. 'Deganti ugnis' yra per daug metaforiška ir neįprasta senovės tekstuose. Pakeitę į 'akmens šviesa' – tai būdingesnis senovės tekstų stilius, nes akmenys buvo svarbūs simboliai. 'Neleido sustingti' pakeitę į 'neleido sustingti' (nekeičiant, nes tai yra priimtina metafora, bet 'deganti ugnis' buvo per silpna).       ",
          "confidence": 0.95
        },
        {
          "type": "anglicism|style",
          "original": "Tai buvo blanki, bet ji vis dar buvo ten. Tai nebebuvo saulėlydžio šviesa; tai buvo deganti ugnis, kuri neleido jam sustingti.",
          "fixed": "Tai buvo šviesa, bet ji vis dar buvo ten. Tai nebebuvo saulės šviesa; tai buvo akmens šviesa, kuri neleido jam sustingti.",
          "explanation": "       'Blanki' yra anglizmas – tiesioginis vertimas iš anglų kalbos ('blank' reiškia 'tuščia' ar 'neišryškinta'). Pakeitę į 'šviesa' (nes 'blanki' neturi reikšmės senovės lietuvių kalboje). 'Tai nebebuvo saulėlydžio šviesa' pakeitę į 'Tai nebebuvo saulės šviesa' (anachronizmas).       ",
          "confidence": 0.99
        },
        {
          "type": "style|grammar",
          "original": "Ryte Vytautas išgirdo žinią per ventiliacijos angą.",
          "fixed": "Ryte Vytautas išgirdo žinią per angą.",
          "explanation": "       'Ventiliacijos' yra anachronizmas – XIV a. lietuvių nebuvo šio terminų. Pakeitę į 'per angą' (senovės lietuvių kalbos terminas). Gramatika taip pat patikrinta – 'angą' yra teisingas linksnis (vienaskaita, įnaginis).       ",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Viskas, kas dar siejo jį su Kęstučio garbe, dingo kartu su tėvo paskutiniu kvėpavimu. Liko tik ledinis šaltis, pagoniškas pyktis ir vienas vienintelis, aštrus poreikis — kerštas.",
          "fixed": "Viskas, kas siejo jį su Kęstučio garbe, dingo kartu su tėvo paskutiniu kvėpavimu. Liko tik šaltis ir pagoniškas pyktis, kuris užgulė kaip sniegas.",
          "explanation": "       'Ledinis šaltis' ir 'aštrus poreikis — kerštas' yra per daug metaforiški ir neįprasti XIV a. tekstuose. Pakeitę į 'šaltis' (nes 'ledinis' yra per daug modernus) ir 'kuris užgulė kaip sniegas' (metafora, kuri būtų suprantama senovės lietuvių). 'Vienas vienintelis' pakeitę į 'vienas' (perteklių).       ",
          "confidence": 0.97
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5 | Tekstas turėjo būti atnaujintas, kad atitiktų XIV a. lietuvių kalbos stilių ir terminų rinkinį. Pagrindiniai problemų šaltiniai buvo anachronizmai, per daug emocinių būdvardžių ir neegzistuojantys terminai. Pateikti 5 pagrindiniai taisymų fragmentai. | Rasta 5 klaidų, ištaisyta 5"
    },
    {
      "file": "10_saltas_rytas.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism",
          "original": "Jis pajuto keistą, ritmišką vibraciją savo pirštuose — pirmąjį tikrąjį Perkūno prisilietimą, tą baisų dievišką svorį, kurį jis turės nešti kaip prakeiksmą per visą likusį savo gyvenimą.",
          "fixed": "Jis pajuto nepažįstamą, žaibo skausmą pirštuose — pirmąjį Perkūno žaibą, kuris kaip prakeikimas prisiimtas ant pečių ir nešiotinas per likusį gyvenimą.",
          "explanation": "Žodis 'vibracija' yra anachronizmas. XIV a. tekstas neįvedžia šio terminų. 'Dievišką svorį' pakeičiau į 'prakeikimą ant pečių', kad būtų tradicinė metafora. 'Nešti kaip prakeiksmą' ištrinta, nes pertekliuota.",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "Jis turėjo tapti niekuo, šešėliu tarp šešėlių, kad galėtų rasti plyšį savo narve ir ištrūkti į laisvę.",
          "fixed": "Jis turėjo tapti nepažįstamu, bevardžiu, kad galėtų prasiveržti per sienas ir ištrūkti į laisvę.",
          "explanation": "Žodis 'narve' ir 'ištrūkti' yra anachronizmai. XIV a. tekstas naudotų 'prasiveržti per sienas'. 'Šešėlis tarp šešėlių' pakeičiau į 'nepažįstamu, bevardžiu', kad būtų tradicinė metafora.",
          "confidence": 0.97
        },
        {
          "type": "anachronism",
          "original": "Kiekvienas sargybinio žingsnis koridoriuje, kiekviena krentanti vandens lašo tyla dabar buvo tik sudėtingos šachmatų partijos figūros.",
          "fixed": "Kiekvienas sargybinio žingsnis koridoriuje, kiekviena krentanti vandens lašo tyla dabar buvo kaip paslėptos žaibų žvaigždės, kurios žymėjo kelį.",
          "explanation": "Žodis 'šachmatų partija' yra anachronizmas. XIV a. tekstas naudotų metaforą su 'žaibų žvaigždėmis' arba 'paslėptomis žymėmis'. Pakeičiau į tradicinę, retorinės vertės metaforą.",
          "confidence": 0.99
        },
        {
          "type": "grammar",
          "original": "Jis pamatė savo atvaizdą — purviną, suvargusį, vis dar turintį dėdės bruožų, kurių dabar negalėjo pakęsti.",
          "fixed": "Jis atvaizdą atpažino — purviną, suvargusį, kurio veidas dar nešė dėdės bruožų, kuriuos dabar negalėjo pakęsti.",
          "explanation": "Netikslus linksnis ('bruožų' turi būti 'bruožus' arba 'bruožų', bet 'kuriuos' yra teisingas, tačiau 'atvaizdą atpažino' yra tiksliau. 'Turintį' pakeičiau į 'nešė', kad būtų natūralesnis XIV a. stilus.",
          "confidence": 0.95
        },
        {
          "type": "style",
          "original": "Grįžęs į savo drėgną kamerą, Vytautas priėjo prie mažo, apsamanojusio metalinio indo su pilkšvu vandeniu.",
          "fixed": "Grįžęs į savo drėgną patalį, Vytautas priėjo prie mažo metalinio indelio, kuris buvo užpilęs pilkšvu vandeniu.",
          "explanation": "Žodis 'kamera' yra anachronizmas (XIV a. būtų 'patalys' ar 'kambarys'). 'Apsamanojusio' yra pertekliuotas būdvardis. 'Indas' pakeičiau į 'indelis', kad būtų tradicinė forma.",
          "confidence": 0.98
        },
        {
          "type": "style",
          "original": "Saulė galutinai pasislėpė po debesimis, užleisdama vietą pilkai, bet lemtingai dienai.",
          "fixed": "Saulė pasislėpė už debesų, palikdama tamsą.",
          "explanation": "       XIV a. tekstai būtų rašyti labiau konkretiškai ir be pernelyg emocinės raiškos. Žodis 'lemtingai' yra pernelyg modernus ir emocinis. 'Pilkai dienai' yra pernelyg poetinis ir neegzistuotų to meto tekstuose. 'Galutinai' taip pat yra pernelyg modernus žodis. Pakeitimas į 'pasislėpė už debesų, palikdama tamsą' yra tikresnis XIV a. stilui ir nepertekliavo žodžių.       ",
          "confidence": 0.95
        },
        {
          "type": "style",
          "original": "a, kuri po savęs nepaliks nieko senojo.",
          "fixed": "a, kuri po savęs nieko nepaliks.",
          "explanation": "       XIV a. tekstai būtų rašyti labiau konkretiškai ir be pernelyg emocinės raiškos. Žodis 'senojo' yra pernelyg modernus ir neegzistuotų to meto tekstuose. Pakeitimas į 'nieko nepaliks' yra tikresnis XIV a. stilui ir labiau konkretus.       ",
          "confidence": 0.95
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5 | Rasta 2 klaidų, ištaisyta 2"
    },
    {
      "file": "11_nasle.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism",
          "original": "Birutė stovėjo prie Šventojo akmens — milžiniško, pilko ir samanoto riedulio, kurio paviršius buvo išraižytas senoviniais, laiko beveik nušlifuotais simboliais, saugančiais žinias apie pamirštus dievus.",
          "fixed": "Birutė stovėjo prie Šventojo akmens — milžiniško, pilko akmens, kurio paviršius buvo išraižytas senovinėmis žymėmis, saugančiais žinias apie senus dievus.",
          "explanation": "       - 'Samanoto' žodis XIV a. lietuvių kalboje neegzistavo (šis terminas yra modernus, reiškiantis 'apaugęs samanomis').       - 'Senoviniai, laiko beveik nušlifuotais simboliais' pakeičiamas į 'senovinėmis žymėmis', nes XIV a. lietuvių kalboje nebuvo terminų 'simboliai' ar 'nušlifuoti'.       - 'Pamirštus dievus' pakeičiamas į 'senus dievus', nes XIV a. lietuvių mitologijoje dievai buvo laikomi amžiniu, ne 'pamirštu' turiniu.",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "Tik ketvirtąjį kartą Birutė suprato — tai nebuvo atsitiktinumas, o negailestingas dievų ženklas. Jos ryšys su Kęstučiu kaip dvasiniu vedliu nebuvo baigtas; jis tiesiog pakeitė savo materialią formą.",
          "fixed": "Ketvirtą kartą Birutė suprato — tai nebuvo atsitiktinumas, o dievų žodis. Jos ryšys su Kęstučiu nebuvo nutrauktas; jis tik pakeitė savo formą.",
          "explanation": "       - 'Negailestingas dievų ženklas' pakeičiamas į 'dievų žodis', nes XIV a. lietuvių kalboje nebuvo terminų 'ženklas' ar 'negailestingas'.       - 'Dvasiniu vedliu' pakeičiamas į 'vedliu' (be 'dvasiniu'), nes XIV a. lietuvių kalboje nebuvo terminų 'dvasinis' ar 'dvasinis vedlys'.       - 'Materialią formą' pakeičiamas į 'formą', nes 'materialus' žodis XIV a. lietuvių kalboje nebuvo naudojamas tokiu kontekste.",
          "confidence": 0.99
        },
        {
          "type": "style|anachronism",
          "original": "Ji buvo našlė. Tačiau šis statusas Birutei nereiškė to paties, ką jis reiškė paprastoms moterims, kurios per laidotuves draskydavosi drabužius ir klykdavo iš sielvarto.",
          "fixed": "Ji buvo našlė. Tačiau šis statusas Birutei nebuvo kaip paprastoms moterims, kurios laidotuvėse draskydavo drabužius ir klykėdavo iš sielvarto.",
          "explanation": "       - 'Nereiškė to paties' pakeičiamas į 'nebuvo kaip', nes XIV a. lietuvių kalboje nebuvo tokių sintaksinių konstrukcijų.       - 'Sielvarto' pakeičiamas į 'klykėdavo' (nes 'sielvartas' yra XIV a. žodis, bet 'klykėti' yra paprastesnis ir tikresnis veiksmas).       - Perdėta metafora 'draskydavosi drabužius' pakeičiama į 'draskydavo drabužius' (nes XIV a. lietuvių kalboje nebuvo tokių būdvardžių kaip 'perdėta' ar 'pertekliniai žodžiai').",
          "confidence": 0.97
        },
        {
          "type": "anachronism|grammar",
          "original": "Ji buvo našlė ne pagal žmogiškąjį išdavystės ir auksinių grandinių įstatymą, o pagal kur kas galingesnę, nepermaldaujamą dievų valią.",
          "fixed": "Ji buvo našlė ne pagal žmogiškus įstatymus, o pagal dievų valią.",
          "explanation": "       - 'Žmogiškąjį išdavystės ir auksinių grandinių įstatymą' pakeičiamas į 'žmogiškus įstatymus', nes XIV a. lietuvių kalboje nebuvo terminų 'išdavystės įstatymas' ar 'auksinių grandinių įstatymas'.       - 'Kur kas galingesnę, nepermaldaujamą dievų valią' pakeičiamas į 'dievų valią', nes XIV a. lietuvių kalboje nebuvo tokių būdvardžių kaip 'galingesnė' ar 'nepermaldaujama'.",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Tik ketvirtąjį kartą Birutė suprato — tai nebuvo atsitiktinumas, o negailestingas dievų ženklas. Jos ryšys su Kęstučiu kaip dvasiniu vedliu nebuvo baigtas; jis tiesiog pakeitė savo materialią formą.",
          "fixed": "Ketvirtą kartą Birutė suprato — tai nebuvo atsitiktinumas, o dievų žodis. Jos ryšys su Kęstučiu nebuvo nutrauktas; jis tik pakeitė savo formą.",
          "explanation": "       - 'Negailestingas dievų ženklas' pakeičiamas į 'dievų žodis', nes XIV a. lietuvių kalboje nebuvo terminų 'ženklas' ar 'negailestingas'.       - 'Dvasiniu vedliu' pakeičiamas į 'vedliu' (be 'dvasiniu'), nes XIV a. lietuvių kalboje nebuvo terminų 'dvasinis' ar 'dvasinis vedlys'.       - 'Materialią formą' pakeičiamas į 'formą', nes 'materialus' žodis XIV a. lietuvių kalboje nebuvo naudojamas tokiu kontekste.       - 'Baigtas' pakeičiamas į 'nutrauktas', nes XIV a. lietuvių kalboje nebuvo terminų 'baigtas' (reikėjo 'nutrauktas').",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "bet kaip savo dalią. Su giliu, plaučius plėšančiu atodūsiu, ji metė auksą gilyn į putojančias, juodas bangas.",
          "fixed": "bet kaip savo dalį. Su giliu, širdį sukrėtančiu atodūsiu, ji metė auksą į putojančias juodas bangas.",
          "explanation": "         - **Anachronizmas**: 'plaučius plėšančiu' – XIV a. būtų naudojama metaforė su 'širdimi' (plaučiai kaip organas nebuvo tokiu akivaizdžiai aprašomi).         - **Stilius**: 'giliu' – per daug būdvardžių. XIV a. būtų naudojama trumpesnė forma ('giliu atodūsiu').       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "Tik ketvirtąjį kartą Birutė suprato — tai nebuvo atsitiktinumas, o negailestingas dievų ženklas. Jos ryšys su Kestučiu kaip dvasiniu vedliu nebuvo baigtas; jis tiesiog pakeitė savo materialią formą.",
          "fixed": "Ketvirtą kartą Birutė suprato: tai ne atsitiktinumas, o dievų žodis. Jos ryšys su Kestučiu kaip dvasinis vedlys nebuvo nutrauktas – jis tik pakeitė savo pavaizdą.",
          "explanation": "         - **Anachronizmas**: 'negailestingas dievų ženklas' – XIV a. būtų naudojama 'dievų žodis' (dievai kalbėdavo žodžiais, ne 'ženklais').         - **Gramatika**: 'dvasiniu vedliu' → 'dvasinis vedlys' (XIV a. lietuvių kalboje būtų naudojama tiesioginė forma be '-iu').         - **Stilius**: 'pakeitė savo materialią formą' → 'pakeitė savo pavaizdą' (metaforiškesnis ir senesnis žodynas).       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Ji tapo didesnio, amžino ir nepermaldaujamo kosminio ciklo dalimi. Ji užmerkė akis ir sąmoningai pasiuntė savo valią per nesibaigiančius vandenis ir vėjus toli į rytus, link tos tamsios ir drėgnos Krėvos pilies, kurioje mirė jos pasaulis.",
          "fixed": "Ji tapo amžinojo ciklo dalimi. Užmerkusi akis, ji pasiuntė savo valią per vandenis ir vėjus į rytus, kur tamsioje Krėvos pilies mirė jos pasaulis.",
          "explanation": "         - **Anachronizmai**:           - 'kosminis ciklas' → 'amžinojo ciklo' (XIV a. būtų naudojama 'amžinas' kaip būdvardis, o ne 'kosminis').           - 'nepermaldaujamas' – neegzistuojantis žodis (pakeistas į 'amžinas').           - 'sąmoningai' – per modernus žodis (pakeistas į tiesioginę veiksmo formą).         - **Stilius**:           - 'tamsios ir drėgnos' → 'tamsioje' (per daug būdvardžių).           - 'nesibaigiančius' → 'vandenis' (metaforiškesnis ir senesnis ryšys).       ",
          "confidence": 0.97
        },
        {
          "type": "anglicism|style",
          "original": "Tai nebuvo malda kokiam nors silpnam, žmonių sugalvotam dievui; tai buvo įsakymas pačioms gamtos stichijoms, kurios ją girdėjo kaip savo dalį.",
          "fixed": "Tai nebuvo malda žmonių dievams; tai buvo įsakymas paties dievo jėgoms, kurios ją klausė kaip savo dalį.",
          "explanation": "         - **Anglicizmas**: 'stichijoms' – neegzistuojantis žodis (pakeistas į 'jėgoms').         - **Stilius**:           - 'silpnam, žmonių sugalvotam' – per daug būdvardžių ir per modernus ryšys.           - 'pačioms gamtos' → 'paties dievo' (XIV a. būtų naudojama tiesioginė dievo forma).       ",
          "confidence": 0.99
        },
        {
          "type": "style|grammar",
          "original": "Ji nebebuvo našlė, kuriai reikėjo dvariškių užuojautos; ji tapo gamtos jėga, kurią kiekvienas protingas žmogus privalėjo gerbti labiau už bet kokį kariuomenės vadą.",
          "fixed": "Ji nebuvo našlė, kuriai reikėjo užuojautos; ji tapo gamtos jėga, kurią privalėjo gerbti visi, labiau už kariuomenės vadai.",
          "explanation": "         - **Stilius**:           - 'dvariškių užuojautos' → 'užuojautos' (XIV a. būtų naudojama tiesioginė forma).           - 'kiekvienas protingas žmogus' → 'visi' (senesnis ir trumpesnis ryšys).           - 'labiau už bet kokį kariuomenės vadą' → 'labiau už kariuomenės vadai' (per daug būdvardžių ir modernus ryšys).         - **Gramatika**: 'privalėjo gerbti labiau už' → 'privalėjo gerbti visi' (senesnis būdvardis 'visi').       ",
          "confidence": 0.98
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5. Tekstas ištaisytas pagal XIV a. lietuvių kalbos ir kultūros bruožus. | Rasta 5 klaidų, ištaisyta 5. Pagrindiniai problemų šaltiniai: anachronizmai, anglizmai ir perteklinis stilius."
    },
    {
      "file": "12_gedulo_skraiste.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism|style",
          "original": "Krėvos pilis tądien atrodė ypač niūri, tarsi patys šimtamečiai akmenys būtų pasidengę juodu, tirštu sielvarto pelėsiu, neleidžiančiu giliau kvėpuoti. Dangus virš pilies buvo nepermatomai užtrauktas storais, purvinais pilkais debesimis, pro kuriuos neprasiskverbė nė vienas menkiausias saulės spindulys, suteikiantis bent krislą vilties.",
          "fixed": "Krėvos pilis tą dieną atrodė juoda, tarsi akmenys būtų uždengti juodu, stiprų sielvarto pelėsiu. Dangus virš pilies buvo uždengtas pilkais debesimis, kuriuos neprasiskverbė saulė.",
          "explanation": "         - 'Niūri' ir 'menkiausias' yra anachronizmai (XIV a. lietuvių kalboje būdvardžiai buvo retai naudojami, o 'niūri' yra XIX a. žodis).         - 'Sielvarto pelėsis' ir 'suteikiantis krislą vilties' yra per metaforiniai ir perteklių būdvardžių.         - 'Saulės spindulys' ir 'neleidžiančiu giliau kvėpuoti' yra per modernūs metaforiniai pasakojimai.         - 'Nepermatomai užtrauktas' ir 'purvinais pilkais' yra perteklių būdvardžių.         - 'Krislą vilties' yra neegzistuojantis XIV a. žodis.         Ištaisyta: paprastesnis, be metaforų ir būdvardžių tekstas, kuris atitinka XIV a. stilistiką.",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "Ona atvyko prie Krėvos pilies vartų nedideliame, kukliame mediniame vežime, apsupta tik kelių ištikimų tarnų ir raudančių moterų. Ji pati buvo apsirengusi sunkia, nepermatoma juoda gedulo skraistė, kuri visiškai dengė jos trapų kūną, palikdama matomą tik neįtikėtinai blyškų, vaško spalvos veidą.",
          "fixed": "Ona atvyko prie Krėvos vartų mažame vežime, kurį lydėjo kelios ištikimos tarnės ir moterys. Ji buvo apsirengusi juoda, sunkia gedulo apranga, kuri dengė jos kūną, palikdama matomą tik blyškų veidą.",
          "explanation": "         - 'Skraistė' yra anachronizmas (XIV a. lietuvių kalboje neegzistuojantis žodis, kilęs iš vėlesnių laikų).         - 'Nedidelis', 'kuklis', 'nepermatomas', 'trapus', 'neįtikėtinai blyškų, vaško spalvos' yra perteklių būdvardžių ir metaforų.         - 'Raudančių moterų' (linksnis) ir 'gedulo skraistė' (neegzistuojantis žodis) yra gramatikos klaidų.         Ištaisyta: paprastesnis, be būdvardžių ir metaforų tekstas, kuris atitinka XIV a. stilistiką.",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Jos akys buvo ištinusios, raudonos ir nuolat ašarojančios — tai buvo ne tik gryno, tikro sielvarto pasekmė, bet ir rezultatas kruopštaus darbo su svogūnų sultimis, kurias ji negailestingai įtrynė į jautrius vokus prieš pat išlipdama iš vežimo.",
          "fixed": "Jos akys buvo raudonos ir ašarojančios. Ji buvo pasidengusi juodais apdangalais, kad atrodytų skruzdėta.",
          "explanation": "         - 'Ištinusios', 'grynas sielvartas', 'kruopštus darbas su svogūnų sultimis', 'negailestingai įtrynė į jautrius vokus' yra per modernūs ir metaforiniai.         - 'Ašarojančios' yra perteklių būdvardis.         Ištaisyta: paprastesnis, be metaforų ir būdvardžių tekstas, kuris atitinka XIV a. stilistiką.",
          "confidence": 0.97
        },
        {
          "type": "anachronism|style",
          "original": "Kiekvienas jos žingsnis ant šlapio grindinio buvo lėtas, sunkus, beveik varginantis, tarsi ji ant savo gležnų pečių neštų mirtiną visos Lietuvos pralaimėjimo naštą.",
          "fixed": "Jos žingsniai buvo lėti ir sunkūs, tarsi ji neštų smurtą.",
          "explanation": "         - 'Lėtas', 'sunkus', 'beveik varginantis', 'gležni pečiai', 'mirtiną visos Lietuvos pralaimėjimo naštą' yra perteklių būdvardžių ir metaforinių pasakojimų.         - 'Šlapio grindinio' ir 'mirtiną naštą' yra per modernūs žodžiai.         Ištaisyta: paprastesnis, be būdvardžių ir metaforų tekstas, kuris atitinka XIV a. stilistiką.",
          "confidence": 0.98
        },
        {
          "type": "anachronism|style",
          "original": "Ji buvo tobula aktorė, vaidinanti dūžtančią, bejėgę ir palūžusią moterį, nors giliai jos viduje dega toks šaltas, aštrus ir nepalenkiamas pyktis, kad jis savo jėga galėtų perkirsti patį kiečiausią Krėvos pilies granitą.",
          "fixed": "Ji atrodė dūžtančia, bejėgė moterimi, bet jos viduje degė pyktis, kuri galėtų sudeginti pilį.",
          "explanation": "         - 'Tobula aktorė', 'vaidinanti', 'dūžtančią, bejėgę ir palūžusią moterį', 'šaltas, aštrus ir nepalenkiamas pyktis', 'perkirsti patį kiečiausią granitą' yra per modernūs ir metaforiniai.         - 'Šaltas, aštrus ir nepalenkiamas' yra perteklių būdvardžių.         Ištaisyta: paprastesnis, be būdvardžių ir metaforų tekstas, kuris atitinka XIV a. stilistiką.",
          "confidence": 0.99
        },
        {
          "type": "grammar",
          "original": "kutinę pilies ramybę",
          "fixed": "kutinę pilies ramybę *arba* kūrinę pilies ramybę",
          "explanation": "       XIV a. lietuvių kalboje būtų naudojami tradiciniai linksniai. 'Ramybė' yra moteriškosios giminės žodis, todėl galininkas būtų 'ramybę', bet 'kutinę' yra neaiškus. Galima spekuliuoti, kad tai būtų 'kūrinę' (dalyvis 'kūrinčią' arba 'kūrinė') arba 'kūrinę' kaip 'kūrinčią' (dalyvis būtent 'kūrinčią' būtų tinkamesnis XIV a. tekstui). Tačiau be konteksto, tai yra sudėtinga aiškinti. Jei tekstas yra iš XIV a., būtų reikalingas pilnas kontekstas, kad tiksliai nustatyti linksnį.       ",
          "confidence": 0.7
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5. Tekstas ištaisytas atitinkamai XIV a. stilistikai. | Tekste pastebėta 1 gramatinė klaida arba neaiškumas, reikalingas kontekstas."
    },
    {
      "file": "16_pelkes_vaikai.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism|grammar",
          "original": "Pirmas dalykas, kurį jis sąmoningai pajuto, buvo sunkus, dusinantis purvo ir pūvančių samanų svoris jo plaučiuose — kiekvienas įkvėpimas buvo kova.",
          "fixed": "Pirmas, ko sąmoningai pajuto, buvo sunkus, dusinantis purvo ir samanų svoris, kuris užpildė jo krūtinę; kiekvienas kvėpavimas buvo kovos.",
          "explanation": "       - **Anachronizmas**: 'įkvėpimas' ir 'plaučiai' yra anatominiai terminai, kurie XIV a. lietuvių kalboje būtų naudoti retai arba pakeisti į 'krūtinė' (senesnis terminas).       - **Stilius**: 'dusinantis' ir 'kova' yra per modernūs; XIV a. tekstuose būtų naudojami paprastesni būdvardžiai ('sunkus', 'duslus').       ",
          "confidence": 0.95
        },
        {
          "type": "grammar|style",
          "original": "Tai buvo gyva, ritmiškai kvėpuojanti masė, kuri, atrodo, kantriai laukė akimirkos, kada galės jį galutinai praryti.",
          "fixed": "Tai buvo gyva žemė, kuri kvėpuoja ir kantriai laukia, kol galės jį praryti.",
          "explanation": "       - **Gramatika**: 'ritmiškai kvėpuojanti' yra per modernus frazeologizmas; XIV a. tekstuose būtų naudojamas tiesesnis 'kvėpuoja'.       - **Stilius**: 'atrodo' ir 'galutinai' yra per daug retoriniai; tekstas turi būti tiesesnis ir nepertekintas.       - **Kultūrinis netikslumas**: 'praryti' kaip metafora būtų suprantama, bet 'galutinai' yra per modernus.       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|style",
          "original": "Jis nežinojo, kiek laiko čia praleido — valandas ar ištisas paras, ir ar jis vis dar yra gyvas, ar jo siela jau negrįžtamai klaidžioja anapusinio pasaulio, kurį žyniai vadino Dausomos, pakraštyje.",
          "fixed": "Nežinojo, kiek laiko praleido: ar valandas, ar parus, ar jau miręs, ar jo siela klajojo toje pasaulio dalyje, kurią žyniai vadina 'Dausomis'.",
          "explanation": "       - **Anachronizmas**: 'negrįžtamai' ir 'klaidžioja' yra per modernūs terminai; XIV a. būtų naudojami paprastesni žodžiai ('klajoja').       - **Stilius**: 'anapusinio pasaulio' ir 'pakraštyje' yra per daug retoriniai; tekstas turi būti tiesesnis.       - **Gramatika**: 'Dausomos' (dgs. gal.) turi būti 'Dausomis' (vns. įnag.), bet kontekste tai yra dieviškojo pasaulio pavadinimas, todėl galima palikti tiesiog 'Dausomis'.       ",
          "confidence": 0.97
        },
        {
          "type": "anglicism|style",
          "original": "Tai buvo Eglė, ta pati paslaptinga būtybė, kurią jis trumpam matė prieš galutinai prarasdamas sąmonę. Ji stovėjo visiškai nejudėdama, bet Vytautas jautė jos dvasinį buvimą kiekviename savo įtemptame nerve.",
          "fixed": "Tai buvo Eglė, ta pati paslaptinga būtybė, kurią matė trumpam prieš praradęs sąmonę. Ji stovėjo nejudėdama, o Vytautas jautė jos dvasią kiekviename savo nervyje.",
          "explanation": "       - **Anglicizmas**: 'dvasinį buvimą' yra tiesioginis vertimas iš anglų kalbos ('spiritual presence'). XIV a. būtų naudojamas tiesesnis 'dvasią'.       - **Anachronizmas**: 'įtemptas nervas' yra per modernus terminas; 'nervas' būtų pakeistas į 'nervys' (senesnis žodis).       - **Stilius**: 'galutinai prarasdamas sąmonę' yra per daug retorinis; 'prarasdamas sąmonę' yra tiesesnis.       ",
          "confidence": 0.99
        },
        {
          "type": "grammar|style",
          "original": "Jis retkarčiais lėtai iškišdavo savo skeltą, juodą liežuvį, tarsi mįslingai šnibždėdamas jai į ausį senas paslaptis apie tai, kas dabar tyko po nepermatomu vandens paviršiumi.",
          "fixed": "Žaltys retkarčiais iškišdavo savo skeltą liežuvį, tarsi šnibždėdamas senas paslaptis apie tai, kas tyko po vandens paviršiumi.",
          "explanation": "       - **Gramatika**: 'savo skeltą, juodą liežuvį' yra per daug retorinis; XIV a. tekstuose būtų naudojamas tiesesnis 'skeltą liežuvį'.       - **Stilius**: 'mįslingai šnibždėdamas' ir 'nepermatomu' yra per daug retoriniai; tekstas turi būti tiesesnis.       - **Kultūrinis netikslumas**: 'nepermatomas' būtų suprantamas, bet 'tyko' yra tiesesnis už 'dabar tyko'.       ",
          "confidence": 0.96
        },
        {
          "type": "style|anachronism",
          "original": "— sekundės virto valandomis, o metrai — begalybe. Jie žengė pro skęstančius, pajuodusius ir kreivus medžius, kurie siekė pilką dangų tarsi suluošintos, maldaujančios žmogaus rankos.",
          "fixed": "Laikas slinko lėtai, o žingsniai į pelkę tarsi prarado savąjį svorį. Medžiai, susirūdinę ir susilaužę, išsikišo į pilką dangų, tarsi žmogaus rankos, maldaudamos pagalbos.",
          "explanation": "       **Anachronizmas**: 'Begalybe' kaip apibūdinimas laiko – per modernus terminas. 'Sekundės virto valandomis' – per ankstyvas laikotarpis, kai laikmatis buvo ne toks precizingas.       **Stilius**: 'Suluošintos, maldaujančios žmogaus rankos' – per romantiška metafora. XIV a. tekstuose būtų naudojami konkretesni, natūralesni aprašai (pvz., 'tarsi maldaudamos').       ",
          "confidence": 0.95
        },
        {
          "type": "grammar|style",
          "original": "Po skaidriu, bet klastingai giliu vandeniu, Vytis karts nuo karto matydavo baltuojančias kaukoles ir surūdijusių šarvų fragmentus — tylius pėdsakus tų drąsuolių, kurie bandė įveikti Dykrą be vedlio ir be pagarbos.",
          "fixed": "Po šviesaus, bet gilių vandens Vytis dažnai matydavo baltas kaukoles ir rūsčius šarvus – senųjų kariauninkų pėdsakus. Jie, be vedlio ir be pagarbos, bandė pražengti per pelkę.",
          "explanation": "       **Grammatinė netikrumas**: 'Skaidriu, bet klastingai giliu' – netinkamas žodžių junginys (dvejopė forma). 'Baltuojančias kaukoles' – per modernus apibūdinimas (XIV a. būtų naudojama tiesiog 'baltas').       **Stilius**: 'Dykra' kaip pavadinimas – netinkamas terminas. XIV a. tekstuose pelkė būtų aprašyta kaip 'pelkė' ar 'miškinga žemė'. 'Tylius pėdsakus' – per retas žodis.       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|style",
          "original": "Pelkė buvo pilna senų, alkanų dvasių, kurios iš šešėlių tyliai stebėjo kiekvieną jo drebantį žingsnį.",
          "fixed": "Pelkė buvo pilna senų dvasių, kurios iš šešėlių stebėjo kiekvieną žingsnį. Jos maldaudavo pagalbos arba pasmerkdavo netikėtus žmones.",
          "explanation": "       **Anachronizmas**: 'Alkanų dvasių' – per modernus apibūdinimas. Dvasios XIV a. mitologijoje būtų aprašytos kaip 'maldaudamos' ar 'pasmerkdamos', ne 'alkanos'.       **Stilius**: 'Tyliai stebėjo' – per romantiška. Dvasios būtų aprašytos kaip veikiančios konkretesnių veiksmu (pvz., 'maldaudavo').       ",
          "confidence": 0.97
        },
        {
          "type": "anachronism|grammar",
          "original": "Tik nendrės vis dar lengvai siūbavo ten, kur ji ką tik stovėjo, o tolimas, raminantis žalčio šlamėjimas žolėje priminė jam, kad nuo šios akimirkos jis niekada nebebus visiškai vienas šiame pasaulyje.",
          "fixed": "Nendrės dar siūbo ten, kur Eglė buvo, o tolimas žalčio šlamėjimas priminė, kad nuo šiol jis nebebus vienas.",
          "explanation": "       **Anachronizmas**: 'Žalčio šlamėjimas' – per vėlyvas terminas (žaltys kaip simbolis yra populiariau vėlesniuose tekstuose). 'Niekada nebebus visiškai vienas' – per modernus laiko apibūdinimas.       **Grammatinė netikrumas**: 'Lengvai siūbavo' – per retas žodis. XIV a. būtų naudojama tiesiog 'siūbo'.       ",
          "confidence": 0.99
        },
        {
          "type": "style|anachronism",
          "original": "Galiausiai ji atvedė jį prie vienišo, milžiniško akmens, kylančio tiesiai iš vandens, kurio paviršius buvo ištisai padengtas keistomis, švytinčiomis melsvomis kerpėmis.",
          "fixed": "Galiausiai ji atvedė prie vieno didelio akmens, kylančio iš vandens. Jo paviršius buvo dengtas senovinėmis, švytinčiomis kerpėmis.",
          "explanation": "       **Stilius**: 'Milžiniško' ir 'keistomis, švytinčiomis melsvomis' – per daug būdvardžių. XIV a. tekstuose būtų naudojami tik esminiai aprašai.       **Anachronizmas**: 'Švytinčios' – per modernus apibūdinimas. Kerpės būtų aprašytos kaip 'švytinčios' tik jei tai būtų aiškus mitologinis elementas (pvz., 'švytinčios nuo ugnies').       ",
          "confidence": 0.96
        },
        {
          "type": "anachronism",
          "original": "instinktais ir tais, kurie gyvena šešėliuose",
          "fixed": "gamtinėmis žinijomis ir tamsumos žmonėmis",
          "explanation": "       Žodis 'instinktai' yra anachronizmas – XIV a. žmonės nebuvo psichologizuoję elgsenos taip aiškiai. 'Instinktai' būtų vertinami kaip 'gamtinės žinios' (pvz., 'kaip gyvūnai žino, ko reikia'). 'Šešėliuose gyvenantys' būtų vertinama kaip 'tamsumos žmonės' (pvz., 'tamsos žmonės, kurie žino slaptąsias kelius').       ",
          "confidence": 0.95
        },
        {
          "type": "grammar",
          "original": "naujos gyvybės, šviežių spyglių, dervos ir drėgnos žemės dvelksmas",
          "fixed": "jaunosios gyvosios, spyglių, dervos ir žemės drėgnumo kvapas",
          "explanation": "       'Naujos gyvybės' – neteisingas žodžių junginys (XIV a. būtų naudotas 'gyvosios' ar 'jaunosios gyvosios'). 'Šviežių spyglių' – 'spyglių' vienaskaitos forma būtų teisingesnė (pvz., 'spyglių kvapas'). 'Dvelksmas' – XIV a. būtų naudotas 'kvapas' (pvz., 'kvapas žemės'). 'Dervos' – teisinga, bet 'drėgnos žemės' būtų 'žemės drėgnumo'.       ",
          "confidence": 0.98
        },
        {
          "type": "style",
          "original": "Jis stovėjo ant naujos, pavojingos ateities ribos, visas purvinas, iki mirties pavargęs, bet pirmą kartą po ilgo laiko — laisvas.",
          "fixed": "Jis stovėjo prie naujos, baisios ateities ribos, purvinas, be jėgų, bet po ilgo laiko pirmą kartą laisvas.",
          "explanation": "       Perteklių ir per daug būdvardžių: 'pavojingos' -> 'baisios' (XIV a. būtų naudotas stipresnis būdvardis), 'iki mirties pavargęs' -> 'be jėgų' (pvz., 'be jėgų kaip miręs'). 'Visas purvinas' – 'purvinas' teisinga, bet 'visas' perteklių. 'Pirmą kartą po ilgo laiko — laisvas' – dviejų kartų 'laisvas' perteklių, todėl ištrintas.       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism",
          "original": "Kelias į vokiečių ordiną buvo atviras, bet kaina, kurią jis turėjo sumokėti už pagalbą, buvo didesnė už bet kokią pilį.",
          "fixed": "Kelias į kryžininkų žemes buvo atviras, bet kaina už pagalbą buvo didesnė už bet kokią pilį.",
          "explanation": "       'Vokiečių ordinas' – XIV a. lietuvių kalboje būtų naudotas 'kryžininkai' ar 'žemės kryžininkų' (pvz., 'žemės, kurias valdžia kryžininkai'). 'Pagalba' – XIV a. būtų 'palaipa' ar 'palaipa už pagalbą' (pvz., 'kaina už palaipą').       ",
          "confidence": 0.97
        },
        {
          "type": "style",
          "original": "Tik nendrės vis dar lengvai siūbavo ten, kur ji ką tik stovėjo, o tolimas, raminantis žalčio šlamėjimas žolėje priminė jam, kad nuo šios akimirkos jis niekada nebebus visiškai vienas šiame pasaulyje.",
          "fixed": "Nendrės dar siūbavo ten, kur ji stovėjo, o tolimas žalčio šlamėjimas žolėje priminė jam, kad nuo šios akimirkos jis niekada nebebus vienas šiame pasaulyje.",
          "explanation": "       'Lengvai siūbavo' -> 'siūbavo' (XIV a. būtų naudotas paprastesnis veiksmažodis). 'Raminantis' – anachronizmas (XIV a. būtų 'pagalbėlis' arba 'ramybės kelias'). 'Niekada nebebus visiškai vienas' -> 'niekada nebebus vienas' (ištrintas 'visiškai' kaip perteklius).       ",
          "confidence": 0.96
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5. Tekstas adaptuotas XIV a. lietuviškam stilui, ištrintos retorinės pertekintos metaforos, pakeisti anachronizmai ir anglicizmai. | Rasta 5 klaidų, ištaisyta 5. Pagrindiniai problemų taškai: anachronizmai, pernelyg romantiškas stilius ir netinkami terminai. | Rasta 5 klaidų, ištaisyta 5"
    },
    {
      "file": "18_gelezinis_magistras.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism",
          "original": "Jogaila padarė lemtingą klaidą, pasirinkdamas brolžudišką smurtą vietoj derybų civilizacijos šešėlyje.",
          "fixed": "Jogaila pasirinko brolžudišką smurtą, o ne derybas, kurios galėjo išsaugoti taiką.",
          "explanation": "'Civilizacijos šešėlyje' yra anachronizmas – XIV a. lietuvių kalboje tokio terminų nebuvo. 'Lemtingą klaidą' pakeičiau į 'pasirinkimą', nes tai būtent istorinis sprendimas, o ne klaida. 'Brolžudišką smurtą' paliekame, nes tai istorinis faktas.",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "Geležinis Šventajas, tas šaltas ir negailestingas dievas-karžygys, kuriam aklai meldėsi tūkstančiai riterių Marienburgo katedroje, stebėjo šias derybas su tyliu, plieniniu pasitenkinimu.",
          "fixed": "Geležinis Šventasis, tas šaltas ir negailestingas dievas, kuriam aklai maldauja riteriai, stebėjo šias derybas su tyliu pasitenkinimu.",
          "explanation": "'Dievas-karžygys' ir 'plieninis' yra anachronizmai. XIV a. lietuvių kalboje nebuvo tokio terminų. 'Riterių' pakeičiau į 'riteriai', nes tekstas yra XIV a. kontekste, o ne dabartinėje kalboje. 'Marienburgo katedroje' paliekame, nes tai istorinis faktas, bet 'tūkstančiai' pakeičiau į 'riteriai', nes tai perteklinis skaičius.",
          "confidence": 0.99
        },
        {
          "type": "anglicism",
          "original": "Ir kokia bus galutinė kaina už jūsų... krikščioniškąją malonę?",
          "fixed": "Ir kokia bus kaina už jūsų pripažinimą?",
          "explanation": "'Krikščioniškąją malonę' yra tiesioginis vertimas iš anglų kalbos ('Christian favor'). XIV a. lietuvių kalboje tokio terminų nebuvo. Pakeičiau į 'pripažinimą', nes tai būtent tai, ko reikalavo Ordinas – pripažinimas krikščionybės ir valdžios.",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Bet mes... mes galime jums padėti ištaisyti šią istorinę neteisybę. Mes galime suteikti jums galingą kariuomenę, neribotą auksą ir galią galutinai atsiimti tai, kas pagal prigimtį priklauso jūsų giminei.",
          "fixed": "Mes galime jums padėti atstatyti teisę. Suteiksime jums kariuomenę, auksą ir pagalbą atgauti tai, kas priklauso jūsų giminei.",
          "explanation": "'Istorinė neteisybė' ir 'neribotą auksą' yra pertekliniai būdvardžiai bei stilistinis perteklius. 'Galingą kariuomenę' pakeičiau į 'kariuomenę', nes XIV a. tekstuose būdvardžiai naudojami retai. 'Galutinai atsiimti' pakeičiau į 'atgauti', nes tai būtent tai, ko siekė Vytautas – atgauti žemes, o ne 'atsiimti'.",
          "confidence": 0.97
        },
        {
          "type": "grammar",
          "original": "— Jūsų tėvo mirtis Krėvoje yra tragiška klaida, kurios buvo galima išvengti.",
          "fixed": "— Jūsų tėvo mirtis Krėvoje buvo klaida, kurią galima buvo išvengti.",
          "explanation": "XIV a. lietuvių kalboje nebuvo 'tragiškas' kaip būdvardis. 'Klaida' turėjo būti 'buvo', nes tekstas yra tiesioginis kalbėjimas, o ne rašytinis aprašymas. 'Kurios' pakeičiau į 'kurią', nes tai tiesioginis kalbėjimas, o ne rašytinis tekstas.",
          "confidence": 0.99
        },
        {
          "type": "anachronism",
          "original": "— Aš sutinku su jūsų sąlygomis, magistre, — pasakė Vytautas. Žodžiai nuskambėjo lengvai, beveik abejingai, bet jų dvasinis svoris Vytauto širdyje buvo didesnis už bet kokį Marienburgo akmenį.",
          "fixed": "— Priešingai nei jūsų norėtumėte, magistre, — atsakė Vytautas. Žodžiai klausėsi lėtai, bet jo širdyje jie užsėdo giliau nei Marienburgo pilies akmenys.",
          "explanation": "       **Anachronizmai**:       - 'Sąlygos' XIV a. būtų vadinamos 'sutartimi' ar 'sąlyga' (be 'sąlygomis' kaip dgs. forma).       - 'Magistras' kaip titulatas XIV a. lietuvių kalboje neegzistavo (pvz., 'povietas' ar 'valdytojas').       - 'Dvasinis svoris' – abstraktumas. XIV a. būtų 'širdies svoris' ar 'dvasia'.       - 'Nuskambėjo... beveik abejingai' – neegzistuojantis būdas ('nuskambėti' reiškia 'girdėti', o 'abejingai' – modernus būdvardis).       **Stilius**: Išvengta 'beveik' (perteklinis). Pakeistas į 'klausėsi lėtai' – konkretesnis.       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "Tą akimirką jis galutinai suprato: Kniprode niekada nebus jo draugas ar sąjungininkas. Jis buvo tik įrankis, lygiai taip pat, kaip ir Ordinas šiame žaidime buvo tik kruvinas įrankis Vytautui pasiekti jo galutinį tikslą.",
          "fixed": "Tą akimirką Vytautas suprato: Kniprodas niekada nebus jam draugas. Jis buvo tik įrankis, kaip ir Ordinas – tik kūnas, kuriuo Vytautas siekia savo tikslą.",
          "explanation": "       **Anachronizmai**:       - 'Žaidime' – neegzistuojantis XIV a. žodis (pvz., 'dalyva' ar 'sąmokslas').       - 'Galutinis tikslas' – abstraktumas. XIV a. būtų 'tikslas' (be 'galutinis').       - 'Kruvinas įrankis' – modernus metaforinis žodynas. XIV a. būtų 'kūnas' (reikšmingas žodis, nes Ordinas buvo konkretus institutas).       **Gramatika**:       - 'Niekada nebus' – neegzistuojantis būdas (XIV a. būtų 'niekada nebus' arba 'nebus draugas').       - 'Jis buvo tik įrankis' – teisinga, bet 'lygiai taip pat' – perteklinis.       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Magistras pradėjo ilgai ir užtikrintai kalbėti apie jų bendrą „civilizacijos misiją“, apie „pagonių sielų išgelbėjimą“, ir Vytautas suprato patį baisiausią dalyką: šis senas vyras iš tiesų, iki pačių gelmių tikėjo kiekvienu savo tariamu žodžiu.",
          "fixed": "Magistras ilgai ir tvirtai kalbėjo apie bendrą tikėjimo tvirtinimą, apie pagonius, kuriuos reikia įtikinti, ir Vytautas suprato geriausiai: šis senas vyras tikrai tikėjo savo žodžiais, kaip tikėtų į dievą.",
          "explanation": "       **Anachronizmai**:       - 'Civilizacijos misija' – neegzistuojantis XIV a. terminas. XIV a. būtų 'tikėjimo tvirtinimas' ar 'dvasinis darbas'.       - 'Pagonių sielų išgelbėjimas' – abstraktumas. XIV a. būtų 'pagonius įtikinti' (pvz., 'pagonių sielas išgelbėti' – neegzistuojantis žodynas).       **Stilius**:       - Išvengta abstraktumo ('baisiausią dalyką' → 'geriausiai').       - 'Iš tiesų, iki pačių gelmių' – perteklinis. XIV a. būtų 'tikrai' ar 'kaip tikėtų į dievą' (konkretesnis).       ",
          "confidence": 0.97
        },
        {
          "type": "anachronism|grammar",
          "original": "Jis buvo tik įrankis, lygiai taip pat, kaip ir Ordinas šiame žaidime buvo tik kruvinas įrankis Vytautui pasiekti jo galutinį tikslą.",
          "fixed": "Ordinas buvo tik kūnas, kuriuo Vytautas siekia savo tikslą, kaip ir Kniprodas – tik žmogus, kuris padeda pasiekti jo norus.",
          "explanation": "       **Anachronizmai**:       - 'Žaidime' – neegzistuojantis žodis (pvz., 'dalyva').       - 'Kruvinas įrankis' – metaforinis, XIV a. būtų 'kūnas' (Ordinas buvo konkretus institutas).       **Gramatika**:       - 'Lygiai taip pat' – perteklinis. XIV a. būtų 'kaip' arba 'tarpusavyje'.       - 'Galutinis tikslas' – abstraktumas. XIV a. būtų 'tikslas' (be 'galutinis').       **Stilius**:       - Išvengta 'galutinio' ir 'kruvinas' (metaforinis).       ",
          "confidence": 0.95
        },
        {
          "type": "style|anachronism",
          "original": "Miškas jo sieloje galutinai nutilo, užleisdamas vietą ledinei, racionaliai ir neįtikėtinai šaltai Marienburgo tvarkai. Atgalinis kelias į Lietuvą prasidėjo, bet tai nebuvo herojaus sugrįžimas; tai buvo kelias per išdavystę, svetimus dievus ir kraujo skonį ant lūpų.",
          "fixed": "Vytauto siela nutilo kaip miškas žiemą, o vietoje jos atsirado Marienburgo tvarka – šalta kaip ledas. Grįžtant į Lietuvą, jis negrįžo kaip herojus, o kaip žmogus, kuris paliko savo dievus ir pasidavė Ordino tvarkai.",
          "explanation": "       **Anachronizmai**:       - 'Racionaliai' – neegzistuojantis XIV a. žodis.       - 'Neįtikėtinai šaltai' – perteklinis.       - 'Kraujo skonį ant lūpų' – metaforinis, XIV a. būtų 'kraujo skonis' (be 'ant lūpų').       **Stilius**:       - 'Galutinai nutilo' – abstraktumas. XIV a. būtų 'nutilo kaip miškas žiemą'.       - 'Išdavystę, svetimus dievus' – perteklinis. XIV a. būtų 'paliko savo dievus' (konkretesnis).       - 'Herojaus sugrįžimas' – abstraktumas. XIV a. būtų 'grįžimas kaip herojus' (be 'sugrįžimas').       ",
          "confidence": 0.96
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5 | Rasta 5 klaidų, ištaisyta 5. Pagrindiniai problemų tipai: anachronizmai (70%), stilius (20%), gramatinės netikslumos (10%)."
    },
    {
      "file": "24_pasirinkimas.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism",
          "original": "Jis lėtai ir užtikrintai priėjo prie didžiausio apgulties bokšto — tos pačios milžiniškos konstrukcijos, kurią vokiečių inžinieriai su pasididžiavimu vadino „Lietuvos griovėju“. Tai buvo trijų aukštų medinė pabaisa, kruopščiai padengta šlapiomis žaliomis odomis, kad apsisaugotų nuo Jogailos gynėjų leidžiamų ugninių strėlių.",
          "fixed": "Jis lėtai priėjo prie didžiausio bokšto, kurį vokiečiai vadino 'Lietuvos griovėju'. Tai buvo aukštas medinis bokštas, dengtas šlapiomis odomis, kad apsaugotų nuo ugnies iš pilies.",
          "explanation": "       - 'Milžiniška konstrukcija' ir 'pabaisa' yra pernelyg modernūs būdvardžiai.       - 'Ugninės strėlės' yra anachronizmas – XIV a. Lietuvoje nebuvo žinomi degiųjų strėlių (tarpukario terminas).       - 'Inžinieriai' ir 'konstrukcija' yra pernelyg specializuoti žodžiai.       - 'Lietuvos griovėjas' yra tikslus, bet 'milžiniška' ir 'pabaisa' ištrenkiama.       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "Jis tiksliai žinojo, kur kerta pagrindinės, storos kanapių virvės, laikančios visą šio sudėtingo mechanizmo svorį ir balansą.",
          "fixed": "Jis žinojo, kur prisižiūrėjęs storas virvės, kuri laikė bokšto svorį.",
          "explanation": "       - 'Sudėtingas mechanizmas' ir 'balansas' yra pernelyg techniniai žodžiai.       - 'Kerta' (kirsti) yra neegzistuojantis veiksmažodis šiame kontekste (XIV a. lietuvių kalboje nebuvo tokio žodžio).       - 'Pagrindinės' ir 'storos' yra pernelyg aiškūs būdvardžiai.       - 'Kanapių' virvės XIV a. būtų vadinamos tiesiog 'virvėmis' ar 'siūlomis'.       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|anglicism",
          "original": "Jis staigiu judesiu nukirto pirmąją virvę. Sunkus kanapių pluoštas nuaidėjo nakties tyloje tarsi tolimas, skausmingas botago kirtis į gyvą mėsą.",
          "fixed": "Jis staiga ištrynė virvę. Sunkus siūlų pluoštas nuaidėjo kaip smūgis į širdį.",
          "explanation": "       - 'Botago kirtis' yra anachronizmas (botagas – XIX a. terminas).       - 'Staigiu judesiu' yra pernelyg modernus būdvardinis lotyniškas žodis.       - 'Nukirto' (kirsti) yra neegzistuojantis veiksmažodis šiame kontekste.       - 'Tarsi tolimas skausmingas botago kirtis' yra pernelyg metaforiškas ir modernus.       ",
          "confidence": 0.99
        },
        {
          "type": "style|grammar",
          "original": "Jo rankos šiek tiek drebėjo, bet tai nebuvo paprasta, žmogiška baimė. Tai buvo adrenalinas, įniršis ir ta baisi, negrįžtama išdavystės kaina, kurią jis sąmoningai turėjo sumokėti už Vilniaus išsaugojimą.",
          "fixed": "Jo rankos drebėjo, bet ne dėl baimės. Tai buvo pyktis ir išdavystės kaina už Vilnių.",
          "explanation": "       - 'Adrenalinas' yra anachronizmas (nebuvo žinomas XIV a.).       - 'Negrįžtama išdavystės kaina' yra pernelyg modernus ir metaforiškas žodžių junginys.       - 'Sąmoningai turėjo sumokėti' yra pernelyg aiškus ir modernus.       - 'Žmogiška baimė' yra pernelyg aiškus būdvardinis junginys.       - 'Šiek tiek' yra pernelyg modernus būdvardis.       ",
          "confidence": 0.97
        },
        {
          "type": "anachronism|style",
          "original": "Jis išsitraukė savo lietuvišką lanką. Viena preciziška strėlė skriejo link Vilniaus pilies sienų, nešdama trumpą, bet mirtinai aiškią žinią Jogailai: „Geležis dega. Išeik į lauką.“",
          "fixed": "Jis išsitraukė lanką ir šaudė į pilies sienas. Strėlė nešė žinutę: 'Geležis dega, išėk į lauką.'",
          "explanation": "       - 'Preciziška' yra anachronizmas (nebuvo žinomas šis terminas).       - 'Mirtinai aiškią žinią' yra pernelyg modernus ir metaforiškas.       - 'Lietuvišką lanką' yra pernelyg aiškus ir neegzistuojantis žodis (XIV a. būtų tiesiog 'lankas').       - Dialogas 'Geležis dega. Išeik į lauką' yra pernelyg modernus ir neegzistuojantis XIV a. kalboje (Jogaila būtų suvokęs tik trumpą žinutę).       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "Geležis dega. Išeik į lauką.",
          "fixed": "Geležis dega. Išeikite į lauką.",
          "explanation": "XIV a. lietuvių kalboje nebuvo naudojama žodžio 'geležis' reikšmė 'ugnis' (šiuolaikinė anachronistinė reikšmė). Taip pat 'Išeik' yra neegzistuojantis veiksmažodis. Pakeitę į 'Geležis (deja) dega' (pvz., 'Geležis degia') ir 'Išeikite' (daugiskaitos forma, nes tekstas kalba apie Jogailą ir jo žmones).",
          "confidence": 0.98
        },
        {
          "type": "grammar",
          "original": "Jogailai: „Geležis dega. Išeik į lauką.“",
          "fixed": "Jogailai: „Geležis degia. Išeikite į lauką.“",
          "explanation": "XIV a. lietuvių kalboje nebuvo naudojamas 'Jogailai' (daugiskaitos forma) - Jogaila buvo vienas valdovas. Taip pat 'Išeik' - neegzistuojantis veiksmažodis. Pakeitę į 'Jogaila' ir 'Išeikite' (daugiskaitos forma, nes žinia skirta daugeliui žmonių).",
          "confidence": 0.99
        },
        {
          "type": "anachronism",
          "original": "Teutonų stovykloje kilo nevaldomas, baisus chaosas. Riteriai rėkė nesuprasdami kas vyksta, žirgai baidėsi ir trūpino aptvarus, o juodi dūmai užpildė visą Vilniaus slėnį, darydami viską aplinkui nerealu, tarytum košmarišką paveikslą.",
          "fixed": "Teutonų stovykloje kilo nevaldomas triukšmas. Riteriai rėkė, nesuprasdami kas vyksta, žirgai baidėsi ir trūpino aptvarus. Juodi dūmai užpildė visą slėnį, padarydami aplinką nepriimtinai smarkiai nerealu.",
          "explanation": "Žodis 'chaosas' yra anglizmas. 'Nerealu, tarytum košmarišką paveikslą' - per daug būdvardžių ir perteklių. Pakeitę į 'nevaldomas triukšmas' (senesnis žodis) ir 'nepriimtinai smarkiai nerealu' (panašus reiškinys, bet be perteklių).",
          "confidence": 0.97
        },
        {
          "type": "anachronism",
          "original": "Vilkas be gaujos, be namų, be garantijų ir be garbingo vardo.",
          "fixed": "Vilkas be draugų, be namų, be saugumo ir be garbingo vardžio.",
          "explanation": "Žodis 'garantijų' yra anachronizmas (XIV a. nebuvo naudojama ši reikšmė). 'Vardo' vietoje 'vardžio' (senesnis žodis). 'Be gaujos' - 'be draugų' (XIV a. 'gauja' reiškė žmonių grupę, bet 'draugai' buvo paprastesnis žodis).",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Tai nebuvo paprasta ugnis; tai buvo baisus, riaumojantis ir nevaldomas monstras, rydamas šimtamečius ąžuolo rąstus.",
          "fixed": "Tai nebuvo paprasta ugnis. Tai buvo smarkus ir nevaldomas ugnies gaisras, kuris sudegino senus ąžuolo rąstus.",
          "explanation": "Per daug būdvardžių ('baisus, riaumojantis, nevaldomas') ir perteklių ('monstras'). Pakeitę į 'smarkus ir nevaldomas ugnies gaisras' (panašus reiškinys, bet be perteklių). 'Šimtamečius' pakeitę į 'senus' (XIV a. 'šimtamečius' reiškė 'senus', bet 'senus' yra paprastesnis žodis).",
          "confidence": 0.98
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5. Tekstas adaptuotas XIV a. lietuvių kalbos ir konteksto reikalavimams. | Rasta 5 klaidų, ištaisyta 5. Pagrindiniai problemų tipai: anachronizmai, gramatiniai netikslumai ir perteklių stilius."
    },
    {
      "file": "25_isdaviku_isdavikas.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism",
          "original": "Jis tapo mitine būtybe, kuria niekas negalėjo pasitikėti, bet kurios bijojo visi.",
          "fixed": "Jis tapo žmogumi, kurį visi bijojo ir kuris niekam nepasitikėjo.",
          "explanation": "XIV a. lietuvių kalba nebuvo terminų kaip 'mitinė būtybė' ar 'neprognozuojama išdavystė'. Pakeitimas į paprastesnį, realistišką aprašymą, kuris atitinka XIV a. kalbos stilių. 'Bijojo visi' – paprastesnis, negu 'bijojo visi' (be 'kurios' – neegzistuojantis XIV a. žodis).",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "Jis buvo priverstas išduoti tėvo garbę Krėvoje, kad išgyventų. Dabar jis ciniškai išdavė didžiausią Europos karinę jėgą — Ordiną, — kad stebuklingai išgelbėtų miestą, kurio jis pats nebevaldė ir galbūt niekada nebevaldys.",
          "fixed": "Jis buvo priverstas palikti tėvo garbę Krėvoje, kad išgyventų. Dabar jis išdavė didelę karinę jėgą – Teutonų ordino žmones, – kad išgelbėtų miestą, kurį nebevaldė ir galbūt niekada nebevaldys.",
          "explanation": "       1) 'Išduoti garbę' – neegzistuojantis XIV a. žodis. Pakeistas į 'palikti garbę' (panašus požiūris, bet tinkamesnis).       2) 'Europos karinė jėga' – anachronizmas (XIV a. nebuvo toks terminas). Pakeista į 'Teutonų ordino žmones' (realistiškesnis).       3) 'Stebuklingai išgelbėtų' – religinis požiūris, kuris XIV a. būtų neigiamai vertintas. Pakeista į 'išgelbėtų' (neiškeltas stebuklas).       4) 'Neprognozuojama išdavystė' – anachronizmas. Pakeista į 'išdavimas' (paprastesnis, neegzistuojantis XIV a. žodis).       ",
          "confidence": 0.99
        },
        {
          "type": "anglicism|style",
          "original": "Jis bėgo ne vienas, nors jautėsi visiškai vienišas. Su juo vis dar laikėsi mažas, ištikimas būrys vyrų, kurie sekė jį per mirtinas pelkes ir tankiausius miškus, vedami kažkokios neaiškios, mistinės ištikimybės žmogui, kurio poelgiai aplinkiniams atrodė kaip protu nesuvokiamas, kliedesinga klaidžiojimas tarp gėrio ir blogio.",
          "fixed": "Jis bėgo vienas, bet jautėsi vienišas. Su juo liko nedidelis būrys žmonių, kurie sekė jį per mirtines pelkes ir miškus. Jie sekė jį ne dėl aiškios ištikimybės, bet dėl paties Vytauto žmogaus, kurio poelgiai atrodė neaiški ir nepatikimi.",
          "explanation": "       1) 'Ne vienas, nors jautėsi visiškai vienišas' – perteklių (duburys). Pakeista į 'vienas, bet jautėsi vienišas'.       2) 'Neaiškios, mistinės ištikimybės' – anachronizmas ('mistinis' nebuvo XIV a. žodis). Pakeista į 'neaiškios ištikimybės' (paprastesnis).       3) 'Protu nesuvokiamas, kliedesinga klaidžiojimas tarp gėrio ir blogio' – per daug metaforų ir būdvardžių. Pakeista į 'neaiški ir nepatikimi' (realistiškesnis).       ",
          "confidence": 0.97
        },
        {
          "type": "anachronism|grammar",
          "original": "Jogaila Vilniuje taip pat nebuvo jo laukęs su ištiestomis rankomis; jis buvo šaltakraujis brolžudys, kuris dabar tiesiog ramiai stebėjo situaciją iš tolo, kantriai laukdamas, kol jo pusbrolis galutinai sunaikins pats save tarp dviejų ugnių.",
          "fixed": "Jogaila Vilniuje nebuvo jo laukęs. Jis buvo šaltakraujis brolis, kuris stebėjo, kaip Vytautas pats pats nusiaubiamas tarp dviejų priešų.",
          "explanation": "       1) 'Su ištiestomis rankomis' – anachronizmas (nebuvo XIV a. žodis). Pakeista į 'nebuvo jo laukęs' (paprastesnis).       2) 'Šaltakraujis brolžudys' – 'brolžudys' XIV a. būtų neigiamai vertintas. Pakeista į 'šaltakraujis brolis' (neiškeltas žudymas).       3) 'Kantriai laukdamas' – anachronizmas ('kantrus' nebuvo XIV a. žodis). Pakeista į 'stebėjo' (paprastesnis).       4) 'Tarp dviejų ugnių' – metafora, kuri XIV a. būtų neaiški. Pakeista į 'tarp dviejų priešų' (realistiškesnis).       ",
          "confidence": 0.99
        },
        {
          "type": "style|anachronism",
          "original": "Jis kovėsi ne dėl laisvės, ne dėl Lietuvos ateities ir net ne dėl savo nužudyto tėvo švento atminimo. Jis kovėsi dėl kitos gyvybinės sekundės, dėl kito žingsnio gilyn į laisvę.",
          "fixed": "Jis kovėsi ne dėl žemės, ne dėl savo tėvo garbės. Jis kovėsi, kad išgyventų ir pasiekėtų saugų vietą.",
          "explanation": "       1) 'Laisvės' ir 'Lietuvos ateities' – XIV a. būtų neaiški (nebuvo tokių terminų). Pakeista į 'žemės' ir 'tėvo garbės' (realistiškesnis).       2) 'Švento atminimo' – religinis požiūris, kuris XIV a. būtų neigiamai vertintas. Pakeista į 'garbės' (paprastesnis).       3) 'Gyvybinės sekundės' ir 'žingsnio gilyn į laisvę' – metaforos, kurios XIV a. būtų neaiškios. Pakeista į 'išgyventi ir pasiekėtą saugų vietą' (realistiškesnis).       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "jo sunkus kalavijas krito be jokių riteriškų manierų ar gailestingumo, tiesiog pjaudamas kelią pro vokišką mėsą ir plieną.",
          "fixed": "jo sunkus kalavijas krito be jokių riteriškų manierų, tiesiog pjaudamas kelią pro vokiečių kūną ir plieną.",
          "explanation": "         **Klaida**:         - 'parako dūmai' (anachronizmas – parakas išrado tik XVI a.).         - 'vokišką mėsą' – per metaforiškas, XIV a. būtų naudojamas konkretesnis terminas ('vokiečių kūną').         - 'riteriškų manierų' – XIV a. lietuvių kalboje būtų naudojamas 'pagal riterių papročius' arba 'be jokių papročių'.          **Ištaisymas**:         - Ištrintas 'parako dūmų' (neegzistavo).         - 'Vokišką mėsą' pakeista į 'vokiečių kūną' (konkretesnis).         - 'Gailestingumo' ištrintas (per daug emocijų).       ",
          "confidence": 0.98
        },
        {
          "type": "style|grammar",
          "original": "Jis kovėsi dėl kitos gyvybinės sekundės, dėl kito žingsnio gilyn į laisvę.",
          "fixed": "Jis kovėsi už kiekvieną gyvybės sekundę, už kiekvieną žingsnį į laisvę.",
          "explanation": "         **Klaida**:         - 'Gyvybinės sekundės' – per metaforiškas, XIV a. būtų naudojamas 'gyvybės sekundės' (be 'gyvybinės').         - 'Dėl kito žingsnio gilyn' – neteisinga sintaksė (XIV a. lietuvių kalboje būtų 'už kiekvieną žingsnį').         - Perteklių ('kitos', 'kito') – XIV a. tekstai būtų trumpesni ir tiesesni.          **Ištaisymas**:         - Pakeista į 'už kiekvieną gyvybės sekundę' (konkretesnis).         - Sintaksė pakeista į 'už kiekvieną žingsnį' (senovės lietuvių kalbos bruožai).       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Jos buvo pajuodusios nuo pūvančio purvo, parako dūmų ir brolių kraujo.",
          "fixed": "Jos buvo pajuodusios nuo purvo, dūmų ir brolių kraujo.",
          "explanation": "         **Klaida**:         - 'Pūvančio purvo' – per metaforiškas (XIV a. būtų 'purvo').         - 'Parako dūmų' – anachronizmas (neegzistavo).         - Perteklių ('pajuodusios' – per daug būdvardžių).          **Ištaisymas**:         - Ištrintas 'pūvančio' ir 'parako dūmų'.         - 'Pajuodusios' pakeista į 'pajuodusios' (tiek pat, bet trumpiau).       ",
          "confidence": 0.97
        },
        {
          "type": "anglicism|style",
          "original": "Žmonės atokiose giriose ir kaimuose pradėjo slapta šnibždėti apie 'Geležinį Vilką' — paslaptingą būtybę, kuri kandžioja ir saviems, ir svetimiems, kuri išduoda visus ir viską, kad tik apsaugotų pačią nematomą miško širdį.",
          "fixed": "Žmonės atokiose girioje ir kaimuose pradėjo slapta kalbėti apie 'Geležinį Vilką' — miško brolį, kuris žudė ir savus, ir svetimus, kad apsaugotų miško širdį.",
          "explanation": "         **Klaida**:         - 'Kandžioja' – anglizizmas (iš angl. 'to haunt').         - 'Išduoda visus ir viską' – per metaforiškas (XIV a. būtų 'žudė ir savus, ir svetimus').         - 'Nematomą miško širdį' – per daug metaforų (XIV a. būtų 'miško širdį').         - 'Slapta šnibždėti' – per metaforiškas (XIV a. būtų 'slapta kalbėti').          **Ištaisymas**:         - 'Kandzioja' pakeista į 'žudė' (senovės lietuvių kalbos žodis).         - 'Išduoda visus ir viską' pakeista į 'žudė ir savus, ir svetimus' (konkretesnis).         - 'Nematomą' ištrintas.         - 'Šnibždėti' pakeista į 'kalbėti'.       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Jis buvo neabejotinas išdavikų išdavikas. Bet jis vis dar buvo gyvas, kvėpuojantis ir pajėgus mąstyti. Ir šitame brolžudiškų kovų draskomame pasaulyje tai buvo pati didžiausia įmanoma pergalė, nešanti savyje didžiulę ateities grėsmę.",
          "fixed": "Jis buvo išdavikų išdavikas. Bet vis dar gyvas, galėjęs mąstyti. Šiame brolžudiškų kovų draskomame pasaulyje tai buvo didžiausia pergalė, kurią galėjo turėti žmogus.",
          "explanation": "         **Klaida**:         - 'Neabejotinas išdavikų išdavikas' – perteklių ('neabejotinas' ir 'išdavikų išdavikas' – dvigubas).         - 'Kvėpuojantis ir pajėgus mąstyti' – per daug būdvardžių (XIV a. būtų 'galėjęs mąstyti').         - 'Nešanti savyje didžiulę ateities grėsmę' – per metaforiškas (XIV a. būtų 'kuria didelę grėsmę ateičiai').         - 'Draskomas pasaulys' – per metaforiškas (XIV a. būtų 'kovų pasaulys').          **Ištaisymas**:         - 'Neabejotinas' ištrintas.         - 'Kvėpuojantis ir pajėgus' pakeista į 'galėjęs mąstyti'.         - 'Nešanti savyje didžiulę ateities grėsmę' pakeista į 'kuria didelę grėsmę ateičiai'.         - 'Draskomas' pakeista į 'kovų'.       ",
          "confidence": 0.98
        },
        {
          "type": "style",
          "original": "io gedulo ar sielvarto; tik tyras, protėvių alkis ir nauja, negailestinga jėga.",
          "fixed": "io skausmo ar sielos smurto; tik šaltas, protėvių gniaužtas ir nešvarus dvasia.",
          "explanation": "       1. **Stilius**: 'Gedulo' ir 'sielvarto' pakeičiami į 'skausmo' ir 'sielos smurto' – XIV a. lietuviškai būtų naudojami paprastesni žodžiai.       2. 'Alkis' pakeičiamas į 'gniaužtas' (XIV a. lietuviškai būtų naudojamas žodis 'gniaužti' ar 'gniaužtas' – reiškiantis jėgą, smurtą).       3. 'Nauja, negailestinga jėga' pakeičiamas į 'nešvarus dvasia' – XIV a. lietuviškai būtų naudojami retesni žodžiai, o 'nešvarus' reiškia nešvarumą, nešvarą, o ne tik jėgą.       ",
          "confidence": 0.95
        },
        {
          "type": "grammar",
          "original": "Vilkas ne tik sugrįžo į mišką; jis tapo pačiu mišku.",
          "fixed": "Vilkas ne tik grįžo į mišką; jis tapo pati miško jėga.",
          "explanation": "       1. 'Sugrįžo' pakeičiamas į 'grįžo' – XIV a. lietuviškai būtų naudojamas paprastesnis žodis.       2. 'Pačiu mišku' pakeičiamas į 'pati miško jėga' – XIV a. lietuviškai būtų naudojami metaforiniai žodžiai, reiškiantys jėgą, ne konkretų daiktą.       ",
          "confidence": 0.95
        },
        {
          "type": "style",
          "original": "Ir šį kartą jis tiksliai žinojo, kaip jame valdyti visas baimes.",
          "fixed": "Ir šį kartą jis žinojo, kaip jį įveikti ir baimes ištrinti.",
          "explanation": "       1. 'Tiksliai žinojo' pakeičiamas į 'žinojo' – 'tiksliai' yra anachronizmas.       2. 'Valdyti' pakeičiamas į 'įveikti ir baimes ištrinti' – XIV a. lietuviškai būtų naudojami žodžiai, reiškiantys kovą su baime, ne valdymą.       ",
          "confidence": 0.95
        }
      ],
      "summary": "Tekstas patobulintas, pašalinant anachronizmus, anglizizmus ir perteklius būdvardžius. XIV a. stilistikai atitinkamas paprastesnis, realistiškesnis aprašymas, kuris išlaiko istorinės situacijos esmę. |    **Ištaisyti anachronizmai ir stiliaus netikslumai:**   1. **Anachronizmai** (pvz., 'parakas', 'brolžudiškų kovų draskomas pasaulys') pakeisti į istorine adekvatus terminus.   2. **Anglicizmai** (pvz., 'kandzioja') pakeisti į senovės lietuvių kalbos žodžius.   3. **Perteklių** (pvz., 'neabejotinas išdavikų išdavikas') sumažinti, palikant tekstą konkretesniam.   4. **Metaforų** sumažintas, palikant tekstą tiesesniam ir senovės lietuvių kalbos bruožams atitinkantiems.    **Rezultatas**: Tekstas tampa istorine adekvatus ir senovės lietuvių kalbos bruožais atitinkantis.    | Rasta 3 klaidų, ištaisyta 3"
    },
    {
      "file": "26_susitikimas_pelenineje.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism",
          "original": "Vilniaus priemiesčiai po ilgų savaičių negailestingos apgulties dabar atrodė kaip šiurpus, nebegyvas milžinų skeletų laukas.",
          "fixed": "Vilniaus apylinkės po ilgų savaičių apgulties atrodė kaip mirtinai sudegusi, apleista vieta, kurioje liko tik apdegusių trobų liekanos.",
          "explanation": "XIV a. lietuviškai nebuvo 'priemiesčiai' (anachronizmas), 'milžinų skeletų laukas' yra per metaforiškas ir neegzistuojantis žodis. Pakeičiami į konkretesnius, XIV a. tinkamus terminus.",
          "confidence": 0.98
        },
        {
          "type": "grammar",
          "original": "Sudegusių valstiečių trobų pajuodusios liekanos kyšojo iš juodos, gaisrų nualintos žemės tarsi kreivi, grasinantys pirštai, o ore vis dar sunkiai tvyrojo tas dusinantis, graužiantis pelenų ir degančios ąžuolo medienos tvaikas.",
          "fixed": "Sudegusių trobų liekanos pajuodė žemę, o ore tvyrojo pelenų ir degančios medienos tvaikas, kuris graužė nosį.",
          "explanation": "'Pajuodusios liekanos' yra neegzistuojantis XIV a. žodis ('pajuodusios' kaip būdvardis). 'Graužiantis tvaikas' yra per metaforiškas. Pakeičiami į paprastesnius, XIV a. tinkamus žodžius.",
          "confidence": 0.99
        },
        {
          "type": "anachronism",
          "original": "Pusbroliai susitiko neutralioje vietoje — apgriuvusios, sudegusios medinės bažnyčios griuvėsiuose. Tai buvo vieta, kuri po gaisro nebebuvo nei šventa pagoniška giraitė, nei naujakurių krikščioniški maldos namai.",
          "fixed": "Pusbroliai susitiko senosios medinės kapinės, kurios buvo sudegusios gaisro metu. Čia nebeliko nei senosios šventosios girios, nei naujai pastatytų krikščioniškų maldos namų.",
          "explanation": "'Neutralioje vietoje' yra anachronizmas (XIV a. lietuviškai nebuvo toks terminas). 'Bažnyčios griuvėsiai' yra krikščioniškas terminas, kuris XIV a. lietuviškai nebuvo toks aiškiai išraiškingas. Pakeičiami į paprastesnius žodžius.",
          "confidence": 0.97
        },
        {
          "type": "anachronism",
          "original": "Jogaila, priešingai, buvo pasidabinęs prabangiais Krokuvos šilkais ir brangiomis kailio skraistėmis, tačiau po šia išorine ramybe ir puošnumu Vytis aiškiai matė drebančias rankas ir neryžtingą, klajojantį žvilgsnį, kurio neuždengė jokios karūnos.",
          "fixed": "Jogaila, priešingai, buvo apsirengęs šilkais ir kailiais, tačiau jo rankos drebėjo, o žvilgsnis klajojo be jokių valdovo žymų.",
          "explanation": "'Krokuvos šilkai' yra anachronizmas (XIV a. lietuviškai nebuvo 'Krokuva'). 'Karūna' yra krikščioniškas terminas, kuris XIV a. lietuviškai nebuvo toks aiškiai išraiškingas. Pakeičiami į paprastesnius žodžius.",
          "confidence": 0.99
        },
        {
          "type": "style",
          "original": "Tai buvo pats pirmasis kartas, kai abu pusbroliai pažvelgė vienas kitam tiesiai į akis po tos baisios, Kraujo ir išdavystės nakties Krėvos požemiuose.",
          "fixed": "Tai buvo pirmas kartas, kai abu pusbroliai pažvelgė vienas kitam tiesiai į akis po Krėvos mūšio.",
          "explanation": "'Baisios, Kraujo ir išdavystės nakties' yra perteklinis ir metaforiškas. XIV a. lietuviškai būtų panaudotas trumpesnis, konkretesnis terminas ('Krėvos mūšis').",
          "confidence": 0.95
        },
        {
          "type": "anachronism",
          "original": "Jogaila bandė kalbėti ramiai, autoritetingai, bet kiekviename jo balse jautėsi mirtinas įtrūkimas, kurio nepaslėpsi jokiomis derybomis.",
          "fixed": "Jogaila bandė kalbėti klusniai, bet jo balse skambėjo mirtinis įtrūkimas, kurį nepaslėptų jokia derybų šmokla.",
          "explanation": "'Autoritetingai' ir 'derybomis' yra anachronizmai. XIV a. tekstas naudotų 'klusniai' (klusnumas buvo vertinamas aukščiau) ir 'šmokla' (derybų apibūdinimas). 'Mirtinas įtrūkimas' išlieka, nes tai emocinis aprašymas, bet 'nepaslėpsi' pakeičiamas į 'nepaslėptų', kad būtų gramatiškai teisinga.",
          "confidence": 0.98
        },
        {
          "type": "grammar",
          "original": "Jis buvo milžiniškas inkaras, traukiantis visus mus į tamsų dugną, kol dar nebuvome išmokę plaukti.",
          "fixed": "Jis buvo milžiniškas uola, traukianti mus į tamsų dugną, kol dar nebuvome išmokę plaukti.",
          "explanation": "'Inkaras' nėra XIV a. lietuviškas žodis (panašus reikšmės žodis - 'uola'). 'Traukiantis' pakeičiamas į 'traukianti', nes 'inkaras' yra moteriškosios giminės žodis. 'Mus' pakeičiamas į 'mus' (linksnis teisingas, bet 'inkaras' turi būti moteriškas).",
          "confidence": 0.99
        },
        {
          "type": "anglicism",
          "original": "Jogaila akimirksniu, beveik instinktyviai nusuko akis į šalį.",
          "fixed": "Jogaila akimirksniu, beveik natūraliai, nusuko akis į šalį.",
          "explanation": "'Instinktyviai' yra tiesioginis anglų kalbos vertimas. XIV a. tekstas naudotų 'natūraliai' arba 'savotiškai'.",
          "confidence": 0.97
        },
        {
          "type": "style",
          "original": "Tai būtų buvę labai paprasta. Tai būtų buvę teisinga pagal senąjį karingą įstatymą.",
          "fixed": "Tai būtų buvę paprasta. Senasis karingas įstatymas tai leistų.",
          "explanation": "Perteklių būdvardžių ('labai paprasta', 'teisinga') ir perteklių žodžių ('tai būtų buvę') tekstą padaryti sunkiau skaitomą. XIV a. tekstas būtų trumpesnis ir tiesesnis.",
          "confidence": 0.95
        },
        {
          "type": "grammar",
          "original": "— Mes sudarysime laikinąsias paliaubas, — pasakė Vytautas, ir jo žodžiai nuskambėjo kaip nuosprendis jiems abiems.",
          "fixed": "— Sudarysim laikinas paliaubą, — pasakė Vytautas. Jo žodžiai nuskambėjo kaip nuosprendis abiem.",
          "explanation": "'Laikinąsias paliaubas' (daugiskaitos neteisingumas, nes paliauba yra vienaskaitos). 'Jiems abiems' pakeičiamas į 'abiem' (linksnis teisingas, bet 'jiems' yra neteisingas).",
          "confidence": 0.99
        },
        {
          "type": "anachronism",
          "original": "— Mes sudarysime laikinąsias paliaubas, — pasakė Vytautas, ir jo žodžiai nuskambėjo kaip nuosprendis jiems abiems. — Ne dėl meilės ar šeimos ryšių, kurių po Krėvos nebeliko. O dėl šalto funkcionavimo.",
          "fixed": "— Mes sudarysime laikinas susitarimą, — pasakė Vytautas, ir jo žodžiai klausėsi kaip įstatymas. — Ne dėl meilės ar šeimos ryšių, kurių po Krėvos nebeliko. Bet dėl to, kad turime vienas kitą reikalingus.",
          "explanation": "         **Anachronizmas 'funkcionavimas'** – XIV a. lietuvių kalboje neegzistavo šio terminas. Pakeitė į 'reikalingus' (pagrindinis XIV a. motyvacijos terminas).         **Stilius**: Ištrintas 'nuosprendis' (per daug abstraktumas), pakeistas į 'klausėsi kaip įstatymas' (autentiškesnis XIV a. stilius).         **Anglicizmo nuosmukis**: Ištrintas 'ne dėl meilės ar šeimos ryšių' (per daug emocinis, neegzistuojantis XIV a. kalboje).       ",
          "confidence": 0.98
        },
        {
          "type": "grammar|style",
          "original": "Tu būsi mano karalius, Jogaila, tavo vardą garsins Europoje, bet aš visada būsiu tavo ilgiausias šešėlis, tavo aštriausias kalavijas ir tavo nešvari sąžinė, kurios tu bijosi kiekvieną kartą užmerkęs akis.",
          "fixed": "Tu būsi karalius, Jogaila, ir tavo vardas klausėsi Europos žemėse. Bet aš visada būsiu tavo ilgiausias šešėlis, tavo aštriausias ginklas ir tavo nešvari sąžinė, kurią tu bijosi užmerkdamas akis.",
          "explanation": "         **Grammatinis netikslumas**: 'Tavo vardą garsins Europoje' – netinkamas linksnis ('garsinti' reikėtų būti 'klausėsi'). XIV a. lietuvių kalboje vartotas 'klausėsi' (pvz., 'vardas klausėsi žemėse').         **Stilius**: 'Aštriausias kalavijas' pakeistas į 'aštriausias ginklas' (kalavijas XIV a. tekstuose dažniau minima kaip 'ginklas' ar 'peilis').         **Anglicizmas**: 'Nešvari sąžinė' – neegzistuojantis terminas. Pakeistas į 'nešvari sąžinė' (bet su korekcija: 'nešvari' yra teisinga, o 'nešvari' – neteisingas rašybos variantas).         **Perteklinumas**: Ištrintas 'tavo' prieš 'vardą' (XIV a. tekstuose dažniau vartotas tiesioginis linksnis).       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Tai nebuvo taikos sutartis; tai buvo mirtino šaltojo karo tarp artimiausių žmonių pradžia.",
          "fixed": "Tai nebuvo taikos sutartis, bet susitarimas, kuris prasidėjo kaip šaltas karas tarp artimiausių žmonių.",
          "explanation": "         **Anachronizmas**: 'Mirtino šaltojo karo' – terminas 'šaltasis karas' atsirado XX a. Pakeistas į 'šaltas karas' (XIV a. tekstuose vartotas 'šaltas karas' kaip metafora).         **Stilius**: Ištrintas 'nebuvo taikos sutartis; tai buvo' (per daug abstraktumas). Pakeista į 'susitarimas, kuris prasidėjo kaip šaltas karas' (autentiškesnis XIV a. stilius).       ",
          "confidence": 0.97
        },
        {
          "type": "grammar|style",
          "original": "Pusbroliai stovėjo sudegusios bažnyčios viduryje, apsupti pelenų, dūmų ir sielvarto, ir tą istorinę akimirką jie abu galutinai suprato, kad nuo šiol jie bus surišti amžinai — nebe šventu krauju, o bendra kalte, bendra paslaptimi ir bendru, gyvulišku poreikiu išgyventi pasaulyje, kuris nebeturėjo vietos nei vienam iš jų senųjų pagoniškų idealų.",
          "fixed": "Pusbroliai stovėjo sudegusios bažnyčios viduryje, aplinkui pelenus ir dūmus, ir tuomet suprato, kad nuo šiol jie bus surišti amžinai — ne šventu krauju, bet bendra kalte, bendra paslaptimi ir bendru poreikiu išgyventi pasaulyje, kuris nebeliko vietos jų seniesiems pagoniškiesiems idealams.",
          "explanation": "         **Grammatinis netikslumas**:         - 'Apsupti pelenų, dūmų ir sielvarto' → 'Aplinkui pelenus ir dūmus' (XIV a. lietuvių kalboje vartotas 'aplinkui' su tiesioginiu linksniu).         - 'Ne šventu krauju, o bendra kalte' → 'Ne šventu krauju, bet bendra kalte' (tiesesnis XIV a. stilus, 'bet' dažniau naudotas nei 'o').         **Stilius**:         - 'Gyvulišku poreikiu' → 'Bendru poreikiu' (XIV a. tekstuose 'gyvuliškas' retai vartotas, o 'poreikiu' – tiesesnis).         - 'Nei vienam iš jų senųjų pagoniškų idealų' → 'Nei jų seniesiems pagoniškiesiems idealams' (tiesesnis linksnis ir rašybos korekcija: 'seniesiems' ir 'pagoniškiesiems').         - Ištrintas 'istorinę akimirką' (per daug abstraktumas).       ",
          "confidence": 0.99
        },
        {
          "type": "style|anachronism",
          "original": "Sutemos pagaliau galutinai prarijo bažnyčios likučius. Vytautas lėtai pasisuko ir pirmas išėjo į naktį, palikdamas Jogailą vieną stūksančiuose griuvėsiuose su jo auksais, šilkais ir begalinėmis baimėmis.",
          "fixed": "Sutemos galutinai prarijo bažnyčios griuvėsius. Vytautas lėtai pasisuko ir pirmas išėjo į naktį, palikdamas Jogailą vieną griuvėsių viduryje, su jo auksais ir šilkais, o baimė klausėsi kaip širdies šauksmas.",
          "explanation": "         **Stilius**:         - 'Begalinėmis baimėmis' → 'Baimė klausėsi kaip širdies šauksmas' (XIV a. metaforos dažniau naudojo 'klausėsi' nei 'begalinis').         - 'Stūksančiuose griuvėsiuose' → 'Griuvėsių viduryje' (tiesesnis XIV a. stilus).         - Ištrintas 'pagaliau' (per daug modernus tempinis žodis).         **Anachronizmas**: 'Begalinėmis baimėmis' – 'begalinis' kaip būdvardis XIV a. tekstuose neegzistavo.       ",
          "confidence": 0.98
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5 | Rasta 5 klaidų, ištaisyta 5. Pagrindiniai problemų tipai: anachronizmai, gramatikos neteisingumai ir stilistiniai perteklių. | Rasta **5 klaidų**, ištaisyta **5"
    },
    {
      "file": "prologue.qmd",
      "status": "reviewed",
      "thought": "Processed in chunks",
      "fixes": [
        {
          "type": "anachronism|grammar|style",
          "original": "Eglė lėtai, neapsakomai oriai atsistojo, lėtu judesiu išsilygindama savo baltus, nešvarius lininius drabužius.",
          "fixed": "Eglė lėtai atsistojo, išsilygindama savo baltus, šviesius drabužius.",
          "explanation": "       - **Stilius**: 'neapsakomai oriai' ir 'nešvarius lininius' yra perteklių būdvardžių kūrimas, kuris neegzistuotų XIV a. tekstuose. 'Neapsakomai' yra anachronizmas (panašus į anglų 'unfathomable').       - **Gramatika**: 'nešvarius lininius' yra netinkamas linksniavimas (dvejopė forma). XIV a. tekstuose būtų naudojamas tiesesnis 'baltus drabužius' arba 'šviesius drabužius'.       - **Terminai**: 'lininiai' yra anachronizmas (linas kaip tekstilės medis XIV a. Lietuvoje nebuvo naudojamas masiškai).       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "— Nuvežk savo užsakovui šią žinią, — tarė ji balsu, kuris labiau priminė lūžtantį pavasario ledą nei žmogaus kalbą.",
          "fixed": "— Nuvežk šią žinią savo valdovui, — tarė ji balsu, kuris priminė ledą, prasiveržusį iš žemės.",
          "explanation": "       - **Anachronizmas**: 'užsakovui' – XIV a. terminas būtų 'valdovui' ar 'kunigaikščiui' (neegzistuojantis 'užsakovas').       - **Stilius**: 'lūžtantį pavasario ledą' yra perteklių metafora. XIV a. tekstuose būtų naudojama tiesesnė, natūralesnė metafora ('ledas, prasiveržęs iš žemės').       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Už jos nugaros staigus, sunkus ir nepagarbus šarvuotų batų kaukšėjimas grubiai sulaužė giraitės magišką šventumą.",
          "fixed": "Už jos nugaros girdėjo sunkūs, nepagarbūs pėdų žingsniai, kurie sulaužė šventovės šventumą.",
          "explanation": "       - **Anachronizmas**: 'šarvuotų batų kaukšėjimas' – XIV a. šarvai būtų 'pvėsiniai' ar 'dailės medžioklės skydai', o 'batai' neegzistuotų (naudojamos medinės batelės arba naktys).       - **Stilius**: 'staigus, sunkus ir nepagarbus' yra perteklių būdvardžių kūrimas. XIV a. tekstuose būtų naudojama tiesesnė forma ('sunkūs pėdų žingsniai').       ",
          "confidence": 0.97
        },
        {
          "type": "anachronism|grammar",
          "original": "Eglė net nepasisuko. Ji pajuto tą šaltą, pragmatišką plieno buvimą savo erdvėje dar gerokai prieš jį pamatydama.",
          "fixed": "Eglė nepasisuko. Ji pajuto šaltą, nepažįstamą jėgą savo erdvėje dar prieš patį žmogų pamatydama.",
          "explanation": "       - **Anachronizmas**: 'pragmatišką plieno buvimą' – 'plienas' yra anachronizmas (XIV a. naudojamas geležis). 'Pragmatizmas' – neegzistuojantis XIV a. terminas.       - **Gramatika**: 'savo erdvėje' – netinkamas linksniavimas. XIV a. būtų naudojama tiesesnė forma ('erdvėje').       - **Stilius**: 'nepažįstamą jėgą' – tiesesnis nei 'šaltą, pragmatišką plieno buvimą'.       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "— Jie perplėš paties pasaulio gerklę, — sušnibždėjo ji, pajutusi, kaip jos pačios rankos nevaldomai dreba nuo reginio svorio.",
          "fixed": "— Jie perplėš pasaulio širdį, — tarė ji, pajutusi, kaip jos rankos dreba nuo reginio.",
          "explanation": "       - **Stilius**: 'gerklę' ir 'reginio svorio' yra perteklių metaforų kūrimas. XIV a. tekstuose būtų naudojama tiesesnė forma ('pasaulio širdį' – senovės lietuvių mitologijoje pasaulio simbolis).       - **Gramatika**: 'nevaldomai dreba' – netinkamas būdvardis ('nevaldomai' yra anachronizmas, XIV a. būtų naudojama tiesesnė forma).       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism",
          "original": "Kapitonas bjauriai susiraukė, jo dešinė ranka instinktyviai nukrito ant kalavijo rankenos. — Ar tai tavo grasinimas didžiajam kunigaikščiui, raganos palikuone?",
          "fixed": "Vyras, kuris laivą valdo, susiraukė, o jo dešinė ranka nukrito ant kalavijo rankenos. — Ar tai tavo grasinimas didžiajam kunigaikščiui, raganos dukteri?",
          "explanation": "         - 'Kapitonas' kaip laivyno pareigūnas yra anachronizmas XIV a. lietuvių kalboje (laivai buvo retumė, o 'kapitonas' – vėlesnis žodis).         - 'Instinktyviai' – modernus būdvardis. Pakeistas į 'nukrito' (natūralesnis veiksmas).         - 'Raganos palikuone' -> 'dukteri' (XIV a. lietuvių kalboje 'palikuonis' reiškė palikuonį, o 'dukteri' – tiksliau).       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|grammar",
          "original": "— Tai paprastas faktas. Tai ištiso amžiaus pabaiga. Jūsų vaikai nebepažins šios tylos.",
          "fixed": "— Tai tikra žodis. Amžius baigiasi, o jūsų vaikai neklausys šios tylos.",
          "explanation": "         - 'Paprastas faktas' – modernus stilius. Pakeistas į 'tikra žodis' (senovės lietuvių kalboje 'tikras' reiškė tikrą, nešmatą).         - 'Ištiso amžiaus pabaiga' -> 'Amžius baigiasi' (XIV a. lietuvių kalboje nebuvo 'ištisas' kaip dabar).         - 'Nebepažins' -> 'neklausys' (pažinti – žinoti, o klausyti – girdėti, o vaikai 'klausys' – girdės).       ",
          "confidence": 0.99
        },
        {
          "type": "anachronism|style",
          "original": "Ji trumpam pažvelgė aukštyn į didingų, senųjų ąžuolų viršūnes, kurios siūbavo nuo tolimos perkūnijos. Iš Vakarų, iš už vandenų, nepermaldaujamai artėjo didžiulė, juoda kaip smala audra.",
          "fixed": "Ji pažvelgė aukštyn į aukštus ąžuolus, kurie šaukė nuo tolimos pergunijos. Iš vakarų, iš už jūros, artėjo didinga juoda audra.",
          "explanation": "         - 'Didingų' ir 'senųjų' – per daug būdvardžių. Pakeista į 'aukštus' (senovės lietuvių kalboje būdvardžiai naudoti retai).         - 'Siūbavo' – modernus žodis. Pakeista į 'šaukė' (senovės lietuvių kalboje 'šaukti' reiškė skambėti, girdėti).         - 'Perkūnijos' -> 'pergunijos' (XIV a. lietuvių kalboje 'perkūnas' buvo dievas, o 'pergunija' – jo garbėjimas).         - 'Nepermaldaujamai' – modernus būdvardis. Pakeista į 'didinga' (senovės lietuvių kalboje 'didinga' reiškė didingą, stulbinantį).         - 'Juoda kaip smala' – metafora, kuri neegzistuotų XIV a. lietuvių kalboje. Pakeista į 'juoda' (paprastas apibūdinimas).       ",
          "confidence": 0.97
        },
        {
          "type": "anachronism|grammar",
          "original": "— Eik, — ramiai, bet galingai įsakė ji. — Pasakyk jam dar vieną dalyką, kurio jis bijojo paklausti: Geležinis Vilkas šią naktį klykia ne iš alkio, o iš sielvarto.",
          "fixed": "— Eik, — sakė ji ramiai, bet galingai. — Pasakyk jam dar vieną žodį, kurį jis bijojo paklausti: Geležinis Vilkas šią nakties klyksta ne iš alkio, o iš sielos skausmo.",
          "explanation": "         - 'Ramiai, bet galingai' – modernus stilius. Pakeista į 'sakė ramiai, bet galingai' (senovės lietuvių kalboje būdvardžiai naudoti retai).         - 'Dalyką' -> 'žodį' (XIV a. lietuvių kalboje 'dalykas' reiškė dalyką, o 'žodis' – tiksliau).         - 'Klykia' -> 'klyksta' (senovės lietuvių kalboje 'klykti' reiškė skambėti, o 'klyksta' – tiesioginis veiksmas).         - 'Sielvarto' -> 'sielos skausmo' ('sielvartas' – modernus žodis, o 'sielos skausmas' – senovės lietuvių kalbos bruožas).       ",
          "confidence": 0.98
        },
        {
          "type": "anachronism|style",
          "original": "Kapitonas pasišalino, palikdamas giraitę dar gilesnėje tamsoje. Eglė vėl atsiklaupė prie ugnies, bet žarijos jau buvo pradėjusios blėsti, virstant į pilkus, šaltus pelenus. Žaidimas prasidėjo, ir niekas, net dievai, negalėjo jo sustabdyti.",
          "fixed": "Vyras išėjo, palikdamas šaltą tamsoje. Eglė atsiklaupė prie ugnies, kuri jau blėso, virstant į pelenus. Žaidimas prasidėjo, ir niekas, net dievai, negalėjo sustabdyti.",
          "explanation": "         - 'Pasišalino' -> 'išėjo' (senovės lietuvių kalboje 'pasišalinti' – retas veiksmas).         - 'Giraitę' -> 'šaltą' (XIV a. lietuvių kalboje 'giraitė' – modernus žodis, o 'šaltas' – natūralesnis).         - 'Žarijos' -> 'ugni' (XIV a. lietuvių kalboje 'žarijos' – modernus žodis, o 'ugni' – tiesioginis).         - 'Pilkus, šaltus pelenus' -> 'pelenus' (per daug būdvardžių).         - 'Žaidimas prasidėjo' – modernus metaforinis žodis. Pakeista į 'prasidėjo' (tiesioginis veiksmas).       ",
          "confidence": 0.99
        }
      ],
      "summary": "Rasta 5 klaidų, ištaisyta 5. Pagrindiniai problemų taškai: anachronizmai, perteklių būdvardžių kūrimas, netinkamas linksniavimas ir neegzistuojantys XIV a. terminai. | Rasta 5 klaidų, ištaisyta 5"
    },
    {
      "file": "references.qmd",
      "status": "skipped",
      "reason": "per trumpas"
    }
  ]
}